{
  "updated_at": "2018-09-19T03:49+0000",
  "speakers": [
    {
      "id": 29000,
      "name": "Aleksey Tsalolikhin",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Aleksey Tsalolikhin has been a UNIX/Linux system administrator for 20 years, starting at EarthLink in the mid-nineties. Aleksey's mission is increasing efficiency, productivity and quality of life of engineers through world-class training in excellent technologies. Aleksey is the organizer of the Los Angeles chapter of the League of Professional System Administrators and is a member the UNIX Users Association of Southern California.\nAleksey's firm, Vertical Sysadmin Inc., has trained staff from world-class organizations like AT&T, Samsung, Chevron, LinkedIn, VISA, Intel, Lawrence Berkeley National Laboratory, Los Alamos National Laboratory, Deluxe Technicolor and many others.\nWe present materials so that students deeply understand them, and real learning occurs. Students have said this type of training was the best training they've ever had.\n We are an authorized GitLab training partner.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29001,
      "name": "Arnel Manalo",
      "title": "",
      "twitter": "arnsec",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Arnel Manalo is a Cybersecurity Architect at Richey May Technology Solutions. Arnel has more than nine years of experience in the information technology and cybersecurity industry, with an emphasis on developing strategic security solutions for highly-regulated financial services and healthcare organizations. Arnel is a Certified Information Systems Security Professional and holds dual undergraduate degrees in Network Technology and Computer Systems Security from Colorado Technical University.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29002,
      "name": "Ben Sadeghipour",
      "title": "",
      "twitter": "nahamsec",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Ben works as the Hacker Operations Lead at HackerOne, the #1 most popular bug bounty platform by day, and a hacker by night. Prior to joining HackerOne, he has helped identify and exploit over 500 security vulnerabilities across 100s of web and mobile applications for companies such as Yahoo, Airbnb, Snapchat, The US Department of Defense, Yelp, Github, and more. He also invested time in the security community by creating a community of 200+ active hackers who share ideas and their experience. He has also held a few free workshops and trainings to teach others about security and web application hacking.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29003,
      "name": "Chris Halbersma",
      "title": "",
      "twitter": "ChrisHalbersma",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Chris is currently a Sr. Security Engineer at Verizon Digital Media Services (formerly EdgeCast). He started working with computers in High School, and having older slower computers quickly made the move to Linux and BSD's to improve performance. From then on he's worked with *nix systems almost exclusively, and a couple of years ago made the switch from being a Systems Administrator to working exclusively in Security. When not working, Chris enjoys crypto-currencies, his dogs, and putting wacky stuff on various Raspberry Pis.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29004,
      "name": "Clint Gibler",
      "title": "",
      "twitter": "clintgibler",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Dr. Clint Gibler is a senior security consultant and research director at NCC Group, a global information assurance specialist providing organizations with security consulting services. By day he performs penetration tests of web applications, mobile apps, and networks for companies ranging from large enterprises to new startups.\n\nClint has spoken at a number of conferences, including BlackHat USA, AppSec EU, AppSec Cali, SecTor, InfoSec World, Virus Bulletin, Nullcon, NBT2, MobiSys, and TRUST. Clint holds a Ph.D. in Computer Science from the University of California, Davis, where his research focused on mobile security.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29005,
      "name": "Daniel Bougere",
      "title": "",
      "twitter": "Rouxgaru",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Dan Bougere is a Senior Security Consultant at Securicon, LLC providing  ICS/SCADA clients with customized security assessments that combine  traditional vulnerability assessment with controlled penetration testing. Dan  has over 14 years of combined experience in both government and commercial  sectors as a contractor for the Department of Defense, an analyst in the  National Security Agency's TAO office, and other roles with intelligence  community partners, business, and local governments.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29006,
      "name": "Daniel DeFreez",
      "title": "",
      "twitter": "defreez",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Daniel DeFreez is a co-founder of Practical Program Analysis LLC, a boutique security firm specializing in building security tools that make pen testers and security engineers more efficient. Daniel is also currently a PhD student at the University of California, Davis, where his research focuses on developing program analysis techniques to find bugs in the Linux kernel.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29007,
      "name": "David DePina",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Currently working as a corporate recruiter for the Herjavic Group, David DePina is a professional recruiting consultant who has had the opportunity to work with and \"place\" some of the top talent in various industries throughout Southern California and surrounding states. He takes pride in his ability to align and compliment both the candidate and client with the right opportunity, skills and cultural fit. His strength has been working with Enterprise (National and Global), Commercial and start-up clients providing, Executive Search, recruiting best practices for talent acquisition and staffing divisions.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29008,
      "name": "Dorian James",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Dorian is the Manager of Security Operations at Security On Demand. A DEFCON 24, 25 and 26 contest winner, Dorian is still learning many thing cyber and is focused on leadership and team building.\n\nBefore beginning his new career, he had 20 years of extensive military experience in the areas of training, project management, threat analysis and logistical planning solutions with international implications. A military policeman by trade, Dorian also spent nearly nine years protecting US embassies and interests worldwide. Using skills, knowledge and experience gained during this time, Dorian was able to successfully transition from a senior leadership role within the Marine Corps to become a driving force at Security On Demand.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29009,
      "name": "Duncan Ng",
      "title": "",
      "twitter": "DuncanTNg",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Duncan is passionate about growing and developing the next wave of Technical Superstars and Leaders. He has worn hats in Engineering, Operations, Sales and Product within and servicing Startups, Enterprise, and Hyperscale companies.\nAt BPR Advisory he leads the Infrastructure Strategy Practice working with companies ranging from Cloud Native Startups to On-Premise / Hybrid Enterprises. BPR Advisory accelerates their client's pace of innovation and aligns costs with business outcomes.\nDuncan brings over 20 years of Management experience and is a Technical and Strategic Thought Leader driving Engineering, Operational and Financial Excellence. He is excited to work with the RaiseMe community to stretch and attain their career and learning goals.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29010,
      "name": "Emily Chance",
      "title": "",
      "twitter": "g_solaria",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Emily Chance is a consultant in the Los Angeles area. She provides OSINT services to small and medium businesses and private clients for the purpose of doing risk and security assessments. In her spare time she hangs out with her two dogs, Kirby and Qbert, and reads a lot of books about basically everything she can.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29011,
      "name": "Eric Fay",
      "title": "",
      "twitter": "icanhasfay",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Eric is an information security leader currently specializing in application security. He leads the application security program at Hulu as the manager of application security in Santa Monica. Throughout his career his responsibilities have covered protecting the applications, infrastructure and web presences of the major brands Dow Jones, Wall Street Journal, MarketWatch and, presently, Hulu. Outside the security world you can find Eric traveling with his wife, jogging around Santa Monica, or trying to improve his gaming skills.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29012,
      "name": "Hector Soto",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Hector Soto is an IT Security professional with both eight years of cybersecurity experience and eight years of progressive leadership experience. He has industry certifications and specialized training in Incident Response, Incident Handling, Malware Analysis, Network Analysis, Penetration Testing, Vulnerability Assessments, and Organizational Leadership.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29013,
      "name": "Howard Chen",
      "title": "",
      "twitter": "yaxisbot",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Howard is a member of the information security team at MeridianLink. He performs a variety of tasks from annoying developers to prank-calling the IT Helpdesk located two cubes away. His one infosec claim to fame is successfully getting kicked out of a semi-famous security researcher's office in 2014.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29014,
      "name": "Hudson Bush",
      "title": "",
      "twitter": "HomeBrewedSec",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Hudson Bush is a Senior Information Security Architect at K2 Solutions, Inc. in Southern California. When not homebrewing, Hudson spends his time assisting small and medium businesses with securing their networks.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29015,
      "name": "Ian O'Niell",
      "title": "",
      "twitter": "tahkion",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Writer of hacking tutorials with an interest in surveillance, countersurveillance, and making memes with machine learning.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29016,
      "name": "Jake Heath",
      "title": "",
      "twitter": "JacobRHeath",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Jake Heath is a penetration tester with NCC Group. Jake performs web application and network penetration tests as well as various types of hardware engagements, including hardware teardowns, physical threat modeling, and secure boot implementation. Jake holds a Master's of Science in Computer Engineering from University of Cincinnati, where he performed research in their embedded medical device lab.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29017,
      "name": "James Shewmaker",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "James Shewmaker has over 20 years of technical experience in IT, primarily developing appliances for automation and security for broadcast radio, internet, and satellite devices. He is the founder and principal consultant at Bluenotch Corporation, Long Beach, California, which provides customized security services focusing on investigations, penetration testing, and analysis to various clients.\n\nShewmaker graduated with a bachelor of science in computer science from the University of Idaho in 1998 and holds many certifications and is one of the first GIAC Platinum certified Malware (GSM) experts. He authored and maintains a portion of the material in the SANS Security 660: Advanced Penetration Testing and Exploit and Development course. His contributions include \"Preboot Attacks\" as well as \"Escape and Escalating Attacks\". He also contributed material to the SANS Institute Security 401: Security Essentials and Security 610: Reverse Engineering Malware courses.\n\nHe led the development and operation for the NetWars US CyberChallenge game beginning in June 2009. He is currently developing an independent cyber challenge, Bunker011 and is involved in the US CyberChallenge as an instructor at CyberCamps. Shewmaker regularly teaches a Tactical Offense and Defense day at these events and often speaks at DEF CON and other hacker conferences.\n\nWhile he is consumed with his gadgets and all things computer security, he also finds time to enjoy snow skiing, water sports, and aviation with his wife, son, and dog.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29018,
      "name": "Jason Ritzke",
      "title": "",
      "twitter": "Rtzq0",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Jason Ritzke is a nice guy who works for a company called Taos helping people and companies get more out of their computers and themselves. He specializes in orchestrating secure, effective, and meaningful deployments of open-source software that help businesses and individuals achieve their goals and dreams. He helps run DC562 and he's easiest to find at pwn.nz.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29019,
      "name": "John Sicklick",
      "title": "",
      "twitter": "cdrcybr",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "John Sicklick has over 30 years of experience in the aerospace industry as a software developer, systems administrator, systems integrator, and systems security engineer. John is a retired U.S. Navy Commander where he served as an Information Corps Warfare Qualified officer. John currently serves as an adjunct faculty member at a local community college, teaching courses in ethical hacking, Linux operating system, and computer forensics. He has also served as a mentor instructor for SANS. A graduate of New York Maritime College And Azusa pacific University, he holds a BS in Computer Science and an MS in Applied Computer Science and Technical Programming. He holds the GSLC, GXPN, GWAPT, GCIH, GCFE, GPEN, and CISSP certifications and the Penetration Testing &amp; Ethical Hacking certificate from the SANS Technology Institute. John is excited and honored to help others further their careers in cybersecurity.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29020,
      "name": "Josh Madrid",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Josh Madrid is from Technical Connections, a premier software and IT recruitment firm. Josh started helping people build their careers as a Hiring Manager for several years, at a security consulting firm before joining the “Dark side” as an agency recruiter. He is passionate about helping people reach their career goals.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29021,
      "name": "Julia Albright",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "I am VP of Solutions (Product Management) for NextGen Healthcare with nearly 20 years experience in Product Management in the healthcare industry. My goal is to improve provider's and patient's quality of life through medical software and medical devices. Prior to working for NextGen, I worked for several industry and thought leaders such as Siemens Healthcare, Varian Medical, and BrainLAB. I have a Ph.D. in medical physics from the Humboldt University in Berlin, Germany.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29022,
      "name": "Ken Scott",
      "title": "",
      "twitter": "pwrcycle",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Pwrcycle is a DDoS Network Security Principal Engineer and Bitcoin user since 2011. He was introduced to the privacy cryptocurrency Monero in 2016 and currently runs the Monero Los Angeles meetup. He has done mining, programmed a VPN to use Monero payments, organized the Shellcon 2017 CryptoCurrency Village, was a CFP review judge for the 2018 DEF CON Monero Village, and helped organize the DEF CON Monero Party.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29023,
      "name": "Kevin O'Connell",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Kevin OConnell has spent a lifetime in technology working as a hardware and software engineer in aerospace, a technical writer, a manufacturing quality control engineer, a network administrator, and a software tester. In a career spanning rapid changes in technology and industry, and five economic recessions, he has learned skills for keeping abreast of business needs and staying employed! He presently does course development in cyber-security for the South Bay Web Application Security Pen-testers and is on the computer science advisory board for a local college.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29024,
      "name": "Kris Rides",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Kris Rides is CEO and Co-Founder of Tiro Security, a Cyber Security Professional Services and Recruitment company based in Los Angeles.  He is a trained social engineering penetration tester,  founding Board Member of the Los Angeles Cloud Security Alliance Chapter and serves as an Advisory Board Member for CSU, Fullerton’s graduate Cyber Security Program as well as for CyberWatch West (CWW).  Kris has been working in recruitment for over 15 years of which more than 95% of that time has been spent recruiting in the tech industry.    When Kris is not attending events and talking about security & recruitment you can find him on the slopes snowboarding on scuba diving with sharks.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29025,
      "name": "Lisa Kendall",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "As the Marketing and Media Manager for CyberSN, Lisa Kendall manages digital marketing, social media, content development and events. She also coordinates and manages partnerships with conferences, career fairs, university and college events, cybersecurity networking groups, and other industry organizations. She performs speaker coordination and executive support for Deidre Diamond, Founder and CEO of CyberSN and Brainbabe, and speaker support for the CyberSN team.\n\nShe is always open to connect about conferences, events, speaking and sponsorship opportunities and to participate in things around the cybersecurity industry and women in tech. She loves hearing about cybersecurity community events happening in Boston, San Francisco, Pittsburgh, Los Angeles, Dallas, Atlanta, Connecticut, New Hampshire &amp; Maine.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29026,
      "name": "Lori Barfield",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Lori joined her first Internet startup as a senior system administrator. When that company went public, she was hooked, and helping smaller firms prevail against well established rivals has been her passion ever since. She is currently COO at a company that specializes in technical consulting and training. Lori is also a mother of five. Between the kids, the dog, and the horse, she is grateful for a full and happy home, and the occasional escape to the woods with her husband.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29027,
      "name": "Mary Sawyer",
      "title": "",
      "twitter": "0x_90",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Mary Sawyer is a member of the Red Team at Palo Alto Networks. In addition to her work on the Red Team to stay ahead of the attackers by embracing their mentality, strategies and tactics to test the organization's security posture, Mary is also innovating on the Purple Team program. When she's not breaking things, Mary enjoys playing and writing original content for Dungeons and Dragons, eating spicy food, and hiking.\n\nMary has a bachelor's degree in Computer Science, with a certificate in Information Security, from the University of Texas at Austin. She is a strong advocate for inspiring and empowering girls through technology.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29028,
      "name": "Mattias Huber",
      "title": "",
      "twitter": "gitgiant",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Mattias is an engineer at Qualcomm working on cellular security research.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29029,
      "name": "Merissa Villalobos",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Merissa Villalobos is a consultative talent advisor with 10 years of recruiting experience in security. She is a previous panelist for TiaraCon and BSidesLV. Outside of work, she volunteers as a professional development mentor and job coach for local and national security groups/events; as well as, domestic and global non-profits. Each day she works to drive recruiting innovation and increase diversity in security.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29030,
      "name": "Merlin Corey",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Merlin is a software and systems wizard with a penchant for cryptography and security who loves to share knowledge and ideas with anyone who will listen. Professionally, Merlin is currently working as an Engineer for a block chain security focused startup called Pandoblox.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29031,
      "name": "Michael Roberts",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Michael Roberts is a penetration tester with NCC Group. Michael performs web, mobile application and network penetration tests, and has a passion for virtual reality and machine learning outside of work life. Michael holds an bachelor's degree in computer and information technology from Purdue University.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29032,
      "name": "Michael Wylie",
      "title": "",
      "twitter": "TheMikeWylie",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Michael Wylie, MBA, CISSP is the Director of Cybersecurity Services at Richey Richey May Technology Solutions. In his role, Michael is responsible for delivering information assurance by means of vulnerability assessments, cloud security, penetration tests, risk management, and training. Michael has developed and taught numerous courses for the U.S. Department of Defense, Moorpark College, California State Universities, and clients around the country. Michael holds credentials from certifying bodies such as ISC2, Cisco, VMware, Dell, EC-Council, CompTIA, and more.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29033,
      "name": "Mike Rich",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Mike became hopelessly enthralled with computer and network security towards the end of his 20-year career with the Air Force. Though, truth be told, he was cracking Bulletin Board Systems and stumbling onto Telnet logins on his CoCo 2 &amp; 3 back in the late 80s. After a brief stint as a government contractor he went full commercial and has been enjoying himself greatly. Mike is currently the Director of IT Security, Infrastructure, and Operations at Motion Picture Industries Pension and Health Care Plan. Google it.In his spare time Mike codes, hacks, and exploits white-line tunneling through the Los Angeles traffic firewalls. He spoke at DEFCON 24. At DEFCON 25 he was a member of Gateherder’s DCDarknet winning team, specializing in binary reversing and exploitation. He has also published a couple of times in 2600. His absolute favorite piece of IT paper is his OSCP. You should get yours.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29034,
      "name": "Mike Weilgart",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Mike Weilgart has loved maths and computers all his life. He worked in a variety of positions including software QA, calculus teacher, and graphic design, before resolving to put his love of computers to professional use as a Linux sysadmin and trainer. Mike currently consults at a Fortune 50 company as an automation specialist, and enjoys nothing more than training people to full mastery of their tools.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29035,
      "name": "Plug",
      "title": "",
      "twitter": "plugxor",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Plug is currently a Paranoids FIRE member at Oath. He started his journey in computer security back in 1996 when he discovered a 2600 magazine that eventually lead him to his first LA2600 meeting in 1998. From that point forward he has been involved in computer security. He has worked as Systems Administrator, Security Analyst and Security Engineer in the Finance and Telecom sector. In his free time he enjoys building Legos, playing with synthesizers and modular systems, when possible he volunteers his time to computer security events.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29036,
      "name": "Ravin Kumar (Canyon289)",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Ravin Kumar is a Data Scientist by day and a hacker enthusiast at night. He has been involved in security circles for over a decade now and is a keyholder at 23b Hackerspace where he and the other keyholders maintain an open space for the community to come learn anything from fabrication, to lock picking, to cybersecurity.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29037,
      "name": "Richard Greenberg",
      "title": "",
      "twitter": "ragreenberg",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Richard Greenberg, CISSP is the CISO for the LA County Department of Public Health. Previous positions include Director of Surveillance and Information Systems, Chief of Security Operations, Director of IT, and Project Manager for various companies/agencies in the private and public sectors.\n\nRichard brings over 25 years of management experience and has been a strategic and thought leader in IT and Information Security for both the private and public sectors. His Project Management, Security Management and Operations, and Policy and Compliance experience has helped shape his broad perspective on creating and implementing Information Security Programs in organizations.\n\nRichard is the President of the ISSA and OWASP Los Angeles Chapters. He and his chapter have been a recipient of the OWASP Chapter of the year.\n\nRichard has been a published author and has spoken on Information Security individually and on panels, most recently at the ISSA CISO Forum in May and \"A Day in the Life of a CISO\" for the Argyle CISO Forum in November 2017. He is also a Security Evangelist, helping to spread the word about secure application development and general security awareness.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29038,
      "name": "Ron Blanchard",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Ron Blanchard is a Principal Consultant at Dimension Data focused on aligning technology solutions to business outcomes. Previously Ron has worked as a SE Manager and sales engineer for over 10 years. Ron entered the IT field by transitioning from a career as a high school science teacher and continues to apply his teacher traits to help foster growth and development.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29039,
      "name": "Sean McAllister",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Sean McAllister has been involved in the information security professionally for the last 10 years, and as a passion long before that. He has worked for both the private and public sector as an application security consultant and reasearcher. He is currently a Managing Partner at Cytense Inc. and organizer of ShellCon (https://shellcon.io/).",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29040,
      "name": "Tejas Dharamshi",
      "title": "",
      "twitter": "tejasdharamshi",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Tejas Dharamshi is a Senior Security Software Engineer at Netflix. Tejas specializes in security and is focused on corporate Identity and Access, multi-factor authentication, adaptive authentication and user-focused security at scale.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29041,
      "name": "Tj McClerain",
      "title": "",
      "twitter": "CellPhoneDude",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "As the CEO of Xcape, Inc., a Managed Services Provider in the greater Los Angeles area, Tj McClearin is both executive and lead hacker with a background in Corporate IT, Mobile Networks &amp; Devices, Virtualization, Disaster Recovery, Network Security, DFIR, and FinTech. He's not your typical executive, while often claiming he can't code, he's responsible for the corporate website and the server that it sits on. He's previously held positions as a network engineer, sys admin, and director at previous companies.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29042,
      "name": "Vyrus",
      "title": "",
      "twitter": "vyrus001",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Vyrus may or may not have begun his offensive security training in early childhood through a series of allegedly criminal acts for a hacker collective still active on the internet today. Over the last approximately 2 decades these experiences have expressed themselves through participation within a variety of both independent, as well as corporate; technically legal information security professions. While the specific nature of many of these professions has yet to be disclosed, the professional skills Vyrus has been known to utilize throughout employment include but are not limited to: reverse engineering, penetration testing, \"red teaming\", security controls analysis, proof of concept malware development, incident response, implant development, exploit development, long term electronic surveillance, traffic analysis, complex systems risk analysis, many forms of wireless security, hardware security assessment, and general IT solution development &amp; support.",
      "conference": "SC02",
      "link": ""
    },
    {
      "id": 29043,
      "name": "Wayne Folsom",
      "title": "",
      "twitter": "",
      "updated_at": "2018-09-19T03:49+0000",
      "description": "Wayne has over 35 years of experience in the defense/aerospace sector with a track record of technical innovation, customer satisfaction and business success.",
      "conference": "SC02",
      "link": ""
    }
  ]
}