{
  "updated_at": "2018-10-05T23:03+0000",
  "schedule": [
    {
      "title": "Capture the Flag 8.0 ",
      "end_date": "2018-10-07T16:00+0000",
      "id": 26878,
      "location": 30209,
      "description": "Contest runs from Friday 12pm to Sunday 12pm\r\n\r\nFriday: 12pm to 9pm, Saturday: 9am to 9pm\r\n\r\nSunday: 10am to 12pm\r\n\r\nCome and test your skillz! Come and compete against other\r\n\r\npeople in the industry!\r\n\r\nThe capture the flag event is an open event and there are no qualifiers. Anyone can participate via self-registration. There will be posters around the venue with information on how to connect and play as well as information regularly distributed through the official DerbyCon CTF Twitter account @DerbyConCTF.\r\n\r\nThe wireless network information is:\r\n\r\nWireless SSID: DerbyCon-CTF\r\n\r\nPassword: DerbyCon-CTF\r\n\r\nAfter connecting to CTF network, registration and rules located at https://scoreboard.ctf.derbycon.com\r\n\r\nPRIZES:\r\n\r\nBlack Badge\r\n\r\n2019 Conference Ticket   –   $500 cash   –   $350 cash\r\n\r\n$200 cash   –   $100 cash   –   $100 Visa gift card   –   $100 Visa gift card\r\n\r\n$50 Amazon gift card   –   $50 Amazon gift card\r\nWinners announced @ closing ceremony\r\n\r\nBYOEPC – Bring your own ethernet patch cord\r\n\r\nSponsored By: Synack",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-04T16:52+0000"
    },
    {
      "title": "How to influence security technology in kiwi underpants",
      "end_date": "2018-10-05T13:50+0000",
      "id": 30245,
      "location": 30208,
      "description": "",
      "speakers": [
        30239
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:15+0000"
    },
    {
      "title": "Panel Discussion - At a Glance: Information Security",
      "end_date": "2018-10-05T14:50+0000",
      "id": 30246,
      "location": 30208,
      "description": "Welcome to DerbyCon 8.0! This year we have panelists from a number of different areas around INFOSEC. We will be sharing our experiences, where we think INFOSEC is heading, as well as looking at the current state. We are super excited at our panelists for this keynote and look forward to engaging questions from the audience as well as the moderator. Our panelists will be sharing war stories, how they got started, where the industry is heading, and questions from the audience. This will be a free form panelist discussion and audience participation is expected!",
      "speakers": [
        30240,
        30241,
        30242
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:15+0000"
    },
    {
      "title": "Red Teaming gaps and musings",
      "end_date": "2018-10-05T16:25+0000",
      "id": 30247,
      "location": 26053,
      "description": "Red Teaming is currently the closest most companies get to adversary emulation. While Red Teaming can do a good job pointing out security gaps, blind spots, and human weaknesses within an organization, there are also limitations. Engagement SOW’s, timelines, and laws impose limitations which can unwittingly push a Red Team engagement far from adversary emulation. Some thoughts on the current status quo, and ways to mix it up.",
      "speakers": [
        30243
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:16+0000"
    },
    {
      "title": "A Process is No One: Hunting for Token Manipulation",
      "end_date": "2018-10-05T16:55+0000",
      "id": 30248,
      "location": 26053,
      "description": "Does your organization want to start Threat Hunting, but you’re not sure how to begin? Most people start with collecting ALL THE DATA, but data means nothing if you’re not able to analyze it properly. This talk begins with the often overlooked first step of hunt hypothesis generation which can help guide targeted collection and analysis of forensic artifacts. We will demonstrate how to use the MITRE ATTACK Framework and our five-phase Hypothesis Generation Process to develop actionable hunt processes, narrowing the scope of your Hunt operation and avoiding “analysis paralysis.” We will then walk through a detailed case study of detecting access token impersonation/manipulation from concept to technical execution by way of the Hypothesis Generation Process.",
      "speakers": [
        30244,
        30245
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:16+0000"
    },
    {
      "title": "Fuzz your smartphone from 4G base station side",
      "end_date": "2018-10-05T17:25+0000",
      "id": 30249,
      "location": 26053,
      "description": "In this upcoming IoT world, more wireless transmission technique are used for IoT devices, such as WiFi, Bluetooth, ZigBee, Z-Wave, and cellular network (2G/3G/4G). We can fuzz the wireless transmission technique as well, but there are rare fuzzing tools, especially for cellular network. The most difficult part of fuzzing cellular network is building the cellular network environment, not make the corresponding fuzzer. In our representation, we will introduce how to build the 4G LTE environment yourself with limited budget. Afterward, we rewrited the 4G LTE base station and send the malformed LTE message to fuzz your smartphone. After our fuzz testing, we found the vulnerability which could cause your smartphone cannot work as normal and this vulnerability will affect the smartphone which use the specific Qualcomm CPU.",
      "speakers": [
        30246
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:17+0000"
    },
    {
      "title": "Clippy for the Dark Web: Looks Like You’re Trying to Buy Some Dank Kush, Can I Help You With That?",
      "end_date": "2018-10-05T17:55+0000",
      "id": 30250,
      "location": 26053,
      "description": "The dark web’s inherent hostility to observation makes it the perfect place for whistleblowers, freethinkers… and criminals. This design, build with anonymity and fully private operations in mind, also makes it almost impossible to use. Is there a future where the dark web is both easy to use and still maintains the core functionality necessary to protect its users? Does making the dark web easier to use inherently open it up to unchecked monitoring by private companies and law enforcement? Will legal users of the dark web be swept up in efforts to crack down on illegal activity on the dark web? And if we do see a growth in  ease of use tools, is someone finally going to make a Clippy for the dark web? This session will cover the underlying structure of the dark web and the of “ease of use” tools developed for dark web users over time, specifically the tools that facilitate ecommerce for buyers in a diversified criminal market. This talk will also address the inherent tension between the dark web as a bastion of privacy and anti-authoritarian sentiment and the dark web as a usable, functional repository of institutional knowledge. If you’ve heard of the dark web before but your first thought is “I think I remember Silk Road was a thing,” this talk may be for you.",
      "speakers": [
        30247
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:17+0000"
    },
    {
      "title": "Synfuzz: Building a Grammar Based Re-targetable Test Generation Framework",
      "end_date": "2018-10-05T18:25+0000",
      "id": 30251,
      "location": 26053,
      "description": "Fuzzers have played an important role in the discovery of reliability and security flaws in software for decades. They have allowed for test case generation at a rate impossible by hand and the creation of test cases humans may never conceive of. While there are many excellent fuzzers available most are designed for mutating source files or input in random ways and attempting to discover edge cases in the handling of them. Some others are designed with structured input in mind and use grammars to more strategically generate and mutate possible inputs that adhere to the format defined. These specifically are the ones we care about for the goals of identifying differences between multiple implementations of a single language, finding bugs in parse tree generation/handling of tokens, and handling of the data at runtime once it has been successfully lexically and syntactically analyzed. We’ll look at some of the shortcomings of existing fuzzers and discuss the implementation for a new platform designed to make fuzzer creation easier with the goal of being able utilize grammars from the implementations of the languages themselves.",
      "speakers": [
        26153
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:17+0000"
    },
    {
      "title": "Escoteric Hashcat Attacks",
      "end_date": "2018-10-05T18:55+0000",
      "id": 30252,
      "location": 26053,
      "description": "Ever wonder how to get past the 70% password cracking barrier, EvilMog will talk about the Infinite Monkey Theory of Password Cracking, unique attack methods such as Raking, Purple Rain, Prinception and other high entropy attack techniques including live demos.",
      "speakers": [
        30249
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:18+0000"
    },
    {
      "title": "NOOb OSINT in 30 Minutes or less!",
      "end_date": "2018-10-05T19:25+0000",
      "id": 30253,
      "location": 26053,
      "description": "OSINT is more than making a fake Facebook account and looking up your EX. We will cover the basic level skills and places to get a Noob on the correct path in 30 minutes or less. Social Media, Government Sites, Paid Sites and free Training sites will be demonstrated.",
      "speakers": [
        30250
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:19+0000"
    },
    {
      "title": "RFID Luggage Tags, IATA vs Real Life",
      "end_date": "2018-10-05T19:55+0000",
      "id": 30254,
      "location": 26053,
      "description": "IATA and Airlines have been testing RFID equipped luggage tags since the early 2000's. Their RFID standard includes multiple PII fields and security information, but, how are these tags actually used? With over a year of luggage tags donated by traveling hackers, I have compiled a survey of these tags as implemented by US carriers. ",
      "speakers": [
        30251
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:20+0000"
    },
    {
      "title": "#LOL They Placed Their DMZ in the Cloud: Easy Pwnage or Disruptive Protection",
      "end_date": "2018-10-05T20:25+0000",
      "id": 30255,
      "location": 26053,
      "description": "Uber Did It To Taxis, AirBnB Did It To Hotels, Could External Cloud DMZ Models do it to IT and InfoSec?  The perimeter is open, Swiss cheese firewalls, compromised endpoints, vulnerable URLs, malware and ransomware... Things that make pentesting reasonably easy.... What if this all goes away in a new design model that truly limits movement based on simple principals; requiring two factor authentication from everyone, only white listed application connections, and the enabling of Drop all other \"All Inbound and Outbound Traffic\" Firewall Rules. Sound like a Pentester's nightmare, Welcome to your future.",
      "speakers": [
        30252
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:20+0000"
    },
    {
      "title": "Maintaining post-exploitation opsec in a world with EDR",
      "end_date": "2018-10-05T20:55+0000",
      "id": 30256,
      "location": 26053,
      "description": "How a modern pentesting or red team can remain stealthy during post exploitation activities. Will go in depth on various code execution and lateral movement techniques and indicate ways to improve upon these methods.",
      "speakers": [
        30253,
        30254
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:21+0000"
    },
    {
      "title": "Hey!  I found a vulnerability – now what?",
      "end_date": "2018-10-05T21:25+0000",
      "id": 30257,
      "location": 26053,
      "description": "You found a vulnerability in a product and decide to responsibly disclose the issue. Thank you! This should be an easy task to do - right, but what are the steps? This talk will cover what to consider in submitting a vulnerability report and how to submit a good vulnerability report. We will discuss why you should submit a report and will cover the pros and cons of supplying a disclosure date and what Coordinated Vulnerability Disclosure really means. You will also get a behind the scenes insight into what really goes on after the issue was disclosed. We will also touch on scenarios such as what if the issue affects more than one company, and who can help if you don’t feel like reporting the issue directly to a company. The talk will also cover some tips and choices you have for after the issue is disclosed/addressed.  The ups and downs of your end goal – are you there to help protect yourself and other consumers, protect the company, or go for fame – or can you do it all?",
      "speakers": [
        30255,
        30256
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:21+0000"
    },
    {
      "title": "Foxtrot C2: A Journey of Payload Delivery",
      "end_date": "2018-10-05T21:55+0000",
      "id": 30258,
      "location": 26053,
      "description": "Execution of an offensive payload may begin with a safe delivery of the payload to the endpoint itself. When secure connections in the enterprise are inspected, reliance only on transmission level security may not be enough to accomplish that goal. Foxtrot C2 serves one goal: safe last mile delivery of payloads and commands between the external network and the internal point of presence, traversing intercepting proxies, with the end-to-end application level encryption. While the idea of end-to-end application encryption is certainly not new, the exact mechanism of Foxtrot's delivery implementation has advantages to Red Teams as it relies on a well known third party site, enjoying elevated ranking and above average domain fronting features. Payload delivery involves several OpSec defenses: sensible protection from direct attribution, active link expiration to evade consistent interception, inspection, tracking and replay activities by the defenders. Asymmetric communication channels will also be used. And if your standalone Foxtrot agent is caught, the delivery mechanism may live on, you could still manually bring the agent back into the environment via the browser. A concept tool built on these ideas will be presented and released. It will be used as basis for our discussion.",
      "speakers": [
        30257
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:22+0000"
    },
    {
      "title": "IRS, HR, Microsoft and your Grandma: What they all have in common",
      "end_date": "2018-10-05T16:50+0000",
      "id": 30259,
      "location": 26049,
      "description": "Vishing is quickly becoming one of the most dangerous vectors in the world of social engineering. With 1000's of hours of vishing recorded, dozens of pretext's used and thousands of compromises under our belt, Chris will analyze some giant data sets to examine what these threats look like, and how to prepare for the future of vishing. He will delve deep into what we can learn from one of the largest recorded data sets of vishing calls in the world and what that means for the future of social engineering.",
      "speakers": [
        30258,
        30259
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:37+0000"
    },
    {
      "title": "I Can Be Apple, and So Can You",
      "end_date": "2018-10-05T16:50+0000",
      "id": 30260,
      "location": 26050,
      "description": "Cryptographic verification of executables is a core security feature that many third-party developers and security personnel have learned to trust. During this talk, the speaker will cover the most recent Apple code signing bug that was found to affect everyone that uses Apple’s documented APIs for conducting code signing checks of signed applications. This will include the methodology for finding the issue, the reporting process, working with vendors, and a path forward for organizations that use Apple code signing as a measure of trust.",
      "speakers": [
        30260
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:38+0000"
    },
    {
      "title": "Invoke-EmpireHound - Merging BloodHound & Empire for Enhanced Red Team Workflow",
      "end_date": "2018-10-05T16:50+0000",
      "id": 30261,
      "location": 26051,
      "description": "Empire & BloodHound are two great Post-Exploitation Tools. Since I am a PowerShell fanboy, I decided to glue them together, just to see what could happen... and so I created 3 modules: EmpireStrike - to control Empire Server(s). CypherDog    - to interact with the BloodHound Database. EmpireDog    - to automate CypherDog/EmpireStrike interactions. In this presentation I will demonstrate how to add the Empire infrastructure to the BloodHound Graph and control both BloodHound & multiple Empire servers from a single PowerShell prompt, with changes to Empire automatically reflected in the BloodHound Database and Graph.",
      "speakers": [
        30261
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:38+0000"
    },
    {
      "title": "The History of the Future of Cyber-Education",
      "end_date": "2018-10-05T16:50+0000",
      "id": 30262,
      "location": 26052,
      "description": "When I think about what cybersecurity education in the future should look like it almost immediately falls into place like a game of Asteroids: and another triad was born. I believe in threes. For all the reasons. The premise is that cybersecurity is often laser focused on an insanely complex specific subset of a set of threats and/or vulnerabilities; perhaps an IoT MQTT-SN protocol weakness. Where, though, do we teach in greater overarching strategic generalities? The following notional triad for the future of cybersecurity education is, I believe, synergistic – self-reinforcing, and would complement more traditional approaches, yet arrive at different, more efficacious results. They all tie together. Engineering. History. Humans….It’s a triad. ",
      "speakers": [
        30262
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:39+0000"
    },
    {
      "title": "#LOLBins - Nothing to LOL about!",
      "end_date": "2018-10-05T17:50+0000",
      "id": 30263,
      "location": 26049,
      "description": "You have probably heard the term LOLBin, LOLScript or LOLLib by now. Want to get more insights on that? Then this is the talk you want to attend.This talk will cover the Living Off The Land Binaries and Scripts (LOLBAS) project, what the project is, how it became and how you can help this evolve into the future. The talk will also go over some of my favorite LOLBins that has came to light due to this project (at least that's what I like to think) and show you some cool stuff! I mean, everybody loves to see binaries misbehave.",
      "speakers": [
        30263
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:39+0000"
    },
    {
      "title": "From Workstation to Domain Admin: Why Secure Administration Isn't Secure and How to Fix It",
      "end_date": "2018-10-05T17:50+0000",
      "id": 30264,
      "location": 26050,
      "description": "Organizations have been forced to adapt to the new reality: Anyone can be targeted and many can be compromised.This has been the catalyst for many to tighten up operations and revamp ancient security practices. They bought boxes that blink and software that floods the SOC with alerts. Is it enough? The overwhelming answer is: No. The security controls that matter most are the ones that best protect those with the keys to the enterprise, the Active Directory administrators. With this access, an attacker can do anything they want in the environment: access all sensitive data, change access controls and security settings, embed to persist (for years), and often fully manage and control routers, switches, the virtualization platform (VMWare or Microsoft Hyper-V), and increasingly, the cloud platform. Administrators are being dragged into a new paradigm where they have to more securely administer the environment. This involves protecting privileged credentials and limiting access Again the question is: Are the new ways to securely administer Active Directory enough to protect against attackers? Join me in this session to find out. Some of the areas explored in this talk: * Explore how common methods of administration fail. * Demonstrating how attackers can exploit flaws in typical Active Directory administration. * Highlight common mistakes organizations make when administering Active Directory. * Discuss what's required to protect admins from modern attacks. * Provide the best methods to ensure secure administration and how to get executive, operations, and security team acceptance.",
      "speakers": [
        30264
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:41+0000"
    },
    {
      "title": "When Macs Come Under ATT&CK",
      "end_date": "2018-10-05T17:50+0000",
      "id": 30265,
      "location": 26051,
      "description": "Macs are becoming commonplace in corporate environments as a alternative to Windows systems. Developers, security teams, and executives alike favor the ease of use and full administrative control Macs provide. However, their systems are often joined to an active directory domain and ripe for attackers to leverage for initial access and lateral movement. Mac malware is evolving as Mac computers continue to grow in popularity. As a result, there is a need for proactive detection of attacks targeting MacOS systems in a enterprise environment. Despite advancements in MacOS security tooling for a single user/endpoint, little is known and discussed regarding detection at a enterprise level. This talk will discuss common tactics, techniques and procedures used by attackers on MacOS systems, as well as methods to detect adversary activity. We will take a look at known malware, mapping the techniques utilized to the MITRE ATT&CK framework. Attendees will leave equipped to begin hunting for evil lurking within their MacOS fleet.",
      "speakers": [
        30265
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:41+0000"
    },
    {
      "title": "State of Win32k Security: Revisiting Insecure design",
      "end_date": "2018-10-05T17:50+0000",
      "id": 30266,
      "location": 26052,
      "description": "Win32k.sys is infamous for being the prime target used by hackers for modern exploitation and browser/sandbox escapes on Windows: the driver managing the user and graphics subsystems. With its legacy spanning as far back as NT 4 (released in 1996), there are significant challenges with its security attestation. This talk while touching a bit of Win32k history covering its various design shifts at the expense of security, but will mostly focus on how long standing insecure design were revisited and remediate. In hindsight the talk will give a deeper analysis on various mitigations added in latest Windows release (RS4), resulting in exploits getting more expensive, unreliable and in some cases impossible.",
      "speakers": [
        30266
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:42+0000"
    },
    {
      "title": "Everything Else I Learned About Security I Learned From Hip-Hop",
      "end_date": "2018-10-05T18:50+0000",
      "id": 30267,
      "location": 26049,
      "description": "Come along on a fantastic voyage and learn Hip Hip and how it relates to information security! When I was growing up there were two things that intrigued me, computers and rap music. Using examples from my favorite genre or music, we’ll explore some interesting facets of rap music, and discuss the lessons and parallels to security today. There will be no half steppin’. It will be dope as it allows us to dig into topics such as: Is security a fad? How do we differentiate a fad from something here to stay? Encouraging youth to become security engineers, a call-to-action for the community. Deviating from established norms and setting trends, few truly change the industry, and who will change the security industry in the near future? Remembering those who have passed on and learning from their work. How true experts practice their craft (and how to best utilize their skills and share the knowledge) Few things are truly original (and it’s okay, in most cases) Not all legends reach the same pinnacle of success. What separates the best from the rest? How experts make career pivots, and actually pull it off New isn’t always better. We all have beefs (and better ways to resolve them. And no, we’re not going to dig into social media beefs) You can expect to learn a little about rap music, and the history of the rap genre, in this talk. We’ll focus on the security side by exploring industry trends and fads, tips on how to manage your career, and how to continue positive trends in the security community. Don’t be whack, attend this talk! This is a sequel to “Everything I Learned About Security I Learned From Kung Fu Movies”, and expectations should be set as such. I will share my favorite lists of rap artists, albums and tracks, and even a few Spotify playlists.",
      "speakers": [
        30267
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:42+0000"
    },
    {
      "title": "MS17-010?",
      "end_date": "2018-10-05T18:50+0000",
      "id": 30268,
      "location": 26050,
      "description": "MS17-010 is the most important patch in operating systems history. The ultimate high profile and damaging attacks, such as WannaCry, NotPetya, and Olympic Destroyer, have taken advantage of the vulnerabilities patched in MS17-010. Created by Equation Group, and leaked by Shadow Brokers, the ETERNAL family of exploits provide the most reliable and creative ways for remote code execution on Windows ever performed. Unnoticed for over 20+ years, the mechanisms behind these exploits has only been scratched at the surface by researchers, and remains an enigma for most. Take years of research into Windows internals and the SMB protocol and cram it into 45 minutes. You simply can't. But this talk will try.  Descriptions of full reverse engineering of internal structures and all historical background info needed to understand how the exploit chains for ETERNALBLUE, ETERNALCHAMPION, ETERNALROMANCE, and ETERNALSYNERGY work will be provided. Get detailed information about the historical and technical context for these vulnerabilities that will haunt us still for years to come.",
      "speakers": [
        26191
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:43+0000"
    },
    {
      "title": "Abusing IoT Medical Devices For Your Precious Health Records",
      "end_date": "2018-10-05T18:50+0000",
      "id": 30269,
      "location": 26051,
      "description": "This talk discusses the risks of connected healthcare devices. It looks at the benefits of adopting IoT for medical devices, current exposure, common communication channels in use as well as interconnectivity approaches used with other critical components. Based off output from security assessments performed against medical devices widely deployed at various hospitals and medical institutions, we will present an in-depth analysis of the target medical device and elaborate on how we were able to compromise them to gain access to plethora of medical records from all the medical institutions they were deployed at and not just the one where our target devices were hosted.We will introduce the threat surface exposed by various medical devices and present some of the real-world attacks against some popular devices & their impact on humans as well as the overall ecosystem they are connected to. Some devices rely on proprietary hardware on licensed bands, which reduces the risk of interference from consumer connected devices, but doesn’t provide security as implied in marketing materials. Others rely on standard WiFi security measures for confidentiality and are prone to MitM attacks. Healthcare devices that implement IrDA could yield interesting results when interfaced with cheap $10 hardware.There are many consumer items that fall under the umbrella of IoT and while it may be hard to understand the impact of hacking a toaster, we can all agree that manipulation of a medical device could lead to rather serious consequences. Apart from putting a patient's life at risk, an attacker could compromise a healthcare device to steal patient data. This presentation will primarily focus on the latter with real-world examples and a case study. We will demonstrate the compromise of a healthcare device to steal medical records, which typically include PII, health insurance data, medical history, SSNs, prescriptions etc.",
      "speakers": [
        30269,
        30270
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:43+0000"
    },
    {
      "title": "Offensive Browser Extension Development",
      "end_date": "2018-10-05T18:50+0000",
      "id": 30270,
      "location": 26052,
      "description": "For the past few years, malware authors have abused the extension development functionality of Chrome and Firefox. More often than not, these extensions are abused for standard crimeware activities, such as ad click fraud, cryptocurrency mining, or stealing banking credentials. But this is only scratching the surface of what is possible if the appropriate browser APIs are abused. Extensions can act as a foothold into a target's internal network, provided a single user can be convinced to click two buttons. As a post-exploitation mechanism, extensions can be side-loaded with the ability to read and write files to disk. These actions will all be performed from the browser process(es) and likely go undetected by conventional endpoint protection solutions. This talk will discuss the creation, deployment, and usage of malicious browser extensions so that other red teamers can add this attack vector to their toolkit.",
      "speakers": [
        30271
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:44+0000"
    },
    {
      "title": "Hackers, Hugs, & Drugs: Mental Health in Infosec",
      "end_date": "2018-10-05T19:50+0000",
      "id": 30271,
      "location": 26049,
      "description": "The information security community is difficult to compare to any other. We are composed of intelligent, driven, passionate, opinionated individuals. When you combine the pressure and stress we put on ourselves in the form of research, learning, teaching, and creating it starts to build up. Not only do we put pressure on ourselves, but we also take it on from our bosses, co-workers, and family in many different forms. The majority of roles we fill cater to our drive and willingness to be behind a keyboard for hours on end. The end result is that many of us are broken. Broken in different ways, at different times, and for different reasons. We need to bring to light a topic that shouldn't be as faux pas as it is. I'll share my personal struggles, stories of friends and family, and hopefully help us come closer together as a community to help you or people around you.",
      "speakers": [
        30272
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:45+0000"
    },
    {
      "title": "The Unintended Risks of Trusting Active Directory ",
      "end_date": "2018-10-05T19:50+0000",
      "id": 30272,
      "location": 26050,
      "description": "Your crown jewels are locked in a database, the system is patched, utilizes modern endpoint security software, and permissions are carefully controlled and locked down. Once this system is joined to Active Directory, however, does that static trust model remain the same? Or has the number of attack paths to your data increased by an order of magnitude? We’ve spent the last year exploring the access control model of Active Directory and recently broadened our focus to include security descriptor misconfigurations/backdoor opportunities at the host level. We soon realized that the post-exploitation “attack surface” of Windows hosts spans well beyond what we originally realized, and that host misconfigurations can sometimes have a profound effect on the security of every other host in the forest. This talk will explore a number of lesser-known Active Directory and host-based permission settings that can be abused in concert for remote access, privilege escalation, or persistence. We will show how targeted host modifications (or existing misconfigurations) can facilitate complex Active Directory attack chains with far-reaching effects on other systems and services in the forest, and can allow new AD attack paths to be built without modifying Active Directory itself.",
      "speakers": [
        30273,
        30274,
        30275
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:46+0000"
    },
    {
      "title": "Detecting WMI exploitation",
      "end_date": "2018-10-05T19:50+0000",
      "id": 30273,
      "location": 26051,
      "description": "Windows Management Instrumentation (WMI) is loved by the Red Team, Pentesters, and the criminals.  There are a few exploitation tools available such as WMImplant, WMILM, and Metasploit.  Utilizing WMI in attacks is popular since it does not log much, is very good for remote attacks, and includes a database to hide persistence and payloads.  The use of WMI has also been used in what is referred to as fileless malware, and can even include PowerShell. WMI attacks CAN be detected, and everyone should understand how to search for, detect, and all the Fu that goes along with WMI attacks.  The reason? By default, Windows does log much to detect WMI exploitation, so there is some work to do you need to know about. This talk will show a few examples of WMI exploitation, what and why it can be detected, what you need to configure to catch attacks, what additional things you will need to hunt for WMI pwnage across your environment.  Also discussed will be some examples of log management queries, tools you might use to capture malicious WMI activity.",
      "speakers": [
        30276
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:46+0000"
    },
    {
      "title": "Protect Your Payloads: Modern Keying Techniques",
      "end_date": "2018-10-05T19:50+0000",
      "id": 30274,
      "location": 26052,
      "description": "Our payloads are at risk! Incident responders, threat hunters, and automated software solutions are eager to pick apart your new custom dropper and send you back to square one. One answer to this problem is encrypting your payload with key derivation functions (\"keying\") which leverages a variety of local and remote resources to build the decryption key. Throughout this talk I will present modern keying techniques and demo some tools to help along the way. I will start with showing how easy it is to discover attacker infrastructure or techniques in the payloads we commonly use every day. I will then quickly review how keying helps and the considerations when generating keyed payloads. Throughout the presentation many practical examples of keying techniques will be provided which can be used for typical pentests or full red team operations. Finally I will introduce KeyServer, a new piece to add to your red team infrastructure which handles advanced HTTP and DNS keying. Using unprotected payloads during ops should be a thing of the past. Let’s regain control of our malicious code and make it harder on defenders! This talk is based on the original research of environmental keying by Josh Pitts and Travis Morrow.",
      "speakers": [
        30277
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:47+0000"
    },
    {
      "title": "Android App Penetration Testing 101",
      "end_date": "2018-10-05T20:50+0000",
      "id": 30275,
      "location": 26049,
      "description": "Join us for a fun journey through  the steps  we use as penetration testers to find vulnerabilities in Android applications.  The talk will introduce the audience to testing environment creation, and demonstrate how to shorten the learning curve to in order to obtain meaningful results when performing mobile application security assessments.  As part of the talk, we will provide a free mobile application that will contain vulnerabilities from the OWASP Mobile Top 10 that can be used to practice vulnerability discovery.",
      "speakers": [
        30278,
        30279
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:47+0000"
    },
    {
      "title": "Lessons Learned by the WordPress Security Team",
      "end_date": "2018-10-05T20:50+0000",
      "id": 30276,
      "location": 26050,
      "description": "Managing security for the WordPress project is a challenge to say the least. The sheer volume of reports, the resulting noise, securing an aging codebase, handling disclosure – all difficult to handle, but just the tip of the iceberg. How do you motivate and organize a volunteer team? How do you keep sites and users secure with so much third-party code? How do you educate users? When is it okay to break things to fix security issues and how do you manage reputation when you do? Should you backport? How far? They may not have it all figured out, but over the years they’ve learned a lot – often the hard way. Aaron has led the WordPress Security Team since the end of 2016 and been a part of it for over five years. He’ll share what he’s learned along the way, how things have improved, what changes didn’t help (even when they were sure they would), and what things they still struggle with. He’ll also share an overview of the tools they use and processes they follow, in hopes that no one else has to learn the hard way.",
      "speakers": [
        30280
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:47+0000"
    },
    {
      "title": "Gryffindor | Pure JavaScript, Covert Exploitation",
      "end_date": "2018-10-05T20:50+0000",
      "id": 30277,
      "location": 26051,
      "description": "Network defenses are evolving at an unprecedented rate. Our open source toolkit has become ever more difficult to use while pentesting or red teaming on the top tier of networks. Moving into the next generation of offensive operations, we will need to begin testing with tools that closely mirror legitimate application and network behavior. Gryffindor is a pure JavaScript post-exploitation agent that splits the standard model for command and control. It weaponizes the target's web browser to perform all network communication and leverages the Windows Scripting Host (WSH) for the purposes of system execution. In this talk we will walk through the model for idealized remote access including the use social media sites as a platform for covert communication. By leveraging inherent JavaScript capabilities, security professionals can acquire interactive sessions within a browser, harvest sensitive information against arbitrary origins, and pivot into internal networks. Between the browser and the host, there is ripe potential for catastrophic damage.",
      "speakers": [
        30281
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:48+0000"
    },
    {
      "title": "Jump Into IOT Hacking with the Damn Vulnerable Habit Helper Device",
      "end_date": "2018-10-05T20:50+0000",
      "id": 30278,
      "location": 26052,
      "description": "In this talk, husband and wife team Phoenix and Nancy Snoke introduce the Damn Vulnerable Habit Helper (DVHH) IOT device. DVHH contains a hardware device, mobile application, web application and associated api calls / network communication. DVHH was built to make getting started in IOT hacking more accessible to everyone. This talk will introduce the DVHH. We discuss why we created DVHH, how it is architected, and how to get started using it. As hardware hacking seems to be the sticking point for many on hacking IOT, this talk will include Phoenix talking an audience member through a live hardware hacking demonstration on the DVHH device (chosen at random). A parts lists and instructions / schematic will be given for the hardware inclined who wish to build their own device. All necessary parts can be bought for under 30 dollars. Several prebuilt hardware devices will be available for demo purposes.",
      "speakers": [
        30282,
        30283
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:48+0000"
    },
    {
      "title": "Draw a Bigger Circle: InfoSec Evolves",
      "end_date": "2018-10-05T21:50+0000",
      "id": 30279,
      "location": 26052,
      "description": "InfoSec has never been more needed, or more in demand.  Against a geopolitical backdrop of escalating tensions and drama, there are new attack methods and IoT nightmares as we drown in data. How do we, as a community, evolve to find the people we need to grow into the future? This talk explores our extraordinary strengths as a community, and how InfoSec needs to grow forward to address the challenges ahead. We'll explore some existing mindsets and open the door to unconventional backgrounds. Where does our communal knowledge benefit by drawing from more sources to enhance our big picture? What can we gain from where we aren’t we looking? We'll look at how we see ourselves within this community. Imposter syndrome and elitism are two sides of the same coin. What are the definitive benefits we derive as members of this collective? How do we find out who is part of our community? While our ability to close ranks against intruders is a strength, is it holding us back by holding us in? Infosec is more than a career. It’s a community we call home, an extraordinary incubator of skill and talent that needs our help to keep growing. But to bring in the people we need, we have to think outside the box and draw a bigger circle.",
      "speakers": [
        30284
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:48+0000"
    },
    {
      "title": "Draw a Bigger Circle: InfoSec Evolves",
      "end_date": "2018-10-05T21:50+0000",
      "id": 30280,
      "location": 26049,
      "description": "InfoSec has never been more needed, or more in demand.  Against a geopolitical backdrop of escalating tensions and drama, there are new attack methods and IoT nightmares as we drown in data. How do we, as a community, evolve to find the people we need to grow into the future? This talk explores our extraordinary strengths as a community, and how InfoSec needs to grow forward to address the challenges ahead. We'll explore some existing mindsets and open the door to unconventional backgrounds. Where does our communal knowledge benefit by drawing from more sources to enhance our big picture? What can we gain from where we aren’t we looking? We'll look at how we see ourselves within this community. Imposter syndrome and elitism are two sides of the same coin. What are the definitive benefits we derive as members of this collective? How do we find out who is part of our community? While our ability to close ranks against intruders is a strength, is it holding us back by holding us in? Infosec is more than a career. It’s a community we call home, an extraordinary incubator of skill and talent that needs our help to keep growing. But to bring in the people we need, we have to think outside the box and draw a bigger circle.",
      "speakers": [
        30284
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:52+0000"
    },
    {
      "title": "IronPython... omfg",
      "end_date": "2018-10-05T21:50+0000",
      "id": 30281,
      "location": 26050,
      "description": "Over the course of the last few years, PowerShell has been the number one way of conducting essentially any type of offensive operation on Active Directory networks and Windows endpoints. It allows offensive personnel to execute implants completely in memory, stealthily conduct situational awareness, and dynamically leverage the underlying power of .NET. Due to recent protections put in place by Microsoft, PowerShell is becoming increasingly less viable to use offensively. These protections are \"baked in\" to the latest versions of the Windows operating systems and allow AV/EDR/Logging solutions to gain an overwhelming amount of insight into PowerShell execution, and even, in some cases, completely shut down any type of malicious PowerShell tooling/tradecraft. It’s been a good run, and PowerShell has served us well. However, the future is upon us, and it's our job to adapt; we have to go deeper! With that in mind, what if I told you that everything PowerShell does can also be done with Python--without dropping anything to disk and bypassing every protection that Microsoft has put in place for PowerShell? Welcome to the wonderful world of IronPython, where rainbows and unicorns *still* gallivant as if it were 2009!  In this talk, we will be looking at my approach to solving the tradecraft problem of gaining complete, unrestricted, and dynamic access to the .NET runtime without going through PowerShell in any way. I'm going to be walking through the entire process of how I discovered this possibility existed, starting from \"not knowing what I'm doing\" and going to a \"somewhat understanding of what I'm doing\". The talk will cover the progression from creating an initial weaponization PoC all the way up to building an Implant/C2 framework around it and all the success/failures/roadblocks I encountered along the way. Finally, at the end of the talk, I will be releasing the implant/C2 framework which I named SILENTTRINITY to the infosec community.",
      "speakers": [
        30285
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:52+0000"
    },
    {
      "title": "Instant Response: Making IR faster than you thought possible!",
      "end_date": "2018-10-05T21:50+0000",
      "id": 30282,
      "location": 26051,
      "description": "This talk will leverage some of the latest PowerShell research that Mick and Josh have been doing. They will be releasing three different scripts to make your network hostile to the attackers and significantly easier to manage. Additionally, they'll leverage the earlier research from Mick's Derbycon talk last year to pause attackers in their tracks.",
      "speakers": [
        30286,
        30287
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:53+0000"
    },
    {
      "title": "In-Memory Persistence: Terminate & Stay Resident Redux",
      "end_date": "2018-10-05T21:50+0000",
      "id": 30283,
      "location": 26052,
      "description": "Maintaining persistence on a network is important.  With the wider adoption of endpoint via EDR, the approach of persisting via on-disk artifacts is under increasing pressure. This talk outlines how in-memory persistence can be achieved cheaply and effectively, and how using automated & coordinated lateral movement can be combined with in-memory persistence to maintain a network toehold without disk artifacts.",
      "speakers": [
        30288
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:53+0000"
    },
    {
      "title": "Tales From the Bug Mine - Highlights from the Android VRP",
      "end_date": "2018-10-06T13:25+0000",
      "id": 30284,
      "location": 26053,
      "description": "Every month, Google releases the Android Security Bulletin, the latest collection of public vulnerabilities found in Android, along with their patches that must be accepted if a device can be considered up-to-date. Join us for this fast-paced, light-hearted retrospective of some of the most subtle, complicated, or interesting bugs from the last year of the Bulletin. Many of these bugs were submitted through the Android Vulnerability Rewards Program, with cash rewards going to the researchers that discovered them.",
      "speakers": [
        30289
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:56+0000"
    },
    {
      "title": "Decision Analysis Applications in Threat Analysis Frameworks",
      "end_date": "2018-10-06T13:55+0000",
      "id": 30285,
      "location": 26053,
      "description": "In the modern age, all organizations face threats from various types of cyber attacks.  Although great strides have been made to consider human factors in cybersecurity and to become more proactive in threat analysis, security is still generally a reactive, technical field.  This research seeks to develop a framework which adapts existing methods such as the cyber kill chain to look at attacks in a less linear, more human-centered framework that focuses on the capabilities and decisions of the threat actor.  In addition, the framework approaches threat analysis from a binary assessment of success vs. failure in order to see the entire attack and consider the potential for a number of methods and attempts made in a single attack.  A detailed methodology and sample charts are included for a reference and a starting point in developing one’s own personalized charts, and recommendations are made for ways to integrate this methodology into the risk management process.",
      "speakers": [
        30290
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T13:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:57+0000"
    },
    {
      "title": "How Russian Cyber Propaganda Really Works",
      "end_date": "2018-10-06T14:25+0000",
      "id": 30286,
      "location": 26053,
      "description": "How does PSYOP really work? Did the Russians actually influence anyone? Could they do it again? This talk will use NATO counter propaganda methodologies to answer the burning questions about online propaganda, given by the former Chief Counter Propagandist for United States Forces - Iraq.",
      "speakers": [
        30291
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:57+0000"
    },
    {
      "title": "Make Me Your Dark Web Personal Shopper!",
      "end_date": "2018-10-06T14:55+0000",
      "id": 30287,
      "location": 26053,
      "description": "Ever wondered what it would be like to have a personal shopper on the black market? This is your chance. This talk outlines everything you need to know about the goods and services available on the dark web - from human skulls and Sephora points to identity data and payment cards. This talk will provide attendees with a comprehensive overview of the the variety of physical and digital goods available on the dark web, along with a framework to evaluate the the structure and size of dark web marketplaces. Attendees will come away with an understanding of the dark web supply chain, the role the dark web plays in demand for physical and digital goods, and the social structure of dark web marketplaces. This session will also cover the day-to-day realities of transacting on the dark web: sourcing, pricing, scamming, and the lengths buyers will go to shop safely - and anonymously - on these underground marketplaces. This talk is ideal for professionals interested in the trade of data and goods on the dark web, cyber-enabled fraud, or emerging trends in the trade of exploits and vulnerabilities amongst cyber criminals.",
      "speakers": [
        30247
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:57+0000"
    },
    {
      "title": "Driving Away Social Anxiety",
      "end_date": "2018-10-06T16:25+0000",
      "id": 30288,
      "location": 26053,
      "description": "Social anxiety can be a common problem and one that can be detrimental in a field where it may be necessary to interact with people as part of our jobs.This talk looks at how I managed to help deal with my personal anxiety issues by being a ride-sharing driver for nearly a year. Why I feel like this method of social interaction and pseudo-therapy help me, and what lessons I learned if I were to repeat the process in the future. ",
      "speakers": [
        30292
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:00+0000"
    },
    {
      "title": "Off-grid coms and power",
      "end_date": "2018-10-06T16:55+0000",
      "id": 30289,
      "location": 26053,
      "description": "You want ways to stay connected even when not being on the grid. Join me in a rundown of what should be in your bug out bag for emergency communications and off grid power. We will cover ham radio as well as other methods of communications. In addition we will discuss how you can make your own off grid power solution easily acquired scrap.",
      "speakers": [
        30293
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:00+0000"
    },
    {
      "title": "CTFs: Leveling Up Through Competition",
      "end_date": "2018-10-06T17:25+0000",
      "id": 30290,
      "location": 26053,
      "description": "CTFs are fun and informative enough as they are, but if you approach them from a deliberate angle, you can use them to level up your career. This talk aims to break down the pedagogy behind competitive learning and how acquired knowledge can be applied in real life to chase an offensive security job.",
      "speakers": [
        30294
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T18:59+0000"
    },
    {
      "title": "Mapping wifi networks and triggering on interesting traffic patterns",
      "end_date": "2018-10-06T17:55+0000",
      "id": 30291,
      "location": 26053,
      "description": "Sure, WiFi hacking has been around for a while, and everyone knows about tools like airmon-ng, kismet, et al. But what if you just want to view a list of all networks in your area AND see all devices connected to each network? Or maybe you want to know who's hogging all the bandwidth (and maybe deauth them if they use too much)? Or, what if you want to know when a certain someone's cell phone is nearby. Or perhaps you'd like to know if your Airbnb host's IP Camera is uploading video to the cloud? For all these use-cases, I've developed a new tool called \"trackerjacker\". In this talk, we'll use this tool to explore some of the surprisingly-informative data floating around in the radio space, and you'll come away with a new skill point or two in your radio hacking skill tree, as well as a new magical weapon... I mean tool.",
      "speakers": [
        30295
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:01+0000"
    },
    {
      "title": "Extending Burp to Find Struts and XXE Vulnerabilities",
      "end_date": "2018-10-06T18:25+0000",
      "id": 30292,
      "location": 26053,
      "description": "How do you test for Struts vulnerabilities in clients' web apps?  Have you tried writing a Burp plug-in to help?  Extending Burp is easier than you might think.  We'll cover Burp Extension programming in Python, the power of Burp's Collaborator, and adapting Struts and XXE exploits to find vulnerabilities automatically.  This will culminate in the discovery of a web app zero day.",
      "speakers": [
        30296
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:01+0000"
    },
    {
      "title": "Introduction to x86 Assembly",
      "end_date": "2018-10-06T18:55+0000",
      "id": 30293,
      "location": 26053,
      "description": "Windows, Linux, and Mac all run x86 assembly. From your favorite software application down to their system kernels. Ever wondered what happens under the hood when programs execute? What does printf(\"Hello World!\"); actually do? Whether your focused on improving the efficiency of your applications, securing your applications against known exploitation techniques, reverse engineering software or going on the offensive with exploitation development a firm grasp on assembly is essential. Come get an introduction to the world of x86 Assembly, learn how to write, build, debug, and tear apart your first x86 assembly application.",
      "speakers": [
        30297
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T18:25+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:02+0000"
    },
    {
      "title": "Pacu: Attack and Post-Exploitation in AWS",
      "end_date": "2018-10-06T19:25+0000",
      "id": 30294,
      "location": 26053,
      "description": "Cloud infrastructure security and configuration has been shown to be a difficult task to master. Sysadmins and developers with years of traditional IT experience are now being pushed to the cloud, where there is a whole new set of rules. This is what makes AWS environments particularly exciting to attack as a penetration tester. Best practices are often overlooked or ignored, which can leave gaps throughout an AWS environment that are ripe for exploitation. With an increasing number of breaches leaking AWS secret keys, companies are working to be proactive and are looking for red-team-like post exploitation penetration tests, so that they can be sure that their client data is as safe as possible post-breach.Due to this need and the lack of AWS specific attack tools, I wrote Pacu, an open source Amazon Web Services post exploitation attack tool created and used for Rhino Security Labs pentests.In this talk I will cover how red teamers can use Pacu to simulate real-world attack scenarios against AWS environments, starting from IAM enumeration and scanning through exploitation, privilege escalation, data exfiltration and even providing reporting documentation.",
      "speakers": [
        30398
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:04+0000"
    },
    {
      "title": "An Inconvenient Truth: Evading the Ransomware Protection in Windows 10",
      "end_date": "2018-10-06T19:55+0000",
      "id": 30295,
      "location": 26053,
      "description": "The WannaCry cyber-attack all over the world in May, 2017 is still fresh in our minds. The malware encrypted and rendered useless hundreds of thousands of computers in over 150 countries. As a measure against ransomware, Microsoft introduced the function \"Ransomware protection\" in \"Windows 10 Fall Creators Update\". How does this function work? Is it really effective? In this talk, I will explain the operation principles of \"Controlled folder access\" of \"Ransomware protection\" through demonstration video. Then I show the requirements to avoid this function, and describe that this function can be avoided very easily. And I will ask you that we may have to reconsider the definition of vulnerability.",
      "speakers": [
        30299
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T19:25+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:04+0000"
    },
    {
      "title": "Brutal Blogging - Go for the Jugular",
      "end_date": "2018-10-06T20:25+0000",
      "id": 30296,
      "location": 26053,
      "description": "Blogging in InfoSec is a great way to improve your visibility in the community and build personal brand. It's easy to do, but hard to do exceptionally well. I've been editor of a corporate blog for over 4 years and been blogging in InfoSec for 6 years, and I'd like to share what I've learned. Talk will focus on how to search engine optimize (SEO) your blog, how to select topics, using graphics, how to socialize and how to measure the impact of your blogs. I’ll cover the essence of an excellent job and show some examples of great blogs versus good blogs. Basically, don’t be tentative in your blogging. Have deliberate intention (what you want to accomplish) deliver with findings, research and helpful info. Don’t do clickbait! Make it so those humorless Google spiders can find your content.",
      "speakers": [
        30298
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:04+0000"
    },
    {
      "title": "RID Hijacking: Maintaining Access on Windows Machines",
      "end_date": "2018-10-06T20:55+0000",
      "id": 30297,
      "location": 26053,
      "description": "The art of persistence is (and will be...) a matter of concern when successfully exploitation is achieved. Sometimes it is pretty tricky to maintain access on certain environments, especially when it is not possible to execute common vectors like creating or adding users to privileged groups, dumping credentials or hashes, deploying a persistent shell, or anything that could trigger an alert on the victim. This statement ratifies why it's necessary to use discrete and stealthy techniques to keep an open door right after obtaining a high privilege access on the target. What could be more convenient that only use OS resources in order to persist an access? This presentation will provide a new post-exploitation hook applicable to all Windows versions called RID Hijacking, which allows setting desired privileges to an existent account in a stealthy manner by modifying some security attributes. To show its effectiveness, the attack will be demonstrated by using a module which was recently added by Rapid7 to their Metasploit Framework, and developed by the security researcher Sebastián Castro.",
      "speakers": [
        30300
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T20:25+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:05+0000"
    },
    {
      "title": "Your Training Data is Bad and You Should Feel Bad",
      "end_date": "2018-10-06T21:25+0000",
      "id": 30298,
      "location": 26053,
      "description": "Everyone is using Big Data and Machine Learning these days. Not sure how to solve a problem? Train a classifier! But beware the old axiom: Garbage In, Garbage Out. This talk will present three key findings from original research on the effects of training data recency in Twitter classifiers so that your next Twitter bot classifier can start off on the right footing.",
      "speakers": [
        30301
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:05+0000"
    },
    {
      "title": "So many pentesting tools from a $4 Arduino",
      "end_date": "2018-10-06T21:55+0000",
      "id": 30299,
      "location": 26053,
      "description": "Arduinos are cool, but making LEDs blink and monitoring the water in your houseplants can quickly get boring. Have no fear! In this talk we will show you a bunch of penetration testing tools you can build from an inexpensive Arduino Leonardo, Arduino Pro Micro or similar Arduino clone.",
      "speakers": [
        30302,
        30303
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T21:25+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:06+0000"
    },
    {
      "title": "Building an Empire with (Iron)Python",
      "end_date": "2018-10-06T13:50+0000",
      "id": 30300,
      "location": 26049,
      "description": "This talk discusses porting Python payloads to Windows using a little known, former Microsoft project.  It explores offensive uses of .Net and how to reduce attack surface on .Net payloads.",
      "speakers": [
        30304
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:11+0000"
    },
    {
      "title": "Hardware Slashing, Smashing, and Reconstructing for Root access",
      "end_date": "2018-10-06T13:50+0000",
      "id": 30301,
      "location": 26050,
      "description": "This presentation I will be focusing on what is typically referred to as destructive methods for data acquisition from embedded devices. Focusing on the process of removing embedded Multimedia Media Controller (eMMC) devices from circuit boards to gain access to their contents. But we will take it a step further by covering how to restore the device back to operation including methods and technics on altering the devices firmware prior to rebuilding, to allow for full root level access to functional system after recovery. Topics covered will include, Device removal, eMMC firmware extraction and modification methods. Hot air and infrared reflow methods, BGA re-balling manually and with re-ball kit.",
      "speakers": [
        30305
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:11+0000"
    },
    {
      "title": "VBA Stomping - Advanced Malware Techniques",
      "end_date": "2018-10-06T13:50+0000",
      "id": 30302,
      "location": 26051,
      "description": "There are powerful malicious document generation techniques that are effective at bypassing anti-virus detection. A technique which we refer to as VBA stomping refers to destroying the VBA source code in a Microsoft Office document, leaving only a compiled version of the macro code known as p-code in the document file. Maldoc detection based only on the VBA source code fails in this scenario. Reverse engineering these documents presents significant challenges as well. In this talk we will demonstrate detailed examples of VBA stomping as well as introduce some additional techniques. Reverse engineering and defense tips will also be provided. ",
      "speakers": [
        30306,
        30307,
        30308
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:12+0000"
    },
    {
      "title": "Disaster Strikes: A Hacker's Cook book",
      "end_date": "2018-10-06T13:50+0000",
      "id": 30303,
      "location": 26052,
      "description": "Go back in time to September 21, 2017 after Hurricane Maria passed over Puerto Rico and two guys flew from Louisville Kentucky back to a disaster stricken home island. No communications, No Power, almost no technologies worked.  What can a Hacker do?  First, call on the community or as it happened, the community responded without calling. Derbycon, various B Sides, Hackers for Charity and many individuals gave money and time to help out. But, once on ground zero you are basically on your own and you have to hack your way back to civility and survive.",
      "speakers": [
        30400,
        30401
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:22+0000"
    },
    {
      "title": "SAEDY: Subversion and Espionage Directed Against You",
      "end_date": "2018-10-06T14:50+0000",
      "id": 30304,
      "location": 26049,
      "description": "Industrial espionage is the practice of secretly gathering information about competing corporation or business interest, with the objective of placing one’s own organization at a strategic or financial advantage. A common practice to achieve this advantage is to elicit information from unwitting individuals through what today is called social engineering (SE). We all hear the term SE so often that we become desensitized to it, thereby INCREASING the effectiveness of it against ourselves and organizations. Thus, will call it what it is - Human Intelligence, also known as HUMINT.Presenting personal experiences as an Army counterintelligence agent with examples of military and industrial espionage, will examine tradecraft employed against individuals every day. We will apply lessons learned from the US military and the intelligence community by using two acronyms taught to Army counterintelligence agents: SAEDA (Subversion and Espionage Directed Against the Army) and MICE (Money, Ideology, Coercion, Ego). By presenting different aspects of HUMINT collection efforts will enable individuals to possibly detect, deflect, and protect oneself from such actions.",
      "speakers": [
        26366
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:22+0000"
    },
    {
      "title": "App-o-Lockalypse now!",
      "end_date": "2018-10-06T14:50+0000",
      "id": 30305,
      "location": 26050,
      "description": "Want to get a good overview of AppLocker and the different AppLocker bypasses and at the same time learn how defenders can harden their environments to prevent them?  Then this is a talk you don't want to miss. This talk will cover a vast amount of bypass techniques and how to harden AppLocker to make it even harder to bypass. Giving you help to either start or avoid an App-o-Lockalypse.",
      "speakers": [
        30263
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:23+0000"
    },
    {
      "title": "Media hacks: an Infosec guide to dealing with journalists",
      "end_date": "2018-10-06T14:50+0000",
      "id": 30306,
      "location": 26051,
      "description": "Infosec researchers, experts, and hackers in general have a…fraught relationship with media, ranging from exploitive to adversarial. Recent episodes, including the doxxing of Marcus Hutchins by UK media and sensational coverage of his arrest, don't help, nor do broadcast media reports that are often factually incorrect or even damaging to the security of those who take the reports as gospel. And researchers looking to get out word to the general public are often (based on anecdotal data) confused or intimidated by the media machine. This presentation seeks to demystify how news media work,  the strengths and weaknesses of each channel of communications, and how to effectively interact with journalists in a way that is constructive and productive.  We are infosec journalists—ask us anything.",
      "speakers": [
        30403,
        30404,
        30405
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:26+0000"
    },
    {
      "title": "Ninja Looting Like a Pirate",
      "end_date": "2018-10-06T14:50+0000",
      "id": 30307,
      "location": 26052,
      "description": "There is a vast amount of information that exist in the modern world.  More so than has ever existed in any society at any time in the history of mankind.  Companies, individual, organizations, and nations keep adding to this massive sea of data.  Wouldn’t you like to get your hands on some of it?  This presentation will show you how to do just that very thing with no tools. Simply using the right browser, search commands and Boolean logic.  You will learn how to navigate and surf this ocean of information and find repositories that others a have placed online. Repositories a.k.a. loot which they believe to be safe from others but, in fact they are not.  You will learn a few simple techniques that allow you to find their loot and take it for yourself or others.  The techniques to accomplish this are not new, in fact they are very old by Information Technology time.  However they are as relevant today as they were more than thirteen years ago when people first started to compile them.  The techniques will enable you to sift through the haystack of information that you normally get when web searching to find the specific needles that you seek.  These techniques will optimize your search time and provide a greater focus of the desired target than you have ever had before.  All accomplished from a \"search engine\" you use every day.  ",
      "speakers": [
        30406
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:27+0000"
    },
    {
      "title": "OSX/Pirrit - Reverse engineering mac OSX malware and the legal department of the company who makes it",
      "end_date": "2018-10-06T16:50+0000",
      "id": 30308,
      "location": 26049,
      "description": "Back in 2016 I discovered a new OSX strain of the Pirrit adware/malware which up until then only targeted windows machines. I completely reverse engineered the malware, which runs with root privileges, hijacks all the HTTP traffic on the infected machine, and employs several other nefarious tricks. Due to some stunning opsec mistakes (which I will cover) I found the malware’s authors downright to their full names and the company that they work for. Fast forward almost two years later, OSX/Pirrit was back with a vengeance, employing new techniques and learning their lessons from everything I wrote about in my previous reports. Nevertheless, after lots of binary reverse engineering, going through thousands of lines of JavaScript, bash, and AppleScript code - I managed to reveal just how sinister the new version of OSX/pirrit is which is virtually impossible to remove without deep OSX knowledge. Due to more opsec mistakes by the authors I managed to tie this new wave of infections back to On top of that, TargetingEdge, the company who makes this adware/malware, bombarded us with cease and desist letters, threatening my employer and myself personally - trying to keep us from publishing our report. In my talk I will highlight all of the methods that were used by the authors of the malware to abuse systems, I will guide the attendees through the process of reverse engineering such malware and share with everyone the amazing and hilarious story behind this whole incident. There will be IDA screenshots, there will be stunning opsec mistakes by the authors and there will lolz galore.Join me for a session about reverse engineering, browser hooking tricks on OSX and interesting tales about my time with our corporate attorney battling these legal threats. This talk is meant for beginners and experienced audiences alike as I intend to walk through all the phases of my research. Attendees will walk out this talk knowing a lot about the security and the process of malware analysis on macs along with how to handle situations where the malware authors are sending their attorneys on you.",
      "speakers": [
        30407,
        30408,
        30409
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:27+0000"
    },
    {
      "title": "Web App 101: Getting the lay of the land",
      "end_date": "2018-10-06T16:50+0000",
      "id": 30309,
      "location": 26050,
      "description": "Getting started with web apps can be a daunting task.  \"Ooh, shiny!\" rabbit holes are just around the corner with every click.  Without a good plan and a road map, it can be very easy to get lost in these holes and run out of time before reaching your goal.  This talk covers how to identify the goal and set up a plan that will help you avoid the rabbit holes, identify the points you should focus on, and ultimately help you become an effective application tester.",
      "speakers": [
        30310
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:28+0000"
    },
    {
      "title": "Deploying Deceptive Systems: Luring Attackers from the Shadows",
      "end_date": "2018-10-06T16:50+0000",
      "id": 30310,
      "location": 26051,
      "description": "\"Assume the network is compromised\" has been a popular mantra in information security for years now. So how do defenders operate in such an environment? Honeypots and honeytokens that are well-planned and strategically-placed can enhance any organization's threat detection capability. This talk will demonstrate a few of the various free, open-source solutions available as well as a strategic plan for deploying them.",
      "speakers": [
        30309
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:28+0000"
    },
    {
      "title": "Hacking Mobile Applications with Frida",
      "end_date": "2018-10-06T16:50+0000",
      "id": 30311,
      "location": 26052,
      "description": "Scientists have estimated by the year 2033 the entire solar system will be made up of mobile apps. Be prepared by mastering Frida, the mobile instrumentation (cough hacking) toolkit. Testing beyond traffic analysis can be extremely useful for any form of mobile pentest or bug bounty. In this talk we are going to cover getting up and running with Frida for hacking mobile applications. We will look at several of the built-in Frida tools, as well as some very helpful projects that utilize Frida. This will include being able to examine the live, running functionality of both iOS and Android apps to learn how they work, and hopefully how to alter they way they work. You will walk away with a new methodology for attacking mobile apps, and a lifelong friendship.",
      "speakers": [
        30311
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:29+0000"
    },
    {
      "title": "How to test Network Investigative Techniques(NITs) used by the FBI",
      "end_date": "2018-10-06T17:50+0000",
      "id": 30312,
      "location": 26049,
      "description": "Network Investigative Techniques are used to investigate cyber criminal activities. These techniques have been used to unmask users of TOR whom are downloading illegal content from the Tor network. This talk will discuss such techniques, discuss ethical and legal issues and describe a methodology to test and verify such techniques.",
      "speakers": [
        30312
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:29+0000"
    },
    {
      "title": "Invoke-DOSfuscation: Techniques FOR %F IN (-style) DO (S-level CMD Obfuscation)",
      "end_date": "2018-10-06T17:50+0000",
      "id": 30313,
      "location": 26050,
      "description": "Skilled attackers continually seek out new attack vectors and effective ways of obfuscating old techniques to evade detection. Active defenders can attest to attackers’ prolific obfuscation of JavaScript, VBScript and PowerShell payloads given the ample availability of obfuscation frameworks and their effectiveness at evading many of today’s defenses. However, advanced defenders are increasingly detecting this obfuscation with help from the data science community. This approach paired with deeper visibility into memory-resident payloads via interfaces like Microsoft’s Antimalware Scan Interface (AMSI) is causing some Red Teamers to shift tradecraft to languages that offer defenders less visibility. But what are attackers using in the wild? In the past year numerous APT and FIN (Financial) threat actors have increasingly introduced obfuscation techniques into their usage of native Windows binaries like wscript.exe, regsvr32.exe and cmd.exe. Some simple approaches entail randomly adding cmd.exe’s caret (^) escape character to command arguments. More interesting techniques like those employed by APT32, FIN7 and FIN8 involve quotes, parentheses and standard input.The most interesting obfuscation technique observed in the wild was FIN7’s use of cmd.exe’s string replacement functionality identified in June 2017. This discovery single-handedly initiated my research into cmd.exe’s surprisingly effective but vastly unexplored obfuscation capabilities. In this presentation I will dive deep into cmd.exe’s multi-faceted obfuscation opportunities beginning with carets, quotes and stdin argument hiding. Next I will extrapolate more complex techniques including FIN7’s string removal/replacement concept and two never-before-seen obfuscation and full encoding techniques – all performed entirely in memory by cmd.exe. Finally, I will outline three approaches for obfuscating binary names from static and dynamic analysis while highlighting lesser-known cmd.exe replacement binaries. I will conclude this talk by giving a live demo of my cmd.exe obfuscation framework called Invoke-DOSfuscation that obfuscates payloads using these multi-layered techniques. I will also share detection implications and approaches for this genre of obfuscation.",
      "speakers": [
        30313
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:30+0000"
    },
    {
      "title": "The Money-Laundering Cannon: Real cash; Real Criminals; and Real Layoffs",
      "end_date": "2018-10-06T17:50+0000",
      "id": 30314,
      "location": 26051,
      "description": "After 15 years of building security products, I decided to join the front lines of the fight by taking a real-world job running product management & engineering, for a team that was building a new cash/debit[credit-rails] payments platform. My first day on the job we discovered we were being attacked by an organized crime ring. For roughly every $150k stolen - it meant we had to lay someone off - further reducing our ability to be effective. Tense moments. We also had no Infosec/Cybersecurity staff, nor any type of Infosec or Anti-Fraud software/systems.  We only had a Windows-based “Compliance System” that looked like it was written in the late 90s. In spite of that we managed to cut our losses to zero dollars for almost six months! The next 13 months were a bloody battle that ended with me losing my job. If you like real world cybersecurity; want to learn how we built an anti-fraud system from scratch; or simply like schadenfreude - join me for a laugh and a few super-obvious lessons in statistics. :)",
      "speakers": [
        30314
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:30+0000"
    },
    {
      "title": "Victor or Victim? Strategies for Avoiding an InfoSec Cold War",
      "end_date": "2018-10-06T17:50+0000",
      "id": 30315,
      "location": 26052,
      "description": "Is your internal red team withholding their TTPs from the defense? Defenders, are you constantly trying to “win” your pentests by fixing vulns on the fly? Have you been on engagements where the blue team starts blocking your ips and targeting you just to prove that they are better, or had pentesters that mock your environment on twitter like you are the butt of an InfoSec joke. These approaches are not working, not only from a personal level but from an industry level. How we choose to work with each other needs to grow if our goal is to protect those around us rather than make a name for ourselves. Come hear stories of offensive engagements done right (and really really wrong), and learn from a seasoned defender and attacker how partnerships should be forged to be most impactful. Victims complain, Victors adapt. Which are you?",
      "speakers": [
        30315,
        30316
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:30+0000"
    },
    {
      "title": "Cloud Computing Therapy Session",
      "end_date": "2018-10-06T18:50+0000",
      "id": 30316,
      "location": 26049,
      "description": "You don't have to hate your motherboard, or want a magic wand to solve all your computering problems because everyone is medicating with the cloud these days, but not every cloud platform is created equal. Much like security conference attendees each cloud has its own special sauce, and “idiosyncrasies”. Azure has a shadow twin no one likes to discuss, GCP hands out public IPs like it’s 1983 again, and AWS is praised as the golden child because they did their homework. While ranting about these quirks Cara and Andy plan on presenting some of the solutions that they have written to deal with a few of the more annoying issues that can rear their ugly heads when deploying in the cloud.",
      "speakers": [
        30317,
        30318
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:31+0000"
    },
    {
      "title": "WE ARE THE ARTILLERY: Using Google Fu To Take Down The Grids",
      "end_date": "2018-10-06T18:50+0000",
      "id": 30317,
      "location": 26050,
      "description": "In this presentation we will show how effective a team of individuals can be in using open source intelligence gathering techniques in gathering leaked data on the electrical grid. By using Google dorking alone, the team has been able to not only gather insider information on grid technologies but also their deployment in the US including and up to passwords to systems and blueprints and runbooks. Using such information an attacker could not only attempt to gain access to power company and grid networks but also easily be able to connect the dots and perform hybrid (physical and electronic) attacks on the US power grid systems.",
      "speakers": [
        30319,
        30320,
        30411
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:33+0000"
    },
    {
      "title": "Perfect Storm: Taking the Helm of Kubernetes",
      "end_date": "2018-10-06T18:50+0000",
      "id": 30318,
      "location": 26051,
      "description": "Containers don't always contain. For attackers, Kubernetes contains a number of interesting attack surfaces and opportunities for exploitation. For defenders and operators, it's complicated to set up and the defaults often aren't enough. This can create a perfect storm. This talk will walk you through attacking Kubernetes clusters, and give defenders tools and techniques to protect themselves from shipwrecks.",
      "speakers": [
        30321
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:33+0000"
    },
    {
      "title": "Ubiquitous Shells",
      "end_date": "2018-10-06T18:50+0000",
      "id": 30319,
      "location": 26052,
      "description": "Ubiquiti network gear has become a favorite among tech enthusiasts. Unfortunately, various Ubiquiti products have had some serious vulnerabilities in recent history, and like most products, there are deployment decisions that can dramatically reduce the security of the network. There are even features that can provide shell access to the network from the internet. Listen in as we discuss how to go from zero access from the Internet to a root shell via Ubiquiti gear.  We'll also explore methods to weaponize the Unifi APs and Unifi Cloud Key devices to for use as attack platforms.",
      "speakers": [
        30322
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:34+0000"
    },
    {
      "title": "Silent Compromise: Social Engineering Fortune 500 Businesses",
      "end_date": "2018-10-06T19:50+0000",
      "id": 30320,
      "location": 26049,
      "description": "Social Engineering and Open Source Intelligence (OSINT) are silent modes of compromising businesses. This presentation takes experience from the field and from a simulated compromise of a Fortune 500 from a Social Engineering Capture the Flag and applies it to help organizations better understand the threat landscape and arms them with actionable advice to employ internally to minimize the impact of such attacks. We also identify places to find data, which provides insight for more valuable data sources. This includes a demo of OSINT techniques, phishing, and a pretexting discussion. This aims to help penetration testers, social engineers, and other interested (and authorized) parties find ways to gain information about an organization and its people to be able to overcome the technical limitations of the perimeter and gain access to allow further exploitation.",
      "speakers": [
        30323
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:34+0000"
    },
    {
      "title": "Just Let Yourself In",
      "end_date": "2018-10-06T19:50+0000",
      "id": 30321,
      "location": 26050,
      "description": "Everyone loves the ‘shiny blinky security hardware’. However, they don’t work as well if a user or your physical security is compromised. In this talk, I will be discussing three (3) different Security Awareness/Social Engineering scenarios: a pretexting exercise, a phishing exercise, and a physical security assessment. I will go over what they are, what they look like, some tips and tricks that I have found for all three (3) that have worked great (at least for me), as well as what failed miserably. There will be some amusing stories from the field, some tips for new folks getting started with social engineering, as well as defense tips for the sys admins and blue teamers out there. ",
      "speakers": [
        30324
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:34+0000"
    },
    {
      "title": "How to put on a Con for Fun and (Non) Profit",
      "end_date": "2018-10-06T19:50+0000",
      "id": 30322,
      "location": 26051,
      "description": "Planning and running an InfoSec conference can be the most fun and rewarding time that you can have herding cats. The 304 Geeks have been mostly successfully running Hack3rcon for the last 9 years.  In this talk we will share our perspective on how to build your organization and get started running your very own conference.",
      "speakers": [
        30325,
        30326,
        30327,
        30328,
        30329,
        30330,
        30331,
        30332
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:35+0000"
    },
    {
      "title": "99 Reasons Your Perimeter Is Leaking - Evolution of C&C",
      "end_date": "2018-10-06T19:50+0000",
      "id": 30323,
      "location": 26052,
      "description": "From the venerable bind shell, to the reverse shell, the IRC bot channel, the icmp/dns/custom UDP tunnel, and the asynchronous HTTP C&C server, remote access has taken many forms since we first began remotely exploiting software. Even today, many traditional methods will still frequently bypass firewalls and detection, and additional methods continue to be devised. But as an attacker, what do I do when my favorite method is blocked? What are my options other than reusing a stale python script from github or creating my own ad-hoc, informally-specified, bug-ridden, slow implementation of a high-level messaging protocol? And as a defender, how can I measure my ability to detect the diverse C&C traffic that may be seen today, and also prepare for new and unexpected channels? In this talk, we will discuss the evolution of command and control methods, their strengths and weaknesses from an attacker's perspective, and the capabilities of a defender to detect and respond to them. We will identify what aspects a forward-thinking C&C framework might require, and then demonstrate a proof-of-concept with 99(ish) different interchangeable methods for communication. Finally, we will discuss some of the shortcomings of egress filtering in enterprise environments that should be addressed in order to mature our detection and response in kind.",
      "speakers": [
        30333
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T19:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:35+0000"
    },
    {
      "title": "Dexter: the friendly forensics expert on the Coinbase security team",
      "end_date": "2018-10-06T20:50+0000",
      "id": 30324,
      "location": 26049,
      "description": "Sometimes you want to be able to pull forensic images off your production hosts but you want to make sure you set that up correctly because if you don’t people might steal customer financial data or cryptocurrency private keys for hot wallets or something and that would be a very bad day for you and for the cryptocurrency community.  This talk introduces Dexter, a forensics tool for high security environments.  Dexter makes sure that no single person can do scary forensics things, and that the scary results of the scary forensics things can only be read by people who aren’t scary.  I’ll give an overview of the Coinbase production environment, data pipeline, and detection tooling to set the stage for when we might use Dexter.  Then we’ll walk through how Dexter works and do a demo that will totally work and not have any technical issues whatsoever.",
      "speakers": [
        30334
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:36+0000"
    },
    {
      "title": "A “Crash” Course in Exploiting Buffer Overflows (Live Demos!)",
      "end_date": "2018-10-06T20:50+0000",
      "id": 30325,
      "location": 26050,
      "description": "Buffer overflows, a condition where attacker-controlled input overwrites program data, are consistently being used in large-scale attacks, including Stuxnet in 2011 and WannaCry in 2017.  In this interactive presentation we will demonstrate how to test for and craft buffer overflows, even without an application's source code.  Then we will alternately introduce more exploit mitigations, including ASLR, NX, and Stack Canaries, and demonstrate how to bypass each one of them -- all with live demos!  Materials at github.com/parkergarrison/overflow",
      "speakers": [
        30335
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:36+0000"
    },
    {
      "title": "Web app testing classroom in a box - the good, the bad and the ugly",
      "end_date": "2018-10-06T20:50+0000",
      "id": 30326,
      "location": 26051,
      "description": "Web based applications and services are the key technologies behind modern service delivery. And their security, or lack thereof, can make or break a company. We developed an approach to follow including tools to help with the assessment throughout each step of the process, leveraging free and commercial products that can assist the assessment process. There are more engagements than there are resources, so we set out on a mission to train new web application testers on a portable platform to teach them an approach to not only test application security but also leverage tools that simplify the process, in effect cheating to win. To conduct that training, we had to develop a classroom-in-a-box, which included the network, the targets and tools for the students. Over the last year, we have leveraged Raspberry Pi Zeros, Thumb Drives with Kali Linux, Chromebooks and Intel NUC servers. We will discuss the pros and cons, showing what works and what to avoid, as well as what can be leveraged to build a home lab, or your own classroom in a box. The user will leave with information they can take back to their home organization to serve as a foundation for either an ad-hoc or ongoing capability.",
      "speakers": [
        30336,
        30337,
        30338
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:36+0000"
    },
    {
      "title": "Ship Hacking: a Primer for Today’s Pirate",
      "end_date": "2018-10-06T20:50+0000",
      "id": 30327,
      "location": 26052,
      "description": "In 1995,  when the fictitious Dade Murphy and his friends stopped oil tankers from being capsized by a virus in the movie “Hackers”, “digital piracy” was just a euphemism for copyright infringement and sharing music.  Today digital piracy is anything but a euphemism or fiction.  From breaches by pirates seeking cargo information, to denial of service (DOS) attacks on offshore oil platforms, there are very real threats to the maritime sector.  This talk will provide an introduction to understanding ships as Industrial Control Systems (ICS) and lessons learned from vulnerability research on marine diesel engine controllers.  We also hope to challenge our peers in the infosec community to apply their skills, red and blue, to protect our maritime critical infrastructure.  A talk for anyone who likes computers and pirates.  Arrgh!",
      "speakers": [
        30339,
        30340
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T20:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:37+0000"
    },
    {
      "title": "Going on a Printer Safari – Hunting Zebra Printers",
      "end_date": "2018-10-06T21:50+0000",
      "id": 30328,
      "location": 26049,
      "description": "If you see a label or receipt there is a good chance it was printed by a Zebra printer. Everyone has come in contact with a Zebra printer if you have ever returned a rental car.  Every price label you see in your local grocery or department store is printed by a Zebra printer.  Warehouses, distribution centers, and even hospitals rely on the ability to print bar-coded labels for tracking purposes. These embedded devices pack a powerful real-time operating system offering an array of services that facilitate communication with the corporate environment.  By default these services offer an attack surface into the corporate environment that is alarming.  Take a trip on a safari as we go hunting Zebra printers in the wild.",
      "speakers": [
        30341
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:37+0000"
    },
    {
      "title": "Living in a Secure Container, Down by the River",
      "end_date": "2018-10-06T21:50+0000",
      "id": 30329,
      "location": 26050,
      "description": "Linux container technologies offer the ability to run software in isolation with a significantly reduced attack surface. By reducing the capabilities and resources a container can utilize, we make it increasingly difficult to elevate privileges, gain persistence or move laterally within a cluster of containerized services. While Docker is the container technology most people are familiar with, there are other container types to think about too, each with their own opinionated take on security. It’s getting increasingly common to adopt other runtimes through the Open Container Initiative (OCI) specification using interfaces and shims provided by container orchestration platforms. Containers that use Linux namespaces and control groups for isolation typically provide weaker protections against escaping than hypervisor-based containers, further detaching security reality from your hopes and dreams. This presentation will focus on the security and kernel protections available in several popular Linux container technologies including Docker, Rkt, LXC, Kata and gVisor. We will explore how the default runtime security controls stack up under attack and how they attempt to isolate resources at security boundaries. We will explore the container hardening process through AppArmor, SELinux, Seccomp and Capabilities. At the end of this presentation, you’ll be motivated to run minimally privileged containers that are isolated from doing any real damage. You’ll have plenty of time for security when your code is living in a container down by the river.",
      "speakers": [
        30342
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:38+0000"
    },
    {
      "title": "Metasploit Town Hall 0x4",
      "end_date": "2018-10-06T21:50+0000",
      "id": 30330,
      "location": 26051,
      "description": "In our fourth Metasploit Town Hall, join us for a look at the hotness that landed in Metasploit 5 this past year—including Python-based modules, new exploits, and fresh EternalBlue additions. We’ll demo some of the latest and greatest work coming out of our team and our top-notch contributor base, and then we’ll offer ourselves up to the crowd for questions and conversation about what you’d like to see Metasploit take on next.",
      "speakers": [
        30343,
        30344,
        30345,
        30346
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:38+0000"
    },
    {
      "title": "Code Execution with JDK Scripting Tools & Nashorn Javascript Engine",
      "end_date": "2018-10-06T21:50+0000",
      "id": 30331,
      "location": 26052,
      "description": "There are several languages and methods used to execute code on a computer system, such as C#, Powershell, Python, VBA, and many more. The defense is getting better, which has caused the offense to adapt and look for innovative ways to “live off the land”. One area that has not been explored deeply is utilizing tools that the Java Development Kit (JDK) provides. According to a statement by Oracle, Java runs on 3 billion devices. Enterprises depend on Java running on their user endpoints and servers in order to keep their businesses running. This makes using tools installed with the JDK very enticing to attackers. This talk will explore using JDK command-line scripting tools and the Nashorn Javascript Engine to perform several actions, such as downloading files, executing scripts locally and remotely, and gaining a remote interactive shell to a computer system. Detective and preventive controls will also be discussed for the usage of these JDK scripting tools.",
      "speakers": [
        30347
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T21:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:38+0000"
    },
    {
      "title": "Community Based Career Development or How to Get More than a T-Shirt When Participating as part of the Community ",
      "end_date": "2018-10-06T22:50+0000",
      "id": 30332,
      "location": 26051,
      "description": "Career development is typically seen as a progression of education, certification and job moves. However, to progress in our careers it is helpful to build both technical and non-technical skills in different environments to challenge us and give us the opportunity to learn. Community involvement strengthens not only the overall community but provides opportunities to stretch and learn new skills that support personal growth. We will review presenting, con management and competitions as ways to strengthen your career. We will hear from a recruiter involved in the community how they evaluate these experiences and recommendations on presenting this information in your job search. Finally, we will address burnout, exhaustion and how not to burn bridges.",
      "speakers": [
        30348,
        30349,
        30350,
        30351,
        30352
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T22:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:39+0000"
    },
    {
      "title": "PHONOPTICON - leveraging low-rent mobile ad services to achieve state-actor level mass surveillance on a shoestring budget",
      "end_date": "2018-10-06T22:50+0000",
      "id": 30333,
      "location": 26052,
      "description": "By now we all know that mobile advertisements aren't secure. How would an attacker take advantage of that, though, and spy on people without their consent, knowledge or interaction, and how do we defend against it? Let's take a journey through the demand-side of advertising as we put ourselves in the role of an attacker, build an ad-based surveillance system, and unleash it on the masses. I'll demonstrate how, using the built-in features of advertising Demand Side Platforms (DSPs), it's easy to build a surveillance system that can track unsuspecting people. I'll demonstrate that some platforms make it much easier than it needs to be, and I'll show that there's more than just geo-locations at risk here. Finally I will discuss some ways that everyone can help mitigate this, from the users, all the way up to the ad networks and software developers. Like every good spy story, this one includes Russian ad networks, hastily written code, and GPS coordinates - lots of GPS coordinates. By now if you're still clinging desperately to the hope that your location is safe then this talk is for you!",
      "speakers": [
        30353
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T22:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T19:39+0000"
    },
    {
      "title": "Patching: Show me where it hurts",
      "end_date": "2018-10-07T13:25+0000",
      "id": 30334,
      "location": 26053,
      "description": "Patching – it’s complicated. Organizations at every level struggle with patching. It feels more like a necessary evil rather than a best practice. We're damned if we do, damned if we don't. As much as we like to point fingers of blame and malign the processes in place, the fact is that one size does not fit all when security updates get issued. We’ve lived through the joy of Patch Tuesdays gone bad, watched systems meltdown from patches for Spectre and Meltdown. Given all we should have learned, why does it seem like things are getting worse? Securing our stuff should not be an endless succession of dumpster fires. We need to go beyond just finding the sweet spot between mitigating business risk with vulnerability exposure.  Join me in a candid and interactive discussion on this fundamental process that seems inherently broken, especially as it now affects IoT, OT and medical devices. In an off the record, behind closed doors session, let's share what we’ve seen and say what we really think about management, internal and external customers, vendors.  Because the cure isn't supposed to be worse than the disease.",
      "speakers": [
        30284
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-01T20:18+0000"
    },
    {
      "title": "Advanced Deception Technology Through Behavioral Biometrics ",
      "end_date": "2018-10-07T13:55+0000",
      "id": 30335,
      "location": 26053,
      "description": "In cybersecurity, the attacker tends to have a significant advantage over the defender. A motivated network defender should look for opportunities to have an asymmetric advantage over the attacker to level the playing field. In this talk, we will apply the concept of Behavioral Biometrics in the realm of deception technologies to obtain such an advantage. There are three common factors used in authentication: something you know (a password), something you have (a token), and something you are (a biometric). Each factor has its own unique strengths and weaknesses. In the case of biometrics, biometric data is, in many cases, easy to steal and spoof. Once biometric data is stolen, it is impossible to change, since it is inherently tied to the user. Behavioral Biometrics is the authentication paradigm of using an individual’s behavior as a biometric, rather than a fingerprint. The technology looks at how how a user interacts with a system, such as how they type or move the mouse, touch the screen, which hand they hold the device in, the characteristics of their gait from the motion sensor, as well as spatial and temporal patterns. The result is a biometric that is not immediately visible to an attacker, and incredibly difficult to spoof. Traditionally, should behavioral components detect an intrusion, access is blocked, authentication escalated, or the user was de-authed completely. However, this does not necessarily have to be the case. Deception technology has emerged as a method to either delay attackers, coax out their TTPs (Tactics, Techniques, and Procedures), or gather clues about their true identities. This strategy typically includes things such as canaries, honeypots, or tainted or tracked data. The challenge with deception technology is often in identifying an attacker in the first place in order to divert them to fake resources. We will demonstrate in this talk that Behavioral Biometrics are uniquely positioned to identify an attacker as unauthorized, independent of credentials, in a way that is invisible and spoof resistant.  With that information, deceptive technology can redirect their attack in order to delay it, discover the attackers TTPs, or even learn the identity of the attacker as they attempt to exfiltrate mocked data, transfer funds, or use services. We will conclude by demonstrating this combination live.",
      "speakers": [
        30354,
        30355
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T13:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:23+0000"
    },
    {
      "title": "We are all on the spectrum: What my 10-year-old taught me about leading teams ",
      "end_date": "2018-10-07T14:25+0000",
      "id": 30336,
      "location": 26053,
      "description": "Being a parent of an autistic child has taught me how to communicate with my team in a way that no book on leadership has. We all fall somewhere on the spectrum and communicating with one another is key to building effective teams. ",
      "speakers": [
        30356
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:23+0000"
    },
    {
      "title": "No Place Like Home: Real Estate OSINT and OPSec Fails",
      "end_date": "2018-10-07T14:55+0000",
      "id": 30337,
      "location": 26053,
      "description": "Join me in discovering the large amount of OSINT data that can be obtained through the many areas of Real Estate. Along the way we will cover areas of OPSec failures in the market and things to do to prevent it. ",
      "speakers": [
        30357
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:23+0000"
    },
    {
      "title": "The Layer2 Nightmare",
      "end_date": "2018-10-07T15:25+0000",
      "id": 30338,
      "location": 26053,
      "description": "It all started with a very simple question. Is it possible to firewall all internal traffic to help prevent or detect lateral movement?",
      "speakers": [
        30358
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T15:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:24+0000"
    },
    {
      "title": "Attacking Azure Environments with PowerShell",
      "end_date": "2018-10-07T15:55+0000",
      "id": 30339,
      "location": 26053,
      "description": "For a multitude of reasons, many organizations are moving their operations to the cloud. Along with this, many organizations are introducing old vulnerabilities in new ways. As one of the top cloud providers, Microsoft Azure has had significant adoption and continues to grow in market share. As part of this increase in adoption, there has also been an increase in demand for security testing of Azure environments. Given the blended nature of hosted services, PAAS, and virtual infrastructure, it can be difficult to get a handle on how to properly secure these environments. Reviewing Azure environments can also be time consuming given the lack of automated tools for dumping configuration information. MicroBurst is a PowerShell tool that helps automate the processes of dumping and reviewing Microsoft Azure configurations. This talk will go over the ways that pen testers and defenders can use MicroBurst to dump out the configuration information for an Azure environment, and identify common configuration issues. Security testers will benefit from the speed of dumping environment credentials for pivoting, listing out publicly available services and files, and enumerating additional targets for phishing and password guessing attacks. As an added bonus, defenders can also use these tools to audit their environment for weak spots.",
      "speakers": [
        30359
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T15:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:24+0000"
    },
    {
      "title": "Blue Blood Injection: Transitioning Red to Purple",
      "end_date": "2018-10-07T16:25+0000",
      "id": 30340,
      "location": 26053,
      "description": "Moving from a large company with a retinue of pentesters, to a start-up with far fewer resources, can be a strain. It may be just you. While you're performing services, your new company may also need you to be flexible -- move to supporting some IR or blue team-related functionality. You won't be able to do both sides of a purple team, but you can help things meet for your clients. This talk will have my story, as well as some ideas when having to reach across a spectrum of needs with limited (or no) defense-focused personnel.",
      "speakers": [
        30360
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:25+0000"
    },
    {
      "title": "Mirai, Satori, OMG, and Owari - IoT Botnets Oh My",
      "end_date": "2018-10-07T16:55+0000",
      "id": 30341,
      "location": 26053,
      "description": "Mirai, seen as revolutionary for malware that targets the Internet of Things (IoT), has wrought destruction around the globe and popularized IoT based malware. Mirai was utilized by attackers to launch multiple high-profile, high-impact DDoS attacks against various Internet properties and services in 2016. Since the release of Mirai’s source code, IoT botnet authors have used it as a framework to build new malware. Authors have expanded the original Mirai code base with new capabilities and functionality while making some improvements. This talk will cover three of the most recent variants of Mirai based botnets and the flair added by the authors to make it their own.",
      "speakers": [
        30361
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T16:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:25+0000"
    },
    {
      "title": "Comparing apples to Apple",
      "end_date": "2018-10-07T17:25+0000",
      "id": 30342,
      "location": 26053,
      "description": "Many defenders have hard fought experience finding evil on Windows systems, but stare blankly when handed a Mac. You know all the ways PowerShell can own a box, but how about AppleScript? This practical talk will give defenders a primer in finding adversarial activity on macOS using the TTPs they know and love from other platforms as a reference point. ",
      "speakers": [
        30362
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:25+0000"
    },
    {
      "title": "How online dating made me better at threat modeling",
      "end_date": "2018-10-07T17:55+0000",
      "id": 30343,
      "location": 26053,
      "description": "Isaiah Sarju uses online dating sites such as Tinder and OkCupid. At times this seems antithetical to his stance on privacy and security. To better understand the security ramifications of online dating, and to establish safer methods of doing it, he applied threat modeling to online dating. Through this he came up with a set of best practices depending on your threat model. This talk is relevant for anyone who is trying to balance privacy/security and a desire for human connection in this modern world. Due to the real and perceived dangers of online dating, the stigma that surrounds it, and the pervasiveness of it, it is a great lens through which folks can be introduced to the core principles of threat modeling. It also makes it fun to talk about!",
      "speakers": [
        30363
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T17:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:26+0000"
    },
    {
      "title": "Social Engineering At Work – How to use positive influence to gain management buy-in for anything",
      "end_date": "2018-10-07T13:50+0000",
      "id": 30344,
      "location": 26049,
      "description": "Do you understand how to navigate office politics and regularly get what you want and need to make your security efforts take off and be successful?  Are there projects or programs you want to institute, but have trouble getting started or knowing how to get people on-board?  Most of us understand how SE can be used to test for human vulnerabilities, but socializing at work may give us a yucky feeling.  However, if you really want to learn how to get buy-in for your ideas or projects and get what you want, you need to be able to navigate the social system at work and exert indirect influence.  It is possible to study and reverse the “dark arts” of SE to actually achieve positive goals; SE principles are used every day by savvy business people to make things happen, even if they don’t realize that they’re using them.  Let’s define ways even the most introverted person can play the corporate game in a non-malicious non-manipulative way.  Then, we can use this knowledge within our organizations to improve our security posture, “sell” security to stakeholders, and lessen risk.  Learn how to utilize the tools of SE “for good” so that we can better serve our infrastructures and customers.",
      "speakers": [
        26051
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:26+0000"
    },
    {
      "title": "Red Mirror: Bringing Telemetry to Red Teaming",
      "end_date": "2018-10-07T13:50+0000",
      "id": 30345,
      "location": 26050,
      "description": "Providing impact and insights on a red team engagement is crucial to improving the security posture of the target organization. Too often red teams have to comb through log files, pcaps or other disjointed artifacts to tell the whole story making it difficult especially on long-term engagements. The Red Mirror project is the mirror to the blue team’s SIEM; it’s an ELK-based system that captures operator actions, network traffic including C2 and MITRE ATT&CK tactics. By capturing this extensive amount of data, red teams can now easily query, visualize, and report on their actions. The gathered data has the added benefit of enabling red teams to perform infrastructure and operational security monitoring.",
      "speakers": [
        30365
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:27+0000"
    },
    {
      "title": "Goodbye Obfuscation, Hello Invisi-Shell: Hiding Your Powershell Script in Plain Sight",
      "end_date": "2018-10-07T13:50+0000",
      "id": 30346,
      "location": 26051,
      "description": "“The very concept of objective truth is fading out of the world. Lies will pass into history.” George Orwell. Objective truth is essential for security. Logs, notifications and saved data must reflect the actual events for security tools, forensic teams and IT managers to perform their job correctly. Powershell is a prime example of the constant cat and mouse game hackers and security personnel play every day to either reveal or hide the “objective truth” of a running script. Powershell’s auto logging, obfuscation techniques, AMSI and more are all participants of the same game playing by the same rules. We don’t like rules, so we broke them. As a result, Babel-Shellfish and Invisi-Shell—two new tools that both expose and disguise powershell scripts—were born. Babel-Shellfish reveals the inner hidden code of any obfuscated script while Invisi-Shell offers a new method of hiding malicious scripts, even from the Powershell process running it. Join us as we present a new way to think about scripts.",
      "speakers": [
        30366
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:27+0000"
    },
    {
      "title": "Bug Hunting in RouterOS",
      "end_date": "2018-10-07T13:50+0000",
      "id": 30347,
      "location": 26052,
      "description": "RouterOS is the “operating system” that router manufacturer Mikrotik built on top of Linux for their embedded devices.Typically, when researchers think of embedded devices they think of simple interfaces and easy-to-find vulnerabilities. However, this isn’t the case with RouterOS. The OS is rich with features you’d expect to find in more expensive Cisco models and it’s been largely protected from bug hunters due to the proprietary protocols it uses with its web client (webfig) and its thick client (winbox). Some APT events like Slingshot and VPNFilter prove that RouterOS is a valuable target. By exploiting vulnerabilities in RouterOS, attackers gain a privileged position in the victim’s network.  Yet, there is no public tooling to aid in finding vulnerabilities in RouterOS. In this presentation, I will breakdown Mikrotik’s proprietary protocols and show the audience how to find bugs deep within the system. In this talk, I'll show the audience how to negotiation communication with RouterOS's webfig and break down the proprietary protocol that routes packets through the system. I'll combine what we've learned by showing off an authenticated stack buffer overflow that Tenable found in RouterOS. Note to Review Board: I have a specific authenticated stack buffer overflow I plan to demonstrate. We have already disclosed the vulnerability to Mikrotik and it should be patched (or outside of Tenable’s 90-day disclosure policy) by the time DerbyCon rolls around.",
      "speakers": [
        30367
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T13:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:27+0000"
    },
    {
      "title": "Ham Radio 4 Hackers",
      "end_date": "2018-10-07T14:50+0000",
      "id": 30348,
      "location": 26049,
      "description": "Introduction into the basics of Radio Frequency (RF). Why it's important to get licensed, better understand RF and be able to legally transmit.  We'll address how ham radio relevant to hackers in the modern Software Defined Radio era. We'll have a live DEMO with audience participation, please bring your RTL-SDR and an OTG dongle so you can try out decoding an RF signal using your mobile device.",
      "speakers": [
        30368,
        30369
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:28+0000"
    },
    {
      "title": "Two-Factor, Too Furious: Evading (and Protecting) Evolving MFA Schemes",
      "end_date": "2018-10-07T14:50+0000",
      "id": 30349,
      "location": 26050,
      "description": "Multifactor authentication is often the first (and too often, the last) line of defense against motivated attackers trying to get access to sensitive data. While is it correctly hailed as a cornerstone of in-depth network defense, adoption rates are outpacing education about the real-world attack scenarios levied against MFA schemes everyday. Here, we present an attempt at a modern threat model of MFA schemes today, with a breakdown of both classic and novel tools and techniques and what security teams responsible with enforcing MFA can do about it.",
      "speakers": [
        30370,
        30371
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:29+0000"
    },
    {
      "title": "Cloud Forensics:  Putting The Bits Back Together",
      "end_date": "2018-10-07T14:50+0000",
      "id": 30350,
      "location": 26051,
      "description": "Cloud computing security response is no different to servers racked in a regular datacenter, except for a key difference:  When a server is breached, and the need exists to perform a forensic evaluation of that server, the responder has no idea where, or what, that server is.  The very first steps of imaging a disk need to be rethought in an environment where disks are of variable sizes and capabilities, and are only exposed via APIs.  Many things which are taken for granted in the physical world are implementation details in the cloud.  Recent product launches in AWS, such as the next-generation of EC2 instances which access EBS in a different manner, as well as bare-metal instances, have changed some of these implementation details— which potentially changes what an incident responder may encounter.",
      "speakers": [
        30372
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:29+0000"
    },
    {
      "title": "Breaking Into Your Building: A Hackers Guide to Unauthorized Access",
      "end_date": "2018-10-07T14:50+0000",
      "id": 30351,
      "location": 26052,
      "description": "During this presentation, we’ll discuss proven methods of bypassing popular physical security controls and employees, using only publicly available tools and social engineering. You'll hear war stories from assessments that we have performed, and the frightening simplicity of gaining unauthorized physical access to many things from server rooms to Top Secret Ops rooms. These assessments will be broken down to discuss the various social engineering and physical security bypass methods and tools used, as well as remediation recommendations.",
      "speakers": [
        30373,
        30374
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:29+0000"
    },
    {
      "title": "Getting Control of Your Vendors Before They Take You Down",
      "end_date": "2018-10-07T15:50+0000",
      "id": 30352,
      "location": 26049,
      "description": "With cloud services now a normal part of business how does your organization handle being at fault when one of your third parties is breached?  Properly vetting vendors and third parties is increasingly important to minimize the likelihood of that happening.  We’ll explore the current and future state of third party risk management including: how to squeeze vendors for information they might not want to give you, what to do if you are the service provider getting questions, and how to plan for a breach of your information from a third party.",
      "speakers": [
        30375
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T15:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:30+0000"
    },
    {
      "title": "IoT: Not Even Your Bed Is Safe",
      "end_date": "2018-10-07T15:50+0000",
      "id": 30353,
      "location": 26050,
      "description": "During this talk we will discuss the tips, tools and techniques needed to identify and reverse engineer the command and control protocols required to remotely manipulate an industry leading “smart bed”.  Starting with identifying the location of two roque access points, the talk will discuss how to capture wireless frames and dissect them in Wireshark.  After determining the protocol, the talk will demonstrate a custom Python tool for controlling multiple beds simultaneously. Additionally, the talk will deep dive into identifying the attack surface of the bed’s administrative interface, as well as describing privacy issues with the software.",
      "speakers": [
        30376
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T15:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:30+0000"
    },
    {
      "title": "Killsuit: The Equation Group's Swiss Army knife for persistence, evasion, and data exfil",
      "end_date": "2018-10-07T15:50+0000",
      "id": 30354,
      "location": 26051,
      "description": "Most researchers have focused on the Equation Group's brilliant exploits but very few researchers have focused on their extremely effective post exploitation capabilities. During this talk, we will dissect the KillSuit framework, the Equation Group's Swiss Army Knife for persistence, information gathering, defense evasion, and data exfiltration. KillSuit is a little-known part of the DanderSpritz post-exploitation toolkit, leaked by the Shadow Brokers in April 2017. KillSuit is a full featured and versatile framework used by a variety of the Equation Group's tools and implants. KillSuit provides the ability to stealthily establish persistence on machines, install keyloggers, packet capture tools, perform WiFi MITM, and other more information gathering tools. Killsuit includes many interesting ways to silently exfiltrate data and intel - including custom written IPSEC-like protocols and misuse of \"\"disabled\"\" WIFI cards and near-by open networks.",
      "speakers": [
        30377
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T15:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:30+0000"
    },
    {
      "title": "The making of an iOS 11 jailbreak: Kiddie to kernel hacker in 14 sleepless nights.",
      "end_date": "2018-10-07T15:50+0000",
      "id": 30355,
      "location": 26052,
      "description": "In December 2017,Google Project 0’s Ian Beer released an exploit for two iOS kernel bugs. This is Bryce’s story of going from being a iOS kernel n00b to weaponizing the exploit into a fully functioning jailbreak for iOS 11.1.2. Each challenge along the path will be discussed including: iOS sandboxing, the terrible AMFI, the intricacies of code signing & entitlements, sleep deprivation, and more. Everyone & all skill levels are welcome—kernel hacking isn’t *that* scary!",
      "speakers": [
        30378
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T15:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:31+0000"
    },
    {
      "title": "Cyber Intelligence: There Are No Rules, and No Certainties",
      "end_date": "2018-10-07T16:50+0000",
      "id": 30356,
      "location": 26049,
      "description": "We've built an intelligence-driven security operations program over the years, and would like to impart our wisdom to the security community. There's a lot of formalization and \"best practices\" out there, but often times we learn that these can be quite unwieldy. I will communicate what we've learned in building a cyber intelligence program with the backdrop of a lot of information available on the subject. At the end of the talk, hopefully you will come away thinking about cyber intelligence in terms of some simple components you can start with, and build from, to gradually evolve into a business-focused operation for your team.",
      "speakers": [
        30379
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:31+0000"
    },
    {
      "title": "Fingerprinting Encrypted Channels for Detection",
      "end_date": "2018-10-06T17:50+0000",
      "id": 30357,
      "location": 26050,
      "description": "Last year we open sourced JA3, a method for fingerprinting client applications over TLS, and we saw that it was good. This year we tried fingerprinting the server side of the encrypted communication, and it's even better. Fingerprinting both ends of the channel creates a unique TLS communication fingerprint between client and server making detection of TLS C2 channels exceedingly easy. I'll explain how in this talk. What about non-TLS encrypted channels? The same principal can be applied. I'll talk about fingerprinting SSH clients and servers and what we've observed in our research. Are those SSH clients what they say they are? Maybe not.",
      "speakers": [
        30380
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-05T23:03+0000"
    },
    {
      "title": "The MS Office Magic Show",
      "end_date": "2018-10-07T16:50+0000",
      "id": 30358,
      "location": 26051,
      "description": "In this talk we will explore a wide range of novel techniques that abuse Microsoft Office features for offensive purposes. No bugs, no software vulnerabilities, only features. In recent years, we have seen a strong focus on offensive research with regard to macros, DDE and OLE. However, there is so much more interesting and unexplored functionality in the MS Office suite that can be abused in all stages of an attack. Stan Hegt and Pieter Ceelen will discuss typical Office security configurations and demonstrate a variety of new offensive techniques within the Office suite. These techniques range from abusing old school Office ’97 features to abuse of the latest and greatest Office 2016 features. Amongst others, we will demonstrate how to abuse Word documents for gathering sensitive information from systems, how to create phishing documents for credential harvesting without a macro payload, new Office lateral movement techniques and bypasses of security features (such as Attack Surface Reduction), and how to hide your macros from antivirus and analyst tools by abusing interesting features in Office file formats and VBA specifications.",
      "speakers": [
        30381,
        30382
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:32+0000"
    },
    {
      "title": "Who Watches the Watcher? Detecting Hypervisor Introspection from Unprivileged Guests",
      "end_date": "2018-10-07T16:50+0000",
      "id": 30359,
      "location": 26052,
      "description": "Over the last decade we have seen a rapid rise in virtualization-based tools in which a hypervisor is used to gain insight into the runtime execution of a system. In the earlier days, using virtualization for such \"introspection\" has only been thought of as a technique to develop stealthy rootkits. Today, there are a wide variety of security products using these techniques for services that include, for example, intrusion detection or malware analysis. With such rapid advances in introspection techniques, it is no longer a question of whether a hypervisor can be used to peek inside or even manipulate the VMs it executes. These advances thus beg the question: how can we trust that a hypervisor deployed by a cloud provider will respect the privacy of their customers? While there are hardware-based protection mechanisms guaranteeing data privacy even in the presence of such an introspecting hypervisor, there are no tools that can check whether the hypervisor is introspecting when it shouldn't - until now! We have developed Environmental Characterization and Response (ECR), a software package that analyzes instructions and memory accesses on an unprivileged guest system which has been deployed onto a hypervisor. The package leverages a variety of metrics to determine the potential presence (or lack) of introspection. These techniques are developed to look at micro-architectural properties of modern x86 systems, such as cache-based memory access timing and privileged instruction benchmarking to examine the behavior of the hypervisor. As hypervisors are notoriously known to manipulate time-stamps of virtualized clock-sources when standard instructions are used, we have developed timing methods that are difficult to manipulate by the hypervisor. ECR requires no special software, as the package is built to require the minimum possible amount of dependencies and relies only on standard administrator rights in the VM it runs in.",
      "speakers": [
        30383
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T16:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:32+0000"
    },
    {
      "title": "Getting Started in CCDC",
      "end_date": "2018-10-07T17:50+0000",
      "id": 30360,
      "location": 26049,
      "description": "In my talk, I will be covering how to set up a test environment, what systems you can and should use and how to run your practices. Also, I will be sharing my experiences in competing in CCDC, lessons learned and tools we used that helped us out.",
      "speakers": [
        30384
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:33+0000"
    },
    {
      "title": "On the Nose: Bypassing Huawei's Fingerprint authentication by exploiting the TrustZone",
      "end_date": "2018-10-07T17:50+0000",
      "id": 30361,
      "location": 26050,
      "description": "After hundreds of vulnerabilities disclosed and countless roots of smartphones the landscape of privilege separation is changing on your mobile device. No longer is kernel compromise the end of the road for attackers attempting to find all the dark secrets stored on your smartphone. Now we have TrustZone, a technology introduced by ARM which provides the \"Secure World\". This \"Secure World\" is separated from the Android kernel which exists in the \"Normal World\". Many of the most sensitive operations on your phone are now managed by the TrustZone. These include DRM, fingerprint authentication, and secure file storage, leaving a malicious kernel unable to meddle with them. This talk will demonstrate that despite the enhanced security architecture, a persistent attacker can still prevail. By chaining a number of memory corruption vulnerabilities the author will show how a lowly untrusted app on a Huawei device can compromise the kernel, followed by a trusted app, and eventually the TrustZone kernel itself. Using this access the author will show how the fingerprint trusted module can be patched to accept any fingerprint or even any nose. A demo with nose unlocking will be included.",
      "speakers": [
        30385
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:33+0000"
    },
    {
      "title": "Living off the land: enterprise post-exploitation",
      "end_date": "2018-10-07T17:50+0000",
      "id": 30362,
      "location": 26051,
      "description": "You've compromised that initial server and gained a foothold in the target network: congratulations! But wait - the shadow file has no hashes but root, the ssh keys have strong passphrases, and all the interesting traffic is encrypted - there's nothing of value here! Or is there? In this talk, I will explore post-exploitation techniques for turning your compromised bastion hosts into active credential interceptors under a variety of blue team monitoring scenarios.",
      "speakers": [
        30386
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:33+0000"
    },
    {
      "title": "Pwning in the Sandbox: OSX Macro Exploitation & Beyond",
      "end_date": "2018-10-07T17:50+0000",
      "id": 30363,
      "location": 26052,
      "description": "While performing red team engagements against a hybrid OSX/Windows environment we were challenged with creating successful maldocs targeting OSX systems with the up to date Microsoft Office Suite, which is protected by the OSX sandbox. After jumping through many hurdles both with VBA version conflicts and sandbox restrictions we successfully created our payload along with a post exploitation process to gather and exfil data from within the sandbox. Adam will share his experience with working with Apple security experts to block these attacks and put protections with a corporate environment. This is a perfect love story of Purple teaming which resulted in creating a more secure environment. Also, the mitigation we will be sharing for these attacks has not been publicly released by anyone including Apple at this point in time.",
      "speakers": [
        30387,
        30388
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T17:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:34+0000"
    },
    {
      "title": "Changing Our Mindset From Technical To Psychological Defenses",
      "end_date": "2018-10-07T18:50+0000",
      "id": 30364,
      "location": 26049,
      "description": "The majority of our Information Security defensive mindset is structured around technical weaknesses and issues. Yet, the adversary is increasingly turning to weaknesses in human psychology to breach our organizations and IT systems. This talk will explore the many examples of that shift in attack approach, how we in IT are not yet fully embracing this change, and recommendations on how we can start to deal with this new reality of Infosec Defense.",
      "speakers": [
        30389
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:34+0000"
    },
    {
      "title": "Bypassing Port-Security In 2018: Defeating MacSEC and 802.1x-2010",
      "end_date": "2018-10-07T18:50+0000",
      "id": 30365,
      "location": 26050,
      "description": "Existing techniques for bypassing wired port security are limited to attacking 802.1x-2004, which does not provide encryption or the ability to perform authentication on a packet-by-packet basis. The development of 802.1x-2010 mitigates these issues by using MacSEC to provide Layer 2 encryption and packet integrity checks to the protocol. Since MacSEC encrypts data on a hop-by-hop basis, it successfully protects against the bridge-based attacks pioneered by the likes of Steve Riley, Abb, and Alva Duckwall. In addition to the development of 802.1x-2010, improved 802.1x support by peripheral devices such as printers also poses a challenge to attackers. Gone are the days in which bypassing 802.1x was as simple as finding a printer and spoofing address, as hardware manufacturers have gotten smarter. In this talk, we will introduce a novel technique for bypassing 802.1x-2010 by demonstrating how MacSEC fails when weak forms of EAP are used. Additionally, we will discuss how improved 802.1x support by peripheral devices does not necessarily translate to improved port-security due to the widespread use of weak EAP. Finally, we will consider how improvements to the Linux kernel have made bridge-based techniques easier to implement and demonstrate an alternative to using packet injection for network interaction. We have packaged each of these techniques and improvements into an open source tool called Silent Bridge, which we plan on releasing at the conference.",
      "speakers": [
        30390
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:34+0000"
    },
    {
      "title": "Hillbilly Storytime: Pentest Fails",
      "end_date": "2018-10-07T18:50+0000",
      "id": 30366,
      "location": 26051,
      "description": "Whether or not you are just starting in InfoSec, it is always important to remember that mistakes happen, even to the best and most seasoned of analysts.  The key is to learn from your mistakes and keep going. So, if you have a few minutes and want to talk a load off for a bit, come and join in as a hillbilly spins a yarn about a group unfortunate pentesters and their misadventures.  All stores and events are true (but the names have been be changed to prevent embarrassment).",
      "speakers": [
        30391
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:35+0000"
    },
    {
      "title": "IOCs Today, Intelligence-Led Security Tomorrow",
      "end_date": "2018-10-07T18:50+0000",
      "id": 30367,
      "location": 26052,
      "description": "With the advent of STIX 2.x and the ever-increasing evolution of TIP technologies, TI analysts and TI data are careening at break-neck speed towards the next level, the post-IOC world of intelligence-led security.",
      "speakers": [
        30392,
        30393
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:35+0000"
    },
    {
      "title": "Ridesharks",
      "end_date": "2018-10-05T22:25+0000",
      "id": 30368,
      "location": 26053,
      "description": "Ridesharing and the gig economy are the future of DIY work and resource sharing. How safe is ridesharing to the passengers and drivers from a privacy standpoint? How can the systems in place be used for less than noble purposes? What can you do as a rider and driver to protect yourself from the ridesharks?  Everything you never wanted to know and were afraid to ask!",
      "speakers": [
        30394
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T22:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:36+0000"
    },
    {
      "title": "Threat Hunting with a Raspberry Pi",
      "end_date": "2018-10-07T18:25+0000",
      "id": 30369,
      "location": 26053,
      "description": "Raspberry Pi's are being used more and more. This talk will cover how to utilize a Raspberry Pi as an automated threat hunting sensor that utilizes open source tools and custom IoC's.",
      "speakers": [
        30395
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T18:00+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:37+0000"
    },
    {
      "title": "M&A Defense and Integration – All that Glitters is not Gold ",
      "end_date": "2018-10-07T18:55+0000",
      "id": 30370,
      "location": 26053,
      "description": "So your enterprise bought a new bright and shiny – now what? I bet their InfoSec practices are fine, right? We will discuss how to plan and execute on an integration from a defense perspective; due diligence, purchasing, and integrating into enterprise security engineering and defense practices along with migrating monitoring into your own SOC (or MSSP). This talk is also applicable to you just landed an InfoSec job at a company that is just starting their security program and wonder where to start.",
      "speakers": [
        30396,
        30397
      ],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T18:30+0000",
      "event_type": 10,
      "updated_at": "2018-10-02T01:38+0000"
    },
    {
      "title": "Capture the Flag 8.0 ",
      "end_date": "2018-10-06T01:00+0000",
      "id": 30371,
      "location": 30209,
      "description": "Contest runs from Friday 12pm to Sunday 12pm\r\n\r\nFriday: 12pm to 9pm, Saturday: 9am to 9pm\r\n\r\nSunday: 10am to 12pm\r\n\r\nCome and test your skillz! Come and compete against other\r\n\r\npeople in the industry!\r\n\r\nThe capture the flag event is an open event and there are no qualifiers. Anyone can participate via self-registration. There will be posters around the venue with information on how to connect and play as well as information regularly distributed through the official DerbyCon CTF Twitter account @DerbyConCTF.\r\n\r\nThe wireless network information is:\r\n\r\nWireless SSID: DerbyCon-CTF\r\n\r\nPassword: DerbyCon-CTF\r\n\r\nAfter connecting to CTF network, registration and rules located at https://scoreboard.ctf.derbycon.com\r\n\r\nPRIZES:\r\n\r\nBlack Badge\r\n\r\n2019 Conference Ticket   –   $500 cash   –   $350 cash\r\n\r\n$200 cash   –   $100 cash   –   $100 Visa gift card   –   $100 Visa gift card\r\n\r\n$50 Amazon gift card   –   $50 Amazon gift card\r\nWinners announced @ closing ceremony\r\n\r\nBYOEPC – Bring your own ethernet patch cord\r\n\r\nSponsored By: Synack",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T18:15+0000"
    },
    {
      "title": "SECTF opening",
      "end_date": "2018-10-05T18:30+0000",
      "id": 30372,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:25+0000"
    },
    {
      "title": "SECTF Call 1",
      "end_date": "2018-10-05T19:00+0000",
      "id": 30373,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T18:30+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:25+0000"
    },
    {
      "title": "SECTF Call 2",
      "end_date": "2018-10-05T19:30+0000",
      "id": 30374,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:25+0000"
    },
    {
      "title": "SECTF Call 3",
      "end_date": "2018-10-05T20:00+0000",
      "id": 30375,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T19:30+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:26+0000"
    },
    {
      "title": "SECTF Call 4",
      "end_date": "2018-10-05T20:30+0000",
      "id": 30376,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:26+0000"
    },
    {
      "title": "SECTF Call 5",
      "end_date": "2018-10-05T21:00+0000",
      "id": 30377,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:30+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:26+0000"
    },
    {
      "title": "SECTF Call 6",
      "end_date": "2018-10-05T22:00+0000",
      "id": 30378,
      "location": 30210,
      "description": "",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T21:30+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:27+0000"
    },
    {
      "title": "Poly Challenge",
      "end_date": "2018-10-06T16:30+0000",
      "id": 30379,
      "location": 30210,
      "description": "Polygraph: Noun. 1. an instrument for receiving and recording simultaneously tracings of variations in certain body activities 2. a test using such an instrument to determine if a person is telling the truth.\r\n\r\nMany fear it, many have studied how to beat it…want to try your hand at it? Only at Derby Con do we bring the “Can you fool the Polygraph?” event. We bring in a professional polygraph examiner and ask a series of questions. If you can beat it there is some awesome SE schwag that is all yours.\r\n\r\nIf you want to join in on the fun then come to the SE Village at Derby Con on Saturday, October 6 where we will be taking live sign ups.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:29+0000"
    },
    {
      "title": "Mission SE Impossible",
      "end_date": "2018-10-06T21:00+0000",
      "id": 30380,
      "location": 30210,
      "description": "What is Mission SE Impossible (MSI)? Maybe the best way to describe it is if the Gringo Warrior Challenge had a baby with Ethan Hunt while getting some scotch soaked DNA from the Human Hacker, it would give birth to Mission SE Impossible. Also, this baby could shoot lasers out of it’s eyes.\r\n\r\nWith lock picking, hand cuffs, laser obstacle course, some ciphers, and safe cracking MSI quickly became extremely popular in the SE Village. Folks of all ages have signed up and competed in this event and are watched by an enthusiastic crowd who is always willing to help out and heckle.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T17:30+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:30+0000"
    },
    {
      "title": "SEPanel – “Ethics in SE” – Chris Silvers, Chris Hadnagy, Rachel Tobac, Grifter",
      "end_date": "2018-10-07T00:00+0000",
      "id": 30381,
      "location": 30210,
      "description": "It all started in 2016, at DerbyCon. A “rectangle table” (we couldn’t find a round table) was created where the greatest minds in social engineering sat and discussed their views on the ever changing social engineering landscape as well as answered your social engineering questions.\r\n\r\nWe’re bringing back the SE Panel this year not only on one but two days! You won’t want to miss your chance to learn from the top leading experts and ask them the questions you’ve wanted answers to\r\nThe SE panel will be held on Saturday, October 6 in the SE Village at Derby Con.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T22:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:31+0000"
    },
    {
      "title": "Derbycon Mental Health Workshop",
      "end_date": "2018-10-06T22:00+0000",
      "id": 30382,
      "location": 30211,
      "description": "We as a community struggle with large amounts of stress, mental health issues, and general emotional well being troubles. The purpose of this workshop is to learn about the issues themselves, coping mechanisms, help others close to us, and have a no judgement area to share stories and provide and receive guidance. There will be both structured and unstructured time given in this workshop.",
      "speakers": [],
      "conference": "DC80",
      "link": "https://docs.google.com/document/d/1diGc54-VuwXhVjXupWEjaDm5qeYomuMKQdEHfPer1tg/edit",
      "includes": "",
      "start_date": "2018-10-05T12:00+0000",
      "event_type": 30210,
      "updated_at": "2018-10-02T05:33+0000"
    },
    {
      "title": "Derbycon Mental Health Workshop",
      "end_date": "2018-10-06T22:00+0000",
      "id": 30383,
      "location": 30211,
      "description": "We as a community struggle with large amounts of stress, mental health issues, and general emotional well being troubles. The purpose of this workshop is to learn about the issues themselves, coping mechanisms, help others close to us, and have a no judgement area to share stories and provide and receive guidance. There will be both structured and unstructured time given in this workshop.",
      "speakers": [],
      "conference": "DC80",
      "link": "https://docs.google.com/document/d/1diGc54-VuwXhVjXupWEjaDm5qeYomuMKQdEHfPer1tg/edit",
      "includes": "",
      "start_date": "2018-10-06T12:00+0000",
      "event_type": 30210,
      "updated_at": "2018-10-02T05:33+0000"
    },
    {
      "title": "Mock Interview and Resume Review Workshop",
      "end_date": "2018-10-05T20:00+0000",
      "id": 30384,
      "location": 30212,
      "description": "The Mock Interview and Resume Review Workshop provides an opportunity for folks in need of resume review and/or assistance with interview tips and techniques to receive, free of charge, one-on-one time with an experienced hiring manager to work on areas of weakness. The sessions are 30 min, by appointment, with limited availability for walk-ins. This is a great opportunity to pair hiring experts with job seekers in the security community. This is not a recruiting event and slots fill quickly, so organizers ask folks to send notification if they’re unable to attend during scheduled time. Although there are no guarantees, in 2017 around 50% of participants had a successful interview, job offer, and/or promotion within 30 days of attending the MIRR workshop. Interested in holding a workshop like this at your conference of event? The framework is on Github and we’re happy to get you started!",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T16:00+0000",
      "event_type": 30210,
      "updated_at": "2018-10-02T05:34+0000"
    },
    {
      "title": "Lockpick Village",
      "end_date": "2018-10-05T23:00+0000",
      "id": 30385,
      "location": 30213,
      "description": "Lock Picking Pachinko will be making a comeback this year! We have plenty of other games and locks for all skill levels including the “Rumble Challenge” multi-round competition. Picking, bumping, more games, and other surprises are waiting for you in the lockpicking village! Awesome schwag will be awarded for top places in all competitions. Come to learn, stay to compete!",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T14:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:34+0000"
    },
    {
      "title": "Lockpick Village",
      "end_date": "2018-10-06T23:00+0000",
      "id": 30386,
      "location": 30213,
      "description": "Lock Picking Pachinko will be making a comeback this year! We have plenty of other games and locks for all skill levels including the “Rumble Challenge” multi-round competition. Picking, bumping, more games, and other surprises are waiting for you in the lockpicking village! Awesome schwag will be awarded for top places in all competitions. Come to learn, stay to compete!",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:35+0000"
    },
    {
      "title": "Car Hacking Village",
      "end_date": "2018-10-06T23:00+0000",
      "id": 30387,
      "location": 30214,
      "description": "The Car Hacking Village is an interactive, hand-on event where village goers can learn about vehicle electronic systems. At DerbyCon we’ll run a CTF where we’ll have vehicle hacking trivia, electronic controllers for hacking, and we’ll sell tools related vehicle hacking.\r\n\r\nCheck out CarHackingVillage.com for info and contact. Follow us @CarHackVillage on Twitter.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:35+0000"
    },
    {
      "title": "Car Hacking Village",
      "end_date": "2018-10-05T23:00+0000",
      "id": 30388,
      "location": 30214,
      "description": "The Car Hacking Village is an interactive, hand-on event where village goers can learn about vehicle electronic systems. At DerbyCon we’ll run a CTF where we’ll have vehicle hacking trivia, electronic controllers for hacking, and we’ll sell tools related vehicle hacking.\r\n\r\nCheck out CarHackingVillage.com for info and contact. Follow us @CarHackVillage on Twitter.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T14:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:35+0000"
    },
    {
      "title": "Hardware Hacking Village",
      "end_date": "2018-10-05T23:00+0000",
      "id": 30389,
      "location": 30215,
      "description": "LVL1, Louisville’s Hackerspace, will be hosting a hardware hacking village, complete with devious and useful kits to solder together (no experience required! Through hole and surface mount kits available!) along with a showcase of projects. New this year: make your own essential-oils (while supplies last). Need some bling for the party?  We’ll have LED based kits to solder together, too. Interested in the low-level stuff? Stop by the hardware hacking village to hack together something of your own, chat with other hardware hackers, and check out some cool stuff. Interested in learning more about LVL1 and hackerspaces? Visit http://www.lvl1.org.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T14:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:35+0000"
    },
    {
      "title": "Hardware Hacking Village",
      "end_date": "2018-10-06T23:00+0000",
      "id": 30390,
      "location": 30215,
      "description": "LVL1, Louisville’s Hackerspace, will be hosting a hardware hacking village, complete with devious and useful kits to solder together (no experience required! Through hole and surface mount kits available!) along with a showcase of projects. New this year: make your own essential-oils (while supplies last). Need some bling for the party?  We’ll have LED based kits to solder together, too. Interested in the low-level stuff? Stop by the hardware hacking village to hack together something of your own, chat with other hardware hackers, and check out some cool stuff. Interested in learning more about LVL1 and hackerspaces? Visit http://www.lvl1.org.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T14:00+0000",
      "event_type": 30207,
      "updated_at": "2018-10-02T05:36+0000"
    },
    {
      "title": "SoHopelessly Broken",
      "end_date": "2018-10-05T23:00+0000",
      "id": 30391,
      "location": 30216,
      "description": "SoHopelessly Broken, presented by Independent Security Evaluators (ISE), is back at DerbyCon for our fourth year! We have expanded the contest to not only include SOHO routers, but other types of IoT devices such as network storage systems, cameras, and IP enabled toys!\r\n\r\nTrack 1: Players compete against one another by exploiting off-the-shelf IoT devices. These 15+ devices all have known vulnerabilities, but to successfully exploit these devices requires lateral thinking, knowledge of networking, and competency in exploit development. CTFs are a great experience to learn more about security and test your skills, so join up in a team (or even by yourself) and compete for fun and prizes! Exploit as many as you can over the weekend and the top three teams will be rewarded.\r\n\r\nTrack 2:  Hack shop area for people to actively hack and collaborate on selected devices.\r\n\r\nTrack 3: A variety of workshops and talks will be delivered throughout the weekend.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T15:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:37+0000"
    },
    {
      "title": "SoHopelessly Broken",
      "end_date": "2018-10-06T23:00+0000",
      "id": 30392,
      "location": 30216,
      "description": "SoHopelessly Broken, presented by Independent Security Evaluators (ISE), is back at DerbyCon for our fourth year! We have expanded the contest to not only include SOHO routers, but other types of IoT devices such as network storage systems, cameras, and IP enabled toys!\r\n\r\nTrack 1: Players compete against one another by exploiting off-the-shelf IoT devices. These 15+ devices all have known vulnerabilities, but to successfully exploit these devices requires lateral thinking, knowledge of networking, and competency in exploit development. CTFs are a great experience to learn more about security and test your skills, so join up in a team (or even by yourself) and compete for fun and prizes! Exploit as many as you can over the weekend and the top three teams will be rewarded.\r\n\r\nTrack 2:  Hack shop area for people to actively hack and collaborate on selected devices.\r\n\r\nTrack 3: A variety of workshops and talks will be delivered throughout the weekend.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T15:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:36+0000"
    },
    {
      "title": "Pwning Pawns: Hacking The Game of Kings",
      "end_date": "2018-10-05T19:00+0000",
      "id": 30393,
      "location": 30217,
      "description": "Strategy, improvisation, analytics, stress reduction, thinking fast & slow, knowledge of offense & defensive techniques. What do all of these things have in common? They are all areas of skill that we as a collective group of security professionals can never have enough of. Few activities in this life encompass them more than the game of chess.\r\n\r\nHave you ever wanted to learn to play chess but couldn’t find the time or were too intimidated by the learning curve? Didn’t even know where to start? This workshop is for you. We’ll cover what the pieces do, different openings, mating techniques, everything to get your gears moving towards a fun & rewarding journey of being a chess player. All skill levels are welcome.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T17:00+0000",
      "event_type": 30210,
      "updated_at": "2018-10-02T05:38+0000"
    },
    {
      "title": "Ham Radio Exams",
      "end_date": "2018-10-05T22:00+0000",
      "id": 30394,
      "location": 30217,
      "description": "Amateur Radio (ham radio) is a popular hobby and service that brings people, electronics and communication together. People use ham radio to talk across town, around the world, or even into space, all without the Internet or cell phones. It’s fun, social, educational, and can be a lifeline during times of need.\r\n\r\nDerbyCon 8 will be host a ham radio licensing exam! The cost is $15 (cash or check only). Check out the ARRL website for information on what to bring to the exam, as well as exam question pools, free study resources, and other FAQ. No pre-registration is required.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-05T20:00+0000",
      "event_type": 30208,
      "updated_at": "2018-10-02T05:38+0000"
    },
    {
      "title": "Ham Radio Exams",
      "end_date": "2018-10-07T16:00+0000",
      "id": 30395,
      "location": 30216,
      "description": "Amateur Radio (ham radio) is a popular hobby and service that brings people, electronics and communication together. People use ham radio to talk across town, around the world, or even into space, all without the Internet or cell phones. It’s fun, social, educational, and can be a lifeline during times of need.\r\n\r\nDerbyCon 8 will be host a ham radio licensing exam! The cost is $15 (cash or check only). Check out the ARRL website for information on what to bring to the exam, as well as exam question pools, free study resources, and other FAQ. No pre-registration is required.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-07T14:00+0000",
      "event_type": 30208,
      "updated_at": "2018-10-02T05:39+0000"
    },
    {
      "title": "Crack Me If You Can (CMIYC) Challenge",
      "end_date": "2018-10-07T15:00+0000",
      "id": 30396,
      "location": 30218,
      "description": "The annual password cracking contest “Crack Me If You Can” returned this\r\nyear to DEFCON, and are returning to DerbyCon as well!\r\nCompete online in a 50 hour password cracking contest against the best password crackers in the world.  KoreLogic changed the rules last year, and this year’s challenge is less of a point-war, and more of a string of challenges with the goal being the first team to the end, wins! The contest will be online “forever” so you can play along at a later time, to see how long it takes you to finish. You think you can beat Team Hashcat’s time? What about the Cynosure Prime people? See how you stack up against John-Users. All worthy adversaries. Spend 50 hours of your CON behind a wall of GTX 2080s.\r\nhttps://twitter.com/crackmeifyoucan",
      "speakers": [],
      "conference": "DC80",
      "link": "https://twitter.com/crackmeifyoucan",
      "includes": "",
      "start_date": "2018-10-05T13:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:40+0000"
    },
    {
      "title": "Hack your Derby",
      "end_date": "2018-10-06T21:00+0000",
      "id": 30397,
      "location": 30218,
      "description": "Judging 6pm, Location to be announced via @hackyourderby on Twitter\r\n\r\nWinners announced @ closing ceremony\r\n\r\nHack Your Derby is a contest held annually at the DerbyCon hacker convention in Louisville, Kentucky. It is simple and straightforward: turn a derby hat — already a fine piece of functional fashion — into something more. Exactly how much more is up to you. Feel free to express your hacker spirit in the vein of technological or aesthetic development. There are points awarded by the judges in each of those categories, as well as accolades for overall originality.\r\n\r\nYou may either work on your derby creation before the conference or compete using exclusively what you can source in and around the con hotel during DerbyCon itself. Overall, however, the themes of “make something new, make something epic, make something awesome” are the order of the day.\r\n\r\nThere will be multiple winners in a variety of categories! All submissions must be displayed to the judges at 6 PM on Saturday (again, location TBA) and scoring will be totaled and finalized by Closing Ceremonies on Sunday.\r\n\r\nFor more information and full detail of the rules and categories, check hackyourderby.com Follow @hackyourderby for updates and to see amazing footage of the submissions!",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T22:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:41+0000"
    },
    {
      "title": "Hacker Jeopardy #4.2",
      "end_date": "2018-10-06T03:00+0000",
      "id": 30398,
      "location": 30210,
      "description": "(Oh, Hell Yeah, It Is! Same as last year… only different!\r\n\r\n1st floor – Kentucky Ballroom F&G (Track 4)\r\nFriday 8pm (One Night Only! Arrive Early. Limited Seating. Beer, Bribery, Humiliation and Nefarious Tactics OK.) Direct them at Lintile, Fizzgig and Winn. Let’s see how you do!\r\n\r\nYou know the game. You get publicly humiliated for saying stupid sh!t while chugging beers for a lousy 100 points a bottle! And the host and audience have all the fun making fun of your general ignorance. Or not… mayhaps? Will there be surprise SMARTS this year? You know we will taunt you, abuse you and confuse you, for our merriment, of course.\r\n\r\nStill Want to Play? 2 – Games 6 Teams.\r\n\r\nThen a one Category playoff for the two Winning Teams:\r\n\r\nThe Winning Team Gets:\r\n1. Free TIX to DerbyCon 2019 (Priceless)\r\n2. Copies of Winn’s New Book: Analogue Network Security ($100,000 value)\r\n\r\nHall Pass to Play Hacker Jeopardy at DefCon: No Qualifications Round!\r\nSo You! Submit your Teams Now! Derby is only a few weeks off and you don’t want to miss your chance to drink free beer and demonstrate your ’skills’ in front of your guffawing peers.\r\n\r\nSend your Team Submissions (and bribes) to Winn@SecurityExperts.Com Teams will be picked live at DerbyCon Jeopardy. So, that means, remember to Be There. (Oh, the abuse has already begun…)\r\n\r\nTeams consist of 3 people, no more, no less\r\nContestants must be 18 or older, 21 to consume alcohol\r\nWE CARD FOR ALCOHOL! No exceptions, this is mandated by the hotel\r\nIf you don’t have a valid ID, you may not consume alcohol\r\nIf you try to pass off a fake ID, your entire team is disqualified\r\nIf your team is called, you must have all members present. If they aren’t, you’re out that round\r\nPoints are awarded for answering questions right, as well as 100 points for every beer FULLY consumed by the beginning of Final Jeopardy\r\nFailing a daily double will turn your beer into a warm N/A beer, which you must finish to resume drinking (no points are awarded for these)\r\nYou may wager any amount you have on a Daily Double. If you have less than $500, you may still wager $500\r\nHumperdink Rule: If you puke before the game is over, you lose all beer points\r\nThe Ref has the final say over correctness of an answer. No arguing – that’s the end of it\r\nAll results are final. Sometimes we fuck it up, and if we do, we’re sorry, but there are no appeals\r\nContestants and audience members are expected to behave. If you can’t, you will be told to leave. If you are a player, your team may have to forfeit\r\n",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T00:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T05:42+0000"
    },
    {
      "title": "Whose Slide Is It Anyway? ",
      "end_date": "2018-10-07T02:00+0000",
      "id": 30399,
      "location": 26053,
      "description": "“Whose Slide Is It Anyway?” is an unholy union of improv comedy, hacking and slide deck sado-masochism.\r\n\r\nOur team of slide monkeys will create a stupid amount of short slide decks on whatever nonsense tickles our abnormal fancies. Slides are not exclusive to technology, they can and will be about anything. Contestants will take the stage & be given a slide deck of our choosing. They will then improvise a minimum 5 minute / maximum 10 minute lightning talk, becoming instant subject matter experts on whatever topic/stream of consciousness appears on the screen.\r\n\r\nWhat are you playing for? Awesome prize packs from one of our generous sponsors. Players are chosen on a first come, first served basis so get there early.\r\n\r\nWhether you delight in the chaos of watching your fellow hackers squirm or would like to sacrifice yourself to the Contest Gods, it’s a night of schadenfreude for the whole family.",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T23:00+0000",
      "event_type": 30208,
      "updated_at": "2018-10-02T05:43+0000"
    },
    {
      "title": "Hack the Hat V8 – Biking at DerbyCon",
      "end_date": "2018-10-06T14:00+0000",
      "id": 30400,
      "location": 30219,
      "description": "Most of you know that the first year we did this we actually started in Ohio and cycled our way down to Louisville in the days prior to the con. That’s a bit hard to manage on an annual basis so we settle for doing an early morning ride at the con instead. We’d love for you to join us.  Your best bet for this ride is to bring your own bike if you can. There are places to rent in Louisville and we’ll leave you to your own devices on that front as we generally don’t have enough critical mass for this ride to ask a shop for any deals or special accommodations. Be aware that renting may require you to pick up your bike the day before. Also it appears that Louisville finally has a bike share program so that’s an option as well – especially since there are pick up stations near the con venue.\r\nRide Details:\r\nMeet Saturday, October 6th, at 7:30am in the Marriott Louisville lobby. You will meet Tom Tufts and Jim Elliott.\r\nThis is a no drop, no setting speed records ride but hopefully we’ll get about 15-20 miles in before finishing.\r\nRoute is TBD, but there will be no major hills (it’s Louisville after all)\r\nWe likely will NOT be back for the first talk of the day but should return with plenty of time to make that 2nd slot. Sorry Saturday morning speakers.\r\nAll riders need to have a bike, helmet, and water bottle (preferably filled with…you know…water).\r\nSome of us have had good luck picking up a bike on Friday for the Saturday 7:30am ride from here: http://www.bikecourier.org/ <- about 10 minute walk from Marriott.\r\nClick here to let us know if you’re coming. All information gathered will be deleted after the ride is completed. Got questions? Tweet @Cycle_OverRide, or email info at cycleoverride.org",
      "speakers": [],
      "conference": "DC80",
      "link": "http://cycleoverride.org/",
      "includes": "",
      "start_date": "2018-10-06T11:30+0000",
      "event_type": 30208,
      "updated_at": "2018-10-02T05:44+0000"
    },
    {
      "title": "Capture the Flag 8.0 ",
      "end_date": "2018-10-07T01:00+0000",
      "id": 30401,
      "location": 30209,
      "description": "Contest runs from Friday 12pm to Sunday 12pm\r\n\r\nFriday: 12pm to 9pm, Saturday: 9am to 9pm\r\n\r\nSunday: 10am to 12pm\r\n\r\nCome and test your skillz! Come and compete against other\r\n\r\npeople in the industry!\r\n\r\nThe capture the flag event is an open event and there are no qualifiers. Anyone can participate via self-registration. There will be posters around the venue with information on how to connect and play as well as information regularly distributed through the official DerbyCon CTF Twitter account @DerbyConCTF.\r\n\r\nThe wireless network information is:\r\n\r\nWireless SSID: DerbyCon-CTF\r\n\r\nPassword: DerbyCon-CTF\r\n\r\nAfter connecting to CTF network, registration and rules located at https://scoreboard.ctf.derbycon.com\r\n\r\nPRIZES:\r\n\r\nBlack Badge\r\n\r\n2019 Conference Ticket   –   $500 cash   –   $350 cash\r\n\r\n$200 cash   –   $100 cash   –   $100 Visa gift card   –   $100 Visa gift card\r\n\r\n$50 Amazon gift card   –   $50 Amazon gift card\r\nWinners announced @ closing ceremony\r\n\r\nBYOEPC – Bring your own ethernet patch cord\r\n\r\nSponsored By: Synack",
      "speakers": [],
      "conference": "DC80",
      "link": "",
      "includes": "",
      "start_date": "2018-10-06T16:00+0000",
      "event_type": 30209,
      "updated_at": "2018-10-02T18:15+0000"
    }
  ]
}