{
  "speakers": [
    {
      "link": "",
      "twitter": "",
      "description": "",
      "title": "",
      "updated_at": "2018-08-31T19:01+0000",
      "name": "DerbyCon Team",
      "conference": "DC80",
      "id": 26788
    },
    {
      "link": "",
      "twitter": "",
      "description": "",
      "title": "",
      "updated_at": "2018-09-09T01:01+0000",
      "name": "datagram",
      "conference": "DC80",
      "id": 28118
    },
    {
      "link": "",
      "twitter": "@gentilkiwi",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:17+0000",
      "name": "Benjamin Delpy",
      "conference": "DC80",
      "id": 30239
    },
    {
      "link": "",
      "twitter": "@edskoudis",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:18+0000",
      "name": "Ed Skoudis",
      "conference": "DC80",
      "id": 30240
    },
    {
      "link": "",
      "twitter": "@strandjs",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:18+0000",
      "name": "John Strand",
      "conference": "DC80",
      "id": 30241
    },
    {
      "link": "",
      "twitter": "@hacks4pancakes",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:18+0000",
      "name": "Lesley Carhart",
      "conference": "DC80",
      "id": 30242
    },
    {
      "link": "",
      "twitter": "@penetrate_io",
      "description": "Sam has served in the State Department's Foreign Service as a security engineer who worked on threat hunting and red teaming. He is currently a proactive consultant for Mandiant.",
      "title": "",
      "updated_at": "2018-10-01T16:19+0000",
      "name": "Samuel Sayen",
      "conference": "DC80",
      "id": 30243
    },
    {
      "link": "",
      "twitter": "@jaredcatkinson",
      "description": "Jared Atkinson is the Adversary Detection Technical Lead at SpecterOps who specializes in DFIR. Jared spent two years at Veris Group’s Adaptive Threat Division (ATD) and four years with the U.S. Air Force Hunt Team. Passionate about PowerShell and the open source community, Jared is the lead developer of the PowerForensics project, Uproot, and PSReflect Functions. ",
      "title": "",
      "updated_at": "2018-10-01T16:20+0000",
      "name": "Jared Atkinson",
      "conference": "DC80",
      "id": 30244
    },
    {
      "link": "",
      "twitter": "@robwinchester3",
      "description": "Robby Winchester is an experienced threat hunter and penetration tester. Over the course of his career, he has developed and supervised penetration testing, physical security, and breach assessments for several private sector and government clients. Previously, Robby worked for the U.S. Air Force Information Aggressors, providing full-scope network and physical red team operational assessments, and worked to integrate information security operations within traditional military operations for the U.S. Air Force’s RED FLAG exercise.",
      "title": "",
      "updated_at": "2018-10-01T16:20+0000",
      "name": "Robby Winchester",
      "conference": "DC80",
      "id": 30245
    },
    {
      "link": "",
      "twitter": "",
      "description": "The search researcher and technology service director of Onward Security. Familiar with web security and fuzzing technique, loves to find the security vulnerabilities in different field, such as web application, cloud service, ICS/SCADA, mobile application, automotive and IoT device.",
      "title": "",
      "updated_at": "2018-10-01T16:20+0000",
      "name": "Tso-Jen Liu",
      "conference": "DC80",
      "id": 30246
    },
    {
      "link": "",
      "twitter": "@theemmazaballos",
      "description": "Emma Zaballos is an Analyst at Terbium Labs, working on evaluating and contextualizing threats to customer data. She specializes in visualizing trends in the sale and trade of stolen payment cards, reading forum drama on the dark web, and studying the many ways companies fail to secure user data. Terbium Labs provides proactive data monitoring solutions - beginning with the assumption that your critical data is always at risk - and specializes in systems designed to detect your sensitive information wherever it may appear on the dark web.",
      "title": "",
      "updated_at": "2018-10-01T16:21+0000",
      "name": "Emma Zaballos",
      "conference": "DC80",
      "id": 30247
    },
    {
      "link": "",
      "twitter": "@jrozner",
      "description": "Joe is an engineer at Prevoty where he has built semantic analysis tools, language runtimes, generalized solutions to common vulnerability classes, and designed novel integration technology leveraging runtime memory patching and instrumentation. He has a passion for reverse engineering, exploitation, teaching, and sharing research with others.",
      "title": "",
      "updated_at": "2018-10-01T16:22+0000",
      "name": "Joe Rozner",
      "conference": "DC80",
      "id": 30248
    },
    {
      "link": "",
      "twitter": "@evil_mog",
      "description": "EvilMog is a Senior Managing Consultant for IBM X-Force Red, a Bishop in the Church of Wifi and a Member of Team Hashcat, he is also the self proclaimed chief shenanigator of DerbyCon",
      "title": "",
      "updated_at": "2018-10-01T16:22+0000",
      "name": "Evilmog",
      "conference": "DC80",
      "id": 30249
    },
    {
      "link": "",
      "twitter": "@hidinginIndiana",
      "description": "Speaker 1 has a Degree in Information Security, Advance training from The National White Collar Crime Center in Social Media and currently works as a contractor for several different agencies.",
      "title": "",
      "updated_at": "2018-10-01T16:22+0000",
      "name": "Greg Simo",
      "conference": "DC80",
      "id": 30250
    },
    {
      "link": "",
      "twitter": "@admford",
      "description": "Independent Security Researcher and member of the Chicago Burbsec community.",
      "title": "",
      "updated_at": "2018-10-01T16:23+0000",
      "name": "Daniel Lagos",
      "conference": "DC80",
      "id": 30251
    },
    {
      "link": "",
      "twitter": "@DrHaxs",
      "description": "Carl is an eternal security soldier from another world who loves breaking stuff, watching systems burn to the ground, sampling aged Kentucky creek water, and laughing in the face of pain and stress. Teaching security is painful, we need to keep it simple, helping others to rise from the ashes more knowledgeable and secure.  10000 binary years in the security industry, reluctant CCSP/GSTRT.",
      "title": "",
      "updated_at": "2018-10-01T16:23+0000",
      "name": "Carl Alexander",
      "conference": "DC80",
      "id": 30252
    },
    {
      "link": "",
      "twitter": "@TheWindowsTwin",
      "description": "Michael Roberts is currently a student at the University of Central Florida. Has competed in many offensive and defensive competitions including CCDC nationals. Interned at X-Force Red (IBM) in the summer of 2018. Focus is on Windows security and post-exploitation. ",
      "title": "",
      "updated_at": "2018-10-01T16:23+0000",
      "name": "Michael Roberts",
      "conference": "DC80",
      "id": 30253
    },
    {
      "link": "",
      "twitter": "@MartinR407",
      "description": "Martin Roberts is currently a student at the University of Central Florida. Has competed in many offensive and defensive competitions including CCDC nationals. Interned at X-Force Red (IBM) in the summer of 2018. Focus is on Linux security and Linux pentesting.",
      "title": "",
      "updated_at": "2018-10-01T16:24+0000",
      "name": "Martin Roberts",
      "conference": "DC80",
      "id": 30254
    },
    {
      "link": "",
      "twitter": "",
      "description": "Lisa Bradley - Dr. Lisa Bradley is currently the Senior Program Manager for NVIDIA’s Product Security Incident Response Team (PSIRT). Her responsibilities include the management and resolution of product security vulnerabilities involving all NVIDIA products. She has 5 years of experience leading PSIRT programs as she previously worked at IBM for 17 years.  Lisa has served as a spokeswoman for many tech-related events including 2016-2018 FIRST PSIRT Technical Colloquium, 2017 FIRST Annual Conference and the Security Journey White Belt modules. Lisa received her BA degree in both Mathematics and Computer Science from SUNY Geneseo. She also has a Masters and PhD in Applied Mathematics from NC State University. Outside of her role with NVIDIA, Lisa has been an adjunct professor at local universities for the past 12 years.  Lisa enjoys spending time with her three kids, James (10), Jesse (7) and Anna (5).",
      "title": "",
      "updated_at": "2018-10-01T16:24+0000",
      "name": "Lisa Bradley",
      "conference": "DC80",
      "id": 30255
    },
    {
      "link": "",
      "twitter": "@RedHatCRob",
      "description": "Christopher Robinson (aka CRob) is the Manager of Red Hat Product Security Assurance Team. With 20 years of Enterprise-class engineering, operational and leadership experience, Chris has worked at several Fortune 500 companies with experience in the Financial, Medical, Legal, and Manufacturing verticals.  He is a contributor to the FIRST PSIRT Services Framework and other industry groups. CRob has been a featured speaker at Gartner’s Identity and Access Management Summit, RSA, Derbycon, the (ISC)2 World Congress, and was named a \"Top Presenter\" for the 2017 Red Hat Summit.  CRob is the former President of the Cleveland (ISC)2 Chapter, and is also a children's Cybersecurity Educator with the (ISC)2 Safe-and-Secure program.",
      "title": "",
      "updated_at": "2018-10-01T16:25+0000",
      "name": "CRob",
      "conference": "DC80",
      "id": 30256
    },
    {
      "link": "",
      "twitter": "@Op_Nomad",
      "description": "Dimitry Snezhkov, X-Force Red @IBM Corporation. Focused on offensive security testing, code hacking, and tool building.",
      "title": "",
      "updated_at": "2018-10-01T16:25+0000",
      "name": "Dimitry Snezhkov",
      "conference": "DC80",
      "id": 30257
    },
    {
      "link": "",
      "twitter": "@humanhacker",
      "description": "Christopher Hadnagy, is the founder and CEO of Social-Engineer, LLC. Chris possesses over 16 years experience as a practitioner and researcher in the security field. His efforts in training, education, and awareness have helped to expose social engineering as the top threat to the security of organizations today.Chris established the world’s first social engineering penetration testing framework at www.social- engineer.org, providing an invaluable repository of information for security professionals and enthusiasts. That site grew into a dynamic web resource including a podcast and newsletter, which have become staples in the security industry and are referenced by large organizations around the world. Chris also created the first hands-on social engineering training course and certification, Advanced Practical Social Engineering, attended by law enforcement, military, and private sector professionals.Chris is also the best-selling author of three books; Social Engineering: The Art of Human Hacking, Unmasking the Social Engineer: The Human Element of Security and Phishing Dark Waters: The Offensive and Defensive Sides of Malicious Emails.Chris specializes in understanding how malicious attackers exploit human communication and trust to obtain access to information and resources through manipulation and deceit. His goal is to secure companies by educating them on the methods used by attackers, identifying vulnerabilities, and mitigating issues through appropriate levels of awareness and security.",
      "title": "",
      "updated_at": "2018-10-01T16:25+0000",
      "name": "Christopher Hadnagy",
      "conference": "DC80",
      "id": 30258
    },
    {
      "link": "",
      "twitter": "@catmurd0ck",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:26+0000",
      "name": "Cat Murdock",
      "conference": "DC80",
      "id": 30259
    },
    {
      "link": "",
      "twitter": "@midnite_runr",
      "description": "Josh Pitts is a Staff Engineer at Okta with over 15 years’ experience conducting physical and IT security assessments, IT security operations support, penetration testing, malware analysis, reverse engineering and forensics. He also served in the Marines working in SIGINT during the last part of the 20th Century. He likes to write low level code and flip bits for fun. Sometimes this leads to the discovery of funny bugs and to Russians patching stuff over the Internet and code signing issues.",
      "title": "",
      "updated_at": "2018-10-01T16:26+0000",
      "name": "Josh Pitts",
      "conference": "DC80",
      "id": 30260
    },
    {
      "link": "",
      "twitter": "@SadProcessor",
      "description": "French guy living in the Netherlands. PowerShell Automation Engineer by day, n00bing around InfoSec by night. Like Lego Bricks, Tools-Tools-Tools, and PowerShell. Like to build things to challenge myself and learn new stuff. Spoke at BSides Amsterdam, PSConfAsia & PSConfEurope. Won the photoshop face-swap contest last year and thus needed to find another way to come to Derby this year.Really would love to get Iced... so made a really cool tool.",
      "title": "",
      "updated_at": "2018-10-01T16:26+0000",
      "name": "Walter Legowski",
      "conference": "DC80",
      "id": 30261
    },
    {
      "link": "",
      "twitter": "@winnschwartau",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:27+0000",
      "name": "Winn Schwartau",
      "conference": "DC80",
      "id": 30262
    },
    {
      "link": "",
      "twitter": "@oddvarmoe",
      "description": "Oddvar is a Cloud and Datacenter Management MVP, security researcher, blogger, trainer, penetration tester, speaker and he works at Advania Norway as a Chief Technical Architect. He has more than 17 years of experience in the IT industry. He is passionate about Windows Security and he loves to share his knowledge with everyone. Oddvar has delivered top-notch sessions in the past at conferences such as IT Dev Connections, HackCon, Nordic Infrastructure Conference and Paranoia. Oddvar loves to work with both offensive and defensive security.",
      "title": "",
      "updated_at": "2018-10-01T16:27+0000",
      "name": "Oddvar Moe",
      "conference": "DC80",
      "id": 30263
    },
    {
      "link": "",
      "twitter": "@PyroTek3",
      "description": "Sean Metcalf is founder and principal consultant at Trimarc (www.TrimarcSecurity.com) a professional services company which focuses on improving enterprise security. He is one of about 100 people in the world who holds the Microsoft Certified Master Directory Services (MCM) certification, is a former Microsoft MVP, and has presented on Active Directory attack and defense at Black Hat, BSides, DEF CON, DerbyCon, Microsoft BlueHat, Shakacon and Walmart Sp4rkCon security conferences. He currently provides security consulting services to customers and regularly posts interesting Active Directory security information on his blog, ADSecurity.org.",
      "title": "",
      "updated_at": "2018-10-01T16:27+0000",
      "name": "Sean Metcalf",
      "conference": "DC80",
      "id": 30264
    },
    {
      "link": "",
      "twitter": "@rrcyrus",
      "description": "Richie Cyrus is a Senior Threat Hunter at SpecterOps where he specializes in detection of advanced adversaries with a focus in MacOS and Linux environments. Richie has a background in incident response, forensics and security operations spanning across Fortune 500 companies and the public sector, to include Apple Inc. and CME Group Inc. He currently maintains a DFIR focused blog at https://securityneversleeps.net.",
      "title": "",
      "updated_at": "2018-10-01T16:27+0000",
      "name": "Richie Cyrus",
      "conference": "DC80",
      "id": 30265
    },
    {
      "link": "",
      "twitter": "@axsdnied",
      "description": "Vishal Chauhan is a Security Engineering Lead in Microsoft Security Response Center (MSRC) team. His background includes deep kernel security expertise and has driven and developed multiple security mitigation approaches in Windows kernel space, including but not limited to Win32k security.",
      "title": "",
      "updated_at": "2018-10-01T16:28+0000",
      "name": "Vishal Chauhan",
      "conference": "DC80",
      "id": 30266
    },
    {
      "link": "",
      "twitter": "@securityweekly",
      "description": "Paul Asadoorian is the founder and CEO of Security Weekly, a security podcast network providing free security information to the community and security market validation to a wide array of security companies. Paul is the primary host to several shows, including Paul’s Security Weekly, Enterprise Security Weekly, providing the security community with valuable knowledge. Paul is also a founding member of Active Countermeasures, a startup dedicated to providing reliable sources of actionable intelligence. Previously Paul has held positions at Tenable Network Security, penetration testing firms, university and other industries. Paul is an IANS faculty member and has presented at various security conferences including RSA, Derbycon, Brucon, SOURCE Conference and more. Paul loves Kung Fu movies, hacking, listening to old school rap and is currently training hard for being iced at Derbycon.",
      "title": "",
      "updated_at": "2018-10-01T16:28+0000",
      "name": "Paul Asadoorian",
      "conference": "DC80",
      "id": 30267
    },
    {
      "link": "",
      "twitter": "@zerosum0x0",
      "description": "zerosum0x0 is the author of all MS17-010 ETERNAL Metasploit exploit modules and was the first to reverse engineer the DOUBLEPULSAR backdoor. He has taught workshops on Windows internals at DEF CON and to US government agencies.",
      "title": "",
      "updated_at": "2018-10-01T16:28+0000",
      "name": "zerosum0x0",
      "conference": "DC80",
      "id": 30268
    },
    {
      "link": "",
      "twitter": "@0xsauby",
      "description": "Saurabh works at Spirent SecurityLabs as a Managing Security Consultant where he is primarily responsible for delivering penetration testing services to Spirent clients across the globe. During his industry experience of over 15+ years, Saurabh has worked across diversified industry verticals such as Banking, Aerospace, building solutions, Process & Control Systems and has developed expertise is various aspects of Information security. Saurabh specializes in web application & network security, with secret crush on binary reverse engineering. He has contributed towards proof-of-concept exploits and white papers in the infosec domain as well as delivered security trainings to various fortune 500 clients globally and at reputed security conferences such as CansecWest and Black Hat. Saurabh has presented his research at several security conferences including Derbycon, Toorcon, BSidesTO, Hack3rcon, Blackhat US & Europe Tools Arsenal, Blackhat Europe and is author of open-source tool, Yasuo (https://github.com/0xsauby/yasuo). ",
      "title": "",
      "updated_at": "2018-10-01T16:29+0000",
      "name": "Saurabh Harit",
      "conference": "DC80",
      "id": 30269
    },
    {
      "link": "",
      "twitter": "@r4ndom_handle",
      "description": "Nick is an offensive-security focused professional with 11+ years of technology experience who leads project teams and functional teams in the assessment of complex systems and business processes.  He has performed technical penetration tests and social engineering campaigns in a diverse set of industry verticals, organizational sizes, and regulatory environments.  His practice is informed by years of exposure to information technology infrastructure and years of close collaboration with application development teams.  As a Certified Information Systems Security Professional (CISSP) and GIAC Exploit Researcher and Advanced Penetration Tester (GXPN), Nick strives to advance the Information Security field by applying the latest in research and techniques to every project that he executes.",
      "title": "",
      "updated_at": "2018-10-01T16:29+0000",
      "name": "Nick Delewski",
      "conference": "DC80",
      "id": 30270
    },
    {
      "link": "",
      "twitter": "@BouncyHat",
      "description": "Michael Weber is a senior security consultant with NCC Group. Michael loves making .NET do things that no sane human would ever expect it to perform, running amok on red team engagements, and taking apart antivirus products. Prior to NCC Group, Michael worked as a malware reverse engineer where he learned that 4 byte XOR is the ultimate way to circumvent all signatures.",
      "title": "",
      "updated_at": "2018-10-01T16:30+0000",
      "name": "Michael Weber",
      "conference": "DC80",
      "id": 30271
    },
    {
      "link": "",
      "twitter": "@infosystir",
      "description": "Amanda co-authored the best practices book called \"Defensive Security Handbook: Best Practices for Securing Infrastructure” with Lee Brotherston through O'Reilly Media. She is a co-host on the Brakeing Down Security podcast and writes for several blogs. She has spent over a decade in different areas of technology and sectors providing infrastructure support, triage, and design. Amanda has been involved in implementing a secure Payment Card Industries (PCI) process and Health Insurance Portability and Accountability Act (HIPAA) compliance as well as building a comprehensive phishing and awards-based user education program. Amanda is an avid volunteer and has also presented at a large number of conventions, meetings and industry events. Some examples of these are: DerbyCon, O’Reilly Security, GrrCon, and DEFCON. While she doesn't have the credentials or notoriety that others might have, she hopes to make up for it with her wit, sense of humor, and knack for catching on quick to new technologies.",
      "title": "",
      "updated_at": "2018-10-01T16:30+0000",
      "name": "Amanda Berlin",
      "conference": "DC80",
      "id": 30272
    },
    {
      "link": "",
      "twitter": "@tifkin_",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:30+0000",
      "name": "Lee Christensen",
      "conference": "DC80",
      "id": 30273
    },
    {
      "link": "",
      "twitter": "@enigma0x3",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:31+0000",
      "name": "Matt Nelson",
      "conference": "DC80",
      "id": 30274
    },
    {
      "link": "",
      "twitter": "@harmj0y",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:31+0000",
      "name": "Will Schroeder",
      "conference": "DC80",
      "id": 30275
    },
    {
      "link": "",
      "twitter": "@HackerHurricane",
      "description": "Michael is a Malware Archaeologist, Blue Team defender, Incident Responder and logoholic.  Michael developed several Windows logging cheat sheets to help the security industry understand Windows logging, where to start and what to look for.  Michael is co-developer of LOG-MD, a free tool that audits the settings, harvests and reports on malicious Windows log data and malicious system artifacts.    Michael also blogs on HackerHurricane.com on various InfoSec topics.  Michael also is co-host of the “Brakeing Down Incident Response” BDIR Podcast to education on Incident Response daily tasks.  Michael also ran BSides Texas for five years for the Austin, San Antonio, Dallas and Houston cons.",
      "title": "",
      "updated_at": "2018-10-01T16:31+0000",
      "name": "Michael Gough",
      "conference": "DC80",
      "id": 30276
    },
    {
      "link": "",
      "twitter": "@leoloobeek",
      "description": "Leo Loobeek is a senior consultant with Protiviti performing offensive security operations ranging from textbook whitebox pentests to stealth and red team exercises. With plenty of areas within offensive security, Leo finds his niche in command-and-control, novel execution techniques, and safeguarding precious new droppers with keying techniques. Leo knows enough to know he doesn’t know anything.",
      "title": "",
      "updated_at": "2018-10-01T16:31+0000",
      "name": "Leo Loobeek",
      "conference": "DC80",
      "id": 30277
    },
    {
      "link": "",
      "twitter": "@joff_thyer",
      "description": "Joff has 22+ years of experience in the IT industry in roles such as enterprise network architect and network security defender. He has experience with intrusion detection and prevention systems, penetration testing, engineering network infrastructure defense, and software development. Joff co-hosts the Security Weekly podcast, and teaches SANS SEC573 - Automating Information Security with Python.",
      "title": "",
      "updated_at": "2018-10-01T16:32+0000",
      "name": "Joff Thyer",
      "conference": "DC80",
      "id": 30278
    },
    {
      "link": "",
      "twitter": "@0xderuke",
      "description": "Derek has over 20 years of experience in the IT industry as a systems administrator for multiple operating system platforms, and monitoring and defending those systems from potential intruders. He has worked in the aerospace, defense, banking, manufacturing, and software development industries. Derek has experience with creating custom host and network based monitoring solutions. Joff has 22+ years of experience in the IT industry in roles such as enterprise network architect and network security defender. He has experience with intrusion detection and prevention systems, penetration testing, engineering network infrastructure defense, and software development. Joff co-hosts the Security Weekly podcast, and teaches SANS SEC573 - Automating Information Security with Python.",
      "title": "",
      "updated_at": "2018-10-01T16:32+0000",
      "name": "Derek Banks",
      "conference": "DC80",
      "id": 30279
    },
    {
      "link": "",
      "twitter": "@aaroncampbell",
      "description": "Aaron is the WordPress Security Team lead, has been a regular contributor to WordPress for more than a decade, and is currently funded by GoDaddy to work full time on the WordPress open source project. He has over eighteen years of web development experience and worked with clients ranging from small local businesses to Google, Yahoo, Disney, and Harvard. He’s been called both a coffee snob and a beer snob, but considers both to be compliments. When not buried in code, he enjoys spending time with his wife and son, riding his motorcycle, and reading sci-fi/fantasy books.",
      "title": "",
      "updated_at": "2018-10-01T16:32+0000",
      "name": "Aaron D. Campbell",
      "conference": "DC80",
      "id": 30280
    },
    {
      "link": "",
      "twitter": "@0sm0s1z",
      "description": "Matthew Toussain is a penetration tester with Black Hills Information Security and an instructor for the SANS Institute. Matthew regularly hunts for vulnerabilities in computer systems and releases tools to demonstrate the effectiveness of attacks and countermeasures. He has been a guest speaker at many conference venues, including DEFCON. Matthew is an author of SEC460: Enterprise Threat and Vulnerability Assessment. After graduating from the U.S. Air Force Academy, where he architected and instructed the summer cyber course that now trains over 400 cadets per year, Matthew served as the Senior Cyber Tactics Development Lead for the U.S. Air Force. He directed the teams responsible for developing innovative tactics, techniques, and procedures for offensive operations as well as for cyber protection teams (CPT). Later, as a member of the 688th Cyber Warfare Wing he managed the Air Force's transition of all 18 CPTs to fully operational capability. He earned his master's degree in information security engineering as one of the first graduates of the SANS Technology Institute and supports many national and international cyber competitions including the CCDC, Netwars, and the National Security Agency's Cyber Defense Exercise as a red team member and instructor.",
      "title": "",
      "updated_at": "2018-10-01T16:33+0000",
      "name": "Matthew Toussain",
      "conference": "DC80",
      "id": 30281
    },
    {
      "link": "",
      "twitter": "@NancySnoke",
      "description": "Nancy and Phoenix Snoke have given joint talks at NOLACON, BSides and SkyDogCon. Phoenix would like to remain a mystery, and Nancy specializes on web and mobile application security. Her work experience includes senior software engineer responsible for web application security at PGAC, and a penetration tester for Cisco Systems. Nancy has previously spoken (solo) at Derbycon and NOLACON. She got her undergraduate degree in Computer Engineering in New Orleans at Tulane University, and her Masters in Computer Science at University of Illinois Urbana-Champaign.",
      "title": "",
      "updated_at": "2018-10-01T16:33+0000",
      "name": "Nancy Snoke",
      "conference": "DC80",
      "id": 30282
    },
    {
      "link": "",
      "twitter": "",
      "description": "",
      "title": "",
      "updated_at": "2018-10-01T16:33+0000",
      "name": "Phoenix Snoke",
      "conference": "DC80",
      "id": 30283
    },
    {
      "link": "",
      "twitter": "@3ncr1pt3d",
      "description": "Cheryl Biswas, aka @3ncr1pt3d, is a Strategic Threat Intel  Analyst with TD Bank in Toronto, Canada. Previously, she was a Cyber Security Consultant with KPMG and worked on security audits and assessment, privacy, breaches, and DRP. Her experience includes project management, vendor management and change management. Cheryl holds an ITIL certification and a degree in Political Science. Her areas of interest include APTs, mainframes, ransomware, ICS SCADA, and building threat intel. She actively shares her passion for security online, as a speaker and a volunteer at conferences, and by encouraging women and diversity in Infosec as a founder and member of the  \"The Diana Initiative\".",
      "title": "",
      "updated_at": "2018-10-01T16:34+0000",
      "name": "Cheryl Biswas",
      "conference": "DC80",
      "id": 30284
    },
    {
      "link": "",
      "twitter": "@byt3bl33d3r",
      "description": "Marcello Salvati (@byt3bl33d3r) is a security consultant at BlackHills Infosec by day and by night a tool developer who discovered a novel technique to turn tea, sushi and dank memes into somewhat functioning code. He's also really good at writing bios. I know, at this point you're probably asking yourself: \" Wait, how good of a bio writer is this guy? I need a quantifiable metric in order to come to a conclusion! The suspense is killing me!\". Well John Strand hired him so that he could continue to write them. Yeah... that's how good. Checkmate Atheists! *dab* *mic drop*",
      "title": "",
      "updated_at": "2018-10-01T16:34+0000",
      "name": "Marcello Salvati",
      "conference": "DC80",
      "id": 30285
    },
    {
      "link": "",
      "twitter": "",
      "description": "Mick Douglas has been doing information security work for over 10 years. He is the managing partner for InfoSec Innovations.  He is always excited for the opportunity to share with others so they do not have to learn the hard way! By attending his talks, security professionals of all abilities will gain useful tools and skills that should make their jobs easier. ",
      "title": "",
      "updated_at": "2018-10-01T16:35+0000",
      "name": "Mick Douglas",
      "conference": "DC80",
      "id": 30286
    },
    {
      "link": "",
      "twitter": "",
      "description": "Josh Johnson has been working in the Information Security industry for nearly 10 years in varying roles and with responsibilities ranging from penetration testing to incident response. He is passionate about using his knowledge of offensive security concepts and techniques to help organizations improve their defensive capabilities. He holds a Master of Science Degree in Information Security Engineering from the SANS Technology Institute, is a CISSP, and holds 8 GIAC certifications including the GSE. Josh's own experience with SANS training as a student drives him to share his passion and knowledge of information security with others.",
      "title": "",
      "updated_at": "2018-10-01T16:35+0000",
      "name": "Josh Johnson",
      "conference": "DC80",
      "id": 30287
    },
    {
      "link": "",
      "twitter": "@5twenty9",
      "description": "Founding team member, VP of Engineering and Chief Architect @ Carbon Black, contributor to ATT&CK framework and osquery, believer in open source security capabilities, and Windows Internals geek.",
      "title": "",
      "updated_at": "2018-10-01T16:35+0000",
      "name": "Scott Lundgren",
      "conference": "DC80",
      "id": 30288
    },
    {
      "link": "",
      "twitter": "@memnus",
      "description": "Brian has been a software engineer and vulnerability analyst in the Android Security Development Lifecycle group at Google since 2016. They review bugs and features and determine which ones are which.",
      "title": "",
      "updated_at": "2018-10-01T16:35+0000",
      "name": "Brian Claire Young",
      "conference": "DC80",
      "id": 30289
    },
    {
      "link": "",
      "twitter": "@EmilyShawgo",
      "description": "Emily has recently graduated from Carnegie Mellon University with a master's degree in Public Policy and Management with a concentration in Cybersecurity Management.  She also has an undergraduate degree in Psychology and Political Science from Carlow University.  Emily's interests lie in penetration testing, threat analysis, and applying the study of human behavior to the field of cybersecurity.",
      "title": "",
      "updated_at": "2018-10-01T16:36+0000",
      "name": "Emily Shawgo",
      "conference": "DC80",
      "id": 30290
    },
    {
      "link": "",
      "twitter": "@wvualphasoldier",
      "description": "Jonathan Nichols is an independent Security Contractor. He has played a role in predicting, detecting, and mitigating some of the largest hacking campaigns in recent years. As part of Operation Iraqi Freedom and Operation Enduring Freedom, Jon spent 10 years deployed with or working in support of US Psychological Operations (PSYOP) and NATO Special Operations. Merging the capabilities of PSYOP and Cyber, Jon has years of experience in building cyber security teams which focus on the humans behind the keyboards and the underlying influences which motivate their actions. He can be seen discussing cyber security topics on CNN and Vice documentaries, and regular contributes to many mainstream media articles on cyber security issues.",
      "title": "",
      "updated_at": "2018-10-01T16:36+0000",
      "name": "Jonathan Nichols",
      "conference": "DC80",
      "id": 30291
    },
    {
      "link": "",
      "twitter": "@l0stkn0wledge",
      "description": "One does not simply write a biography about l0stkn0wledge. He is a life-long hacker and twelve year information security professional who has his own twisted way to approach life's problems. From being a nervous know nothing at his first conference to a multi-time speaker who still knows mostly nothing, he has learned a lot and still has a lot more to discover.",
      "title": "",
      "updated_at": "2018-10-01T16:36+0000",
      "name": "Joey Maresca",
      "conference": "DC80",
      "id": 30292
    },
    {
      "link": "",
      "twitter": "@JdogHerman",
      "description": "Justin Herman, KD8ASA, is a lifetime learner, tinkerer, infosec nut, and self described \"breaker of things\". He is an organizer of BSidesCleveland, a board member of NEOISF - the Northeastern Ohio Information Security Forum.",
      "title": "",
      "updated_at": "2018-10-01T16:36+0000",
      "name": "Justin Herman",
      "conference": "DC80",
      "id": 30293
    },
    {
      "link": "",
      "twitter": "@4lex",
      "description": "Last year, during a 6 week hiatus while his bosses staged some Red Wedding shit with the company, he went heads down into OSCP, and CTFs for a year after that. He emerged having attained a long-held dream of belonging to the InfoSec community. Alex started out supporting tech as IT, building it as a SysAdmin, creating it as a Software Engineer, and now breaking it as a Red Teamer for WalMart.",
      "title": "",
      "updated_at": "2018-10-01T16:39+0000",
      "name": "Alex Flores",
      "conference": "DC80",
      "id": 30294
    },
    {
      "link": "",
      "twitter": "@caleb_madrigal",
      "description": "Caleb Madrigal is a programmer who enjoys hacking and mathing. He is currently working as an applied security researcher/senior software engineer at Mandiant/FireEye. Most of his recent work has been in Python, Jupyter, Javascript, and C. Caleb has been into security for a while... in high school, he wrote his own (bad) cryptography and steganography software. In college, he did a good bit of \"informal pen testing\". Recently, Caleb has been finding \"evil\" on the endpoint with Machine Learning (and other things) and hacking various wireless devices (including many IoT devices) with SDR, WiFi, packet crafting, etc.",
      "title": "",
      "updated_at": "2018-10-01T16:39+0000",
      "name": "Caleb Madrigal",
      "conference": "DC80",
      "id": 30295
    },
    {
      "link": "",
      "twitter": "@chriselgee",
      "description": "Chris is a full time husband, father of four, and pen tester; he's a part time Army officer, an aspiring SANS instructor, and the back-up church bass player. He is active in (ISC)2 and has brought online safety presentations to dozens of Maine schools. CISSP, OSCP, GPEN, GWAPT.",
      "title": "",
      "updated_at": "2018-10-01T16:39+0000",
      "name": "Chris Elgee",
      "conference": "DC80",
      "id": 30296
    },
    {
      "link": "",
      "twitter": "@xoreaxeaxeax",
      "description": "Stephanie Domas has been doing x86 security research for a decade. She is Vice President of Research and Development at MedSec, where they perform a plethora of security services for medical devices.  Christopher Domas \"@xoreaxeaxeax\" is a cyber security researcher, currently investigating low level processor exploitation. He is best known for releasing impractical solutions to non-existent problems, including the world's first single instruction C compiler (M/o/Vfuscator), toolchains for generating images in program control flow graphs (REpsych), and Turing-machines in the vi text editor. His more relevant work includes the binary visualization tool ..cantor.dust.. and the memory sinkhole x86 privilege escalation exploit.",
      "title": "",
      "updated_at": "2018-10-01T16:40+0000",
      "name": "DazzleCatDuo",
      "conference": "DC80",
      "id": 30297
    },
    {
      "link": "",
      "twitter": "@securitybrew",
      "description": "Kate Brew has over 15 years experience in product management and marketing, primarily in information security. She's been editor of AlienVault's blog for over four years.",
      "title": "",
      "updated_at": "2018-10-01T16:46+0000",
      "name": "Kate Brew",
      "conference": "DC80",
      "id": 30298
    },
    {
      "link": "",
      "twitter": "@SoyaAoyama",
      "description": "Soya Aoyama is security researcher at Fujitsu System Integration Laboratories Limited. Soya has been working for Fujitsu more than 20 years as software developer of Windows, and had been writing NDIS drivers, Bluetooth profiles, Winsock application, and more, and started security research about 3 years ago.Soya has gave presentation in AVTOKYO 2016 and BSides Las Vegas 2017 in the past.",
      "title": "",
      "updated_at": "2018-10-01T16:47+0000",
      "name": "Soya Aoyama",
      "conference": "DC80",
      "id": 30299
    },
    {
      "link": "",
      "twitter": "@r4wd3r",
      "description": "Sebastián Castro (@r4wd3r) is the R&D Leader at CSL Labs. Born in Bogotá, Colombia, has been an information security researcher, network & application pentester and red-teamer for 6 years, providing cybersecurity services to global financial institutions and local defense government organizations. This guy has presented at national and international conferences, such as BSides, ISC² and recently Black Hat, exposing password cracking and Windows security own research. Sometimes a tenor, sometimes a hacker, Sebastián also works as an opera singer at the Opera of Colombia Chorus, participating on many national and international fancy performances with well-known singers whose names he can’t even spell.",
      "title": "",
      "updated_at": "2018-10-01T16:47+0000",
      "name": "Sebastián Castro",
      "conference": "DC80",
      "id": 30300
    },
    {
      "link": "",
      "twitter": "",
      "description": "Ryan O’Grady has worked in cyber security for over 10 years and is a research scientist in Soar Technology’s Cyberspace Operations business area. He is the principal investigator for a project to develop an intelligent training system for cyberspace operators that enables individualized, personalized training in realistic environments. He has a BSE in Computer Science from the University of Michigan and is currently pursuing a MS in Information Security Engineering from SANS Technology Institute",
      "title": "",
      "updated_at": "2018-10-01T16:47+0000",
      "name": "Ryan J. O'Grady",
      "conference": "DC80",
      "id": 30301
    },
    {
      "link": "",
      "twitter": "",
      "description": "Kevin is a Senior Manager, Penetration Testing Lead with Sikich focusing on information security and compliance issues faced by organizations of all types and sizes. Prior to joining Sikich, Kevin spent 12 years as a Vice President of a multi-billion-dollar financial group, leading the bank’s security and IT risk management activities. Kevin is the creator of the MiniPwner, a pocket-size penetration testing device used to gain remote access to a network, and enjoys building tools and toys from Arduino and other embedded systems. He’s also an author, instructor and a speaker at conferences like RSA, DerbyCon, Security BSides and WACCI. ",
      "title": "",
      "updated_at": "2018-10-01T16:48+0000",
      "name": "Kevin Bong",
      "conference": "DC80",
      "id": 30302
    },
    {
      "link": "",
      "twitter": "@michael_vieau",
      "description": "Michael is a Managing Consultant and Penetration Tester at Sikich LLP with over 17 years of experience in information security. Michael currently maintains the MiniPwner project and works with Kevin to build and modify electronics at The Mayhem Lab. When not performing penetration tests, Michael is an adjunct professor at MSOE and enjoys presenting at different security conferences.",
      "title": "",
      "updated_at": "2018-10-01T16:49+0000",
      "name": "Michael Vieau",
      "conference": "DC80",
      "id": 30303
    },
    {
      "link": "",
      "twitter": "@elitest",
      "description": "Jim Shaver is a penetration tester and security researcher.",
      "title": "",
      "updated_at": "2018-10-01T16:49+0000",
      "name": "Jim Shaver",
      "conference": "DC80",
      "id": 30304
    },
    {
      "link": "",
      "twitter": "@percent_x",
      "description": "Deral Heiland CISSP, serves as a Research Lead (IoT) for Rapid7. Deral has over 20 years of experience in the Information Technology field, and over the last 10+ years Deral’s career has focused on security research, security assessments, penetration testing, and consulting for corporations and government agencies. Deral also has conducted security research on numerous technical subjects, releasing white papers, security advisories, and has presented the information at numerous national and international security conferences including Blackhat, Defcon, Shmoocon, DerbyCon, RSAC, Hack In Paris.",
      "title": "",
      "updated_at": "2018-10-01T16:49+0000",
      "name": "Deral Heiland",
      "conference": "DC80",
      "id": 30305
    },
    {
      "link": "",
      "twitter": "@OrOneEqualsOne",
      "description": "Carrie Roberts - Carrie is a developer turned Red Team. She became interested in Info Sec after doing PC, mobile and web app development. She obtained her Masters in Info Sec Engineering from the SANS Technology Institute in 2015 and holds 11 GIAC certifications including the GSE. She is currently a Senior Red Team Engineer at Walmart and loves to give back to the Info Sec community. ",
      "title": "",
      "updated_at": "2018-10-01T16:50+0000",
      "name": "Carrie Roberts",
      "conference": "DC80",
      "id": 30306
    },
    {
      "link": "",
      "twitter": "@bigmacjpg",
      "description": "Kirk Sayre is a member of the Dynamic Defense Engineering team at Walmart. One of Kirk's focuses at Walmart has been on the detection and analysis of malicious Office documents. Kirk is one of the primary maintainers of ViperMonkey (https://github.com/decalage2/ViperMonkey), a VBA macro emulator utility. Prior to working for the cybersecurity group at Walmart, Kirk Sayre performed cybersecurity research at Oak Ridge National Lab (ORNL).  While at ORNL Kirk was one of the primary developers of a tool for automating the reverse engineering of malware. Kirk is the author of several patents based on this work. Outside of cybersecurity, Kirk has also worked on projects ranging from weapons control systems, medical devices, web applications, corporate software engineering training, and software design tools. Kirk’s educational background includes a PhD in Computer Science from the University of Tennessee where his research centered around using statistical methods to improve the testing of software. ",
      "title": "",
      "updated_at": "2018-10-01T16:50+0000",
      "name": "Kirk Sayre",
      "conference": "DC80",
      "id": 30307
    },
    {
      "link": "",
      "twitter": "@haroldogden ",
      "description": "Harold Ogden is a member of the Dynamic Defense Engineering team at the Walmart Security Operations Center. He researches malicious documents and observable system behaviors related to common adversary tactics. He writes rules for various file and traffic inspection products, and implements processes to monitor and triage suspected compromise at enterprise scale.",
      "title": "",
      "updated_at": "2018-10-01T16:51+0000",
      "name": "Harold Ogden ",
      "conference": "DC80",
      "id": 30308
    },
    {
      "link": "",
      "twitter": "@kevvyg",
      "description": "Kevin is a security architect/manager and part time packet mangler. He has nearly 20 years of experience in both the offensive and defensive sides of information security, and has done work for a number of organizations across the technology, healthcare, finance, and retail sectors.",
      "title": "",
      "updated_at": "2018-10-01T16:56+0000",
      "name": "Kevin Gennuso",
      "conference": "DC80",
      "id": 30309
    },
    {
      "link": "",
      "twitter": "@hardwaterhacker",
      "description": "Mike's love of IT started in the third grade when he discovered he could view the code of BASIC programs on an Apple ][e.  He has held many information technology and IT security positions, including developer, network and system administrator, security architect and security incident handler.  Currently, Mike is a principal consultant with Red Siege.  When he is not at work, he is an avid ice fishing and kayak fisherman and member of a local horn rock band.",
      "title": "",
      "updated_at": "2018-10-01T16:57+0000",
      "name": "Mike Saunders",
      "conference": "DC80",
      "id": 30310
    },
    {
      "link": "",
      "twitter": "@dacoursey",
      "description": "David is a family man that takes time out for Xbox, woodworking, and good whiskey. He forgets things due to years of rugby but is old enough to appreciate keeping notes in a paper notebook. After high school, Army service, and dropping out of college, David got a job as a web developer. Since then, his work has taken him through positions in the DoD, IC, USSOCOM, the VA, and now as an Application Pentester. David enjoys dissecting software and helping developers better understand how to create resilient applications. You can find him speaking at conferences or rambling about meaningless junk on Twitter.",
      "title": "",
      "updated_at": "2018-10-01T16:57+0000",
      "name": "David Coursey",
      "conference": "DC80",
      "id": 30311
    },
    {
      "link": "",
      "twitter": "@milhous30",
      "description": "Dr. Matthew has taught Computer Science and assembly and reverse engineering for 6 years at the collegiate level.  He has been called as an expert witness on more that a dozen Federal Cases, where he had to reverse engineer the NIT code provided by the government.  His expert declarations have been used by the ACLU in their \"Challenging government hacking in criminal cases\" guide for attorneys and by lawyers in federal cases.",
      "title": "",
      "updated_at": "2018-10-01T16:58+0000",
      "name": "Dr. Matthew Miller",
      "conference": "DC80",
      "id": 30312
    },
    {
      "link": "",
      "twitter": "@danielhbohannon",
      "description": "Daniel Bohannon (@danielhbohannon) is a Senior Applied Security Researcher with FireEye’s Advanced Practices Team with over seven years of operations, security and Incident Response consulting experience. He is the author of Invoke-Obfuscation, Invoke-CradleCrafter, Invoke-DOSfuscation and co-author of the Revoke-Obfuscation detection framework. He has presented at numerous conferences including Black Hat USA, Black Hat Asia, DEF CON, BlueHat, and an up-and-coming con known on the street as DerbyCon. Mr. Bohannon received a Master of Science in Information Security from the Georgia Institute of Technology (2013) and a Bachelor of Science in Computer Science from The University of Georgia (2010). His primary research areas include obfuscation, evasion and methodology-based detection techniques for endpoint and network applied at scale.",
      "title": "",
      "updated_at": "2018-10-01T16:58+0000",
      "name": "Daniel Bohannon",
      "conference": "DC80",
      "id": 30313
    },
    {
      "link": "",
      "twitter": "@arianevans",
      "description": "Arian is an 18+ year Infosec veteran who has worked as a Builder, Breaker, and Defender. He has built both enterprise financial and security software, and helped catch bad guys. He is fairly certain the majority of his success is due to luck - and the privilege of being surrounded by really smart people. Arian has pontificated in books and papers on software security and breaking software, and blathered at conferences around the world on techniques & technologies for both Red and Blue Teams. He also pads his presentations with bad jokes. Early employee of FishNet, WhiteHat, RiskIQ; also worked at several #Fintech companies you’ve never heard of, and taught my wife to phish kidnappers.",
      "title": "",
      "updated_at": "2018-10-01T16:59+0000",
      "name": "Arian Evans",
      "conference": "DC80",
      "id": 30314
    },
    {
      "link": "",
      "twitter": "@curi0usJack",
      "description": "With over 10 years of industry experience, Jason Lang (@curi0usJack) has worked in both offensive and defensive roles. Before switching to red teaming, he spent 8 years working as a technical Security Architect for a Fortune 500, specializing in Active Directory and .Net/database development. ",
      "title": "",
      "updated_at": "2018-10-01T17:01+0000",
      "name": "Jason Lang",
      "conference": "DC80",
      "id": 30315
    },
    {
      "link": "",
      "twitter": "@Contra_BlueTeam",
      "description": "Stuart has over 15 years in IT and Security. A recovering Security Architecture manager turned frontline blue teamer, he strives to stop threats using every tactic in the playbook and making a few new ones.",
      "title": "",
      "updated_at": "2018-10-01T17:01+0000",
      "name": "Stuart McIntosh",
      "conference": "DC80",
      "id": 30316
    },
    {
      "link": "",
      "twitter": "@bones_codes",
      "description": "Cara Marie: Cara has been traveling the world breaking networks, applications, and protocols professionally for over 5 years. Currently, she is a Security Engineer at Datadog working on building out their offensive security. When she isn’t breaking networks, building bombs (https://bomb.codes), or giving talks, she can be found baking ugly pies and killing zombies.",
      "title": "",
      "updated_at": "2018-10-01T17:07+0000",
      "name": "Cara Marie",
      "conference": "DC80",
      "id": 30317
    },
    {
      "link": "",
      "twitter": "@integgroll",
      "description": "Andy Cooper: Andy Cooper is a pentesting consultant turned blue team try-hard. Currently he works for Datadog as a Security Engineer working with AWS security primarily. If he isn’t working he is often found in his Dallas home electrocuting himself on accident or building cool things with high voltage.",
      "title": "",
      "updated_at": "2018-10-01T17:07+0000",
      "name": "Andy Cooper",
      "conference": "DC80",
      "id": 30318
    },
    {
      "link": "",
      "twitter": "@chrissistrunk",
      "description": "Chris is an electrical engineer who is fluent in RS-232 and Kirchhoff’s Laws. You can thank Stuxnet (drink!) for bringing him here. Squirrels are his arch nemesis and he hates FUD. His sock game is strong. ",
      "title": "",
      "updated_at": "2018-10-01T17:09+0000",
      "name": "Chris Sistrunk",
      "conference": "DC80",
      "id": 30319
    },
    {
      "link": "",
      "twitter": "@krypt3ia",
      "description": "Krypt3ia has been in INFOSEC since the 90’s working for fortune 500 companies in pentesting and now blue team DFIR. An infamous curmudgeon, Krypt3ia has a blog featuring national security issues and OSINT. He also co hosted Cloak & Swagger a podcast on all things natsec and INFOSEC with a Sasquatch named Ali. ",
      "title": "",
      "updated_at": "2018-10-01T17:11+0000",
      "name": "Krypt3ia",
      "conference": "DC80",
      "id": 30320
    },
    {
      "link": "",
      "twitter": "@IanColdwater",
      "description": "Ian Coldwater is a DevSecOps engineer who spends her days hacking and hardening cloud native infrastructure. In her spare time, she likes to go on cross-country road trips, capture flags and eat a lot of pie. She lives in Minneapolis and tweets at @IanColdwater.",
      "title": "",
      "updated_at": "2018-10-01T17:12+0000",
      "name": "Ian Coldwater",
      "conference": "DC80",
      "id": 30321
    },
    {
      "link": "",
      "twitter": "@flkapaket",
      "description": "Jon is the Founder and Principle Consultant of Fundamental Security, a small consulting firm focused on penetration testing, incident response, and strategic security consulting. He started working with technology in High School as a student of the Cisco Networking Academy, and has focused on Information Security since 2006. He has performed security engineering, security architecture, incident response, and penetration testing in the government, retail, insurance, and financial sectors.  He has managed a team of Penetration Testers at a Fortune 500 financial institution, and served as a Security Architect and Penetration Tester for an international Fortune 500 retailer. Jon also travels the country as an instructor for the SANS Institute.  Currently, he teaches two of SANS’s seminal courses, SEC504: Hacker Tools, Techniques, Exploits, and Incident Handling and SEC560: Network Penetration Testing and Ethical Hacking. He is proud to have served in the Army Reserve for 11 years, where he became a Warrant Officer and served one tour in Afghanistan.  He currently maintains the GCIH, GPEN, GAWN, GMOB, CISSP, and Security+ certifications.",
      "title": "",
      "updated_at": "2018-10-01T17:13+0000",
      "name": "Jon Gorenflo",
      "conference": "DC80",
      "id": 30322
    },
    {
      "link": "",
      "twitter": "@C_3PJoe",
      "description": "Joe Gray joined the U.S. Navy directly out of High School and served for 7 years as a Submarine Navigation Electronics Technician. Joe is currently a Senior Security Architect and maintains his own blog and podcast called Advanced Persistent Security. In his spare time, Joe enjoys attending information security conferences, contributing blogs to various outlets, training in Brazilian Jiu Jitsu (spoken taps out A LOT!), and flying his drone. Joe is the inaugural winner of the DerbyCon Social Engineering Capture the Flag (SECTF) and was awarded a DerbyCon Black Badge. Joe has contributed material for the likes of AlienVault, ITSP Magazine, CSO Online, and Dark Reading.",
      "title": "",
      "updated_at": "2018-10-01T17:13+0000",
      "name": "Joe Gray",
      "conference": "DC80",
      "id": 30323
    },
    {
      "link": "",
      "twitter": "@fir3d0g",
      "description": "David Boyd (@fir3d0g) is a security analyst for a security company in Knoxville, TN. He is a Christian, husband, and father that also enjoys geek culture, video games and Mountain Dew. He has over 15 years of technical experience in several environments including education, military, retail, government, media, law firms, and hospitals learning something from each one along the way. He also once found Waldo and Carmen Sandiego.",
      "title": "",
      "updated_at": "2018-10-01T17:14+0000",
      "name": "David Boyd",
      "conference": "DC80",
      "id": 30324
    },
    {
      "link": "",
      "twitter": "@kungfujo",
      "description": "Benny Karnes is the most vocal member of the 304 Geeks (He talks a lot), As our resident CTF Geek Benny builds and runs the servers for Hack3rcon. ",
      "title": "",
      "updated_at": "2018-10-01T17:14+0000",
      "name": "Benny Karnes",
      "conference": "DC80",
      "id": 30325
    },
    {
      "link": "",
      "twitter": "@mournewind",
      "description": "John Moore is a Crypto and Cypher expert, He also prints the programs for Hack3rcon. ",
      "title": "",
      "updated_at": "2018-10-01T17:14+0000",
      "name": "John Moore",
      "conference": "DC80",
      "id": 30326
    },
    {
      "link": "",
      "twitter": "@ragingotaku",
      "description": "Rick Hayes is the most well-armed of the 304 Geeks, because, well yeah because.",
      "title": "",
      "updated_at": "2018-10-01T17:15+0000",
      "name": "Rick Hayes",
      "conference": "DC80",
      "id": 30327
    },
    {
      "link": "",
      "twitter": "@sirgurdWV",
      "description": "Matt Perry is the Designated Adult of the 304 Geeks and the resident Social Engineer that talks everyone else into doing his work. ",
      "title": "",
      "updated_at": "2018-10-01T17:15+0000",
      "name": "Matt Perry",
      "conference": "DC80",
      "id": 30328
    },
    {
      "link": "",
      "twitter": "@oncee",
      "description": "Professor Bill Gardner is in charge of all things Cyber. ",
      "title": "",
      "updated_at": "2018-10-01T17:23+0000",
      "name": "Bill Gardner",
      "conference": "DC80",
      "id": 30329
    },
    {
      "link": "",
      "twitter": "@CptSexy",
      "description": "Justin Rogosky is a Gemini and likes holding hand on long walks on nude beaches (Hey that is not my hand). ",
      "title": "",
      "updated_at": "2018-10-01T17:23+0000",
      "name": "Justin Rogosky",
      "conference": "DC80",
      "id": 30330
    },
    {
      "link": "",
      "twitter": "@MichaelDFry",
      "description": "Mike Fry is the 304 Geeks resident web master and in charge of all the stuff the rest of us got tired of doing.",
      "title": "",
      "updated_at": "2018-10-01T17:24+0000",
      "name": "Mike Fry",
      "conference": "DC80",
      "id": 30331
    },
    {
      "link": "",
      "twitter": "@steventruax",
      "description": "Steve Truax is the newest member of the board and is in charge of bringing the donuts.",
      "title": "",
      "updated_at": "2018-10-01T17:24+0000",
      "name": "Steve Truax",
      "conference": "DC80",
      "id": 30332
    },
    {
      "link": "",
      "twitter": "",
      "description": "John Askew is a founder and principal of Graywolf and a native of Kentucky. After 12 years in infosec, he has probably spent too much time breaking things and not enough fixing them.",
      "title": "",
      "updated_at": "2018-10-01T17:24+0000",
      "name": "John Askew",
      "conference": "DC80",
      "id": 30333
    },
    {
      "link": "",
      "twitter": "",
      "description": "Hayden Parker is a security engineer at Coinbase, working on detection and response tooling.  He has been part of Coinbase for over three years and enjoys almost any project that has to do with networking or golang.  Outside of work Hayden enjoys spending his time as far away from computers as possible.",
      "title": "",
      "updated_at": "2018-10-01T17:24+0000",
      "name": "Hayden Parker",
      "conference": "DC80",
      "id": 30334
    },
    {
      "link": "",
      "twitter": "@JParkerGarrison",
      "description": "Parker enjoys the challenge of subverting the intended functionality of systems and is an active participant in CTF Competitions.  At the most recent RSA Conference he attended in 2017, he took 1st place in both the SANS NetWars Tournament and SANS One-Hour CTF competitions. He is also a GIAC certified Exploit Researcher and Advanced Penetration Tester (GXPN).Parker currently works as an consulting contractor, performing network penetration testing and social engineering. He is an experienced communicator with the Toastmasters Advanced Communicator Gold (ACG) certification, and has developed and led training programs for teams in cyber defense and CTF competitions.",
      "title": "",
      "updated_at": "2018-10-01T17:25+0000",
      "name": "Parker Garrison",
      "conference": "DC80",
      "id": 30335
    },
    {
      "link": "",
      "twitter": "@lelandneely",
      "description": "Lee Neely is a senior IT and security professional at Lawrence Livermore National Laboratory with over 25 years of extensive experience with a wide variety of technology and applications from point implementations to enterprise solutions. He currently leads LLNL’s Entrust team and is the CSP lead for new technology adoption specializing in mobility. He teaches cyber security courses, and holds several security certifications including GMOB, GPEN, GWAPT, GAWN, CISSP, CISA, CISM and CRISC. He is also the President of the ISC2 Eastbay Chapter. ",
      "title": "",
      "updated_at": "2018-10-01T17:25+0000",
      "name": "Lee Neely",
      "conference": "DC80",
      "id": 30336
    },
    {
      "link": "",
      "twitter": "",
      "description": "Chelle Clements has been associated with computer science and cyber security for over 20 years. She has an AAS in Environmental Science from Northern Virginia Community College, and a BS and an MS in Information Systems Management from University of San Francisco. She is an Army Veteran, one of the first women in the Corps of Engineers (she has some great stories!). She spent 30-years at Lawrence Livermore National Lab as a researcher in three different fields (chemistry, physics and computer science) and also as a community outreach volunteer. She currently supports several Veteran causes with pro bono web development (such as East Bay Stand Down) and served on her city’s art commission.",
      "title": "",
      "updated_at": "2018-10-01T17:26+0000",
      "name": "Chelle Clements",
      "conference": "DC80",
      "id": 30337
    },
    {
      "link": "",
      "twitter": "@jmcmurry",
      "description": "Jim McMurry is an accomplished Technologist with an entrepreneurial mindset with over 23 years of combined experience in Security, Information Technology, Telecommunication, Networking, Management and Software development. Jim's varied experience in network security, military projects, IT and high-tech arenas, with startups through Fortune 1000 companies, provides him with a unique set of tools as he grows Milton Security. He volunteers for numerous charities, and supports Veterans through the Milton Veteran Hiring program. ",
      "title": "",
      "updated_at": "2018-10-01T17:26+0000",
      "name": "James McMurry",
      "conference": "DC80",
      "id": 30338
    },
    {
      "link": "",
      "twitter": "@r3doubt",
      "description": "Brian Satira is an information security researcher with ten years of experience including forensic investigations and vulnerability analysis on various Industrial Control Systems(ICS).  Brian is a member of the I Am The Cavalry project and NoVA Hackers.  Brian is  also a graduate of the University of Pittsburgh and a U.S. Army veteran.  Offline, Brian enjoys locksport and is both a registered locksmith in Virginia and a co-founding member of his local TOOOL chapter. ",
      "title": "",
      "updated_at": "2018-10-01T17:28+0000",
      "name": "Brian Satira",
      "conference": "DC80",
      "id": 30339
    },
    {
      "link": "",
      "twitter": "",
      "description": "Brian Olson is a Security Engineer for CORESCOUT, a tech company focused on big data and network security. A graduate of UMBC with experience in research, pen testing, and systems administration, Brian now works in the DC area focusing on security engineering and threat emulation designing systems with a defensive mindset. When not behind the keyboard Brian enjoys meteorology and sailing; utilizing his skills for navigation/weather routing and tactics for both regattas and deliveries.",
      "title": "",
      "updated_at": "2018-10-01T17:28+0000",
      "name": "Brian Olson",
      "conference": "DC80",
      "id": 30340
    },
    {
      "link": "",
      "twitter": "@jedge_com",
      "description": "James Edge is an experienced information security professional as a consultant for state and local governments, education, financial services, and retail industries. He has an alphabet soup of certification credentials in information technology, information security, and audit. He is active member for the local chapters of ISACA wherever he happens to reside, has provided support for the Southeastern Collegiate Cyber Defense Challenge (CCDC), and has spoken at various security conferences run by universities, BSides, SkyTalks, and ISACA.",
      "title": "",
      "updated_at": "2018-10-01T17:29+0000",
      "name": "James Edge",
      "conference": "DC80",
      "id": 30341
    },
    {
      "link": "",
      "twitter": "@jack_mannino",
      "description": "Jack Mannino is the CEO of nVisium. Passionate about security and impossible to keep away from a keyboard, his expertise spans over 15 years of building, breaking, and securing software. Jack founded nVisium in 2009, and since then has helped the world's largest software teams enhance security across their software portfolios. He has spoken at conferences globally on topics such as secure design, mobile application security, and cloud-native security.",
      "title": "",
      "updated_at": "2018-10-01T17:29+0000",
      "name": "Jack Mannino",
      "conference": "DC80",
      "id": 30342
    },
    {
      "link": "",
      "twitter": "@busterbcook",
      "description": "We are a few of the many people who make Metasploit awesome. Brent Cook heads up Metasploit’s engineering team at Rapid7, Aaron Soto and Adam Cammack are two of the team’s core developers, and Cody Pierce is the Metasploit product manager. We are all staunch open-source security advocates, contributors, and community members.",
      "title": "",
      "updated_at": "2018-10-01T17:31+0000",
      "name": "Brent Cook",
      "conference": "DC80",
      "id": 30343
    },
    {
      "link": "",
      "twitter": "@_surefire_",
      "description": "We are a few of the many people who make Metasploit awesome. Brent Cook heads up Metasploit’s engineering team at Rapid7, Aaron Soto and Adam Cammack are two of the team’s core developers, and Cody Pierce is the Metasploit product manager. We are all staunch open-source security advocates, contributors, and community members.",
      "title": "",
      "updated_at": "2018-10-01T17:33+0000",
      "name": "Aaron Soto",
      "conference": "DC80",
      "id": 30344
    },
    {
      "link": "",
      "twitter": "",
      "description": "We are a few of the many people who make Metasploit awesome. Brent Cook heads up Metasploit’s engineering team at Rapid7, Aaron Soto and Adam Cammack are two of the team’s core developers, and Cody Pierce is the Metasploit product manager. We are all staunch open-source security advocates, contributors, and community members.",
      "title": "",
      "updated_at": "2018-10-01T17:34+0000",
      "name": "Adam Cammack",
      "conference": "DC80",
      "id": 30345
    },
    {
      "link": "",
      "twitter": "@codypierce",
      "description": "We are a few of the many people who make Metasploit awesome. Brent Cook heads up Metasploit’s engineering team at Rapid7, Aaron Soto and Adam Cammack are two of the team’s core developers, and Cody Pierce is the Metasploit product manager. We are all staunch open-source security advocates, contributors, and community members.",
      "title": "",
      "updated_at": "2018-10-01T17:34+0000",
      "name": "Cody Pierce",
      "conference": "DC80",
      "id": 30346
    },
    {
      "link": "",
      "twitter": "@h4wkst3r",
      "description": "Brett has been in Information Security for several years in the private sector working for multiple Fortune 500 companies across different industries. He has focused on both offensive and defensive disciplines, with more of a focus on the offensive side recently. He holds several industry recognized certifications from SANS and Offensive Security, and has spoken at BSides Cleveland previously. His extensive knowledge and experience in a breadth of different areas in Information Security give him a unique and well-rounded perspective. When not at his day job, he enjoys doing security research, programming, and playing sports and video games.",
      "title": "",
      "updated_at": "2018-10-01T17:35+0000",
      "name": "Brett Hawkins",
      "conference": "DC80",
      "id": 30347
    },
    {
      "link": "",
      "twitter": "@YesItsKathleen",
      "description": "Kathleen Smith (moderator) in her capacity as CMO and Outreach Lead for CyberSecJobs.Com and ClearedJobs.Net has coached thousands of job seekers and employers on how to better connect and work together to achieve the mutual goal of employment. Kathleen presents at several security conferences each year on recruiting and job search. Some of the conferences she has presented at as a sole presenter or a moderator include BSidesLV, BSidesTampa, BSidesDE, FedCyber, Cyber912 and CyberSecureGov. Kathleen firmly believes that giving back is the best way to move forward and volunteers in many capacities; she is the Director, HireGround, BSidesLV’s two day career track; Women in Cybersecurity, National Conference Planning Committee, Cyber912 and Women in Cybersecurity Celebration Planning Committee. Finally, Kathleen is well respected within the recruiting community; is the co-founder and current President of recruitDC, the largest community of recruiters in the Washington DC area. ",
      "title": "",
      "updated_at": "2018-10-01T17:35+0000",
      "name": "Kathleen Smith",
      "conference": "DC80",
      "id": 30348
    },
    {
      "link": "",
      "twitter": "@SinderzNAshes",
      "description": "Cindy Jones brings over 17 years of specialized IT and security experience to her role of Senior Security Consultant with Rapid7. Cindy maintains a CISSP and MCP certifications. She has worked in several arenas including Federal government, with the Department of Defense, education, technology and healthcare, with a focus on the development, maintenance and management of information security programs. Cindy is actively involved within the information security community and volunteers her time leading the registration team for BSides Las Vegas, volunteers for DerbyCon, is a Def Con Goon and holds a position on the board for BSides Texas and is an active volunteer for these local events. Cindy’s favorite color is purple. ",
      "title": "",
      "updated_at": "2018-10-01T17:36+0000",
      "name": "Cindy Jones",
      "conference": "DC80",
      "id": 30349
    },
    {
      "link": "",
      "twitter": "@infosec_tottie",
      "description": "Magen Wu is a Senior Associate with Urbane Security  with almost 10 years of experience in the technology industry. Wu is currently pursuing her master’s in Organizational Psychology with the intent to apply its principles to security practices and training. She also currently co-organizes BSides Seattle, the mentor track at BSides Las Vegas and DEFCON US and China Workshops. ",
      "title": "",
      "updated_at": "2018-10-01T17:37+0000",
      "name": "Magen Wu",
      "conference": "DC80",
      "id": 30350
    },
    {
      "link": "",
      "twitter": "",
      "description": "Kat Seymour is a Red Team Penetration tester at Bank of America with 16 years of experience in the fields of IT and information security.  Kat started playing her company’s internal CTF in 2013 as a way to sharpen her hunting skills. She was invited to join the Red Team 18 months later due to her demonstrated skill and dedication.  Kat continues to participate in CTFs whenever she can to help practice and sharpen her skills. ",
      "title": "",
      "updated_at": "2018-10-01T17:38+0000",
      "name": "Kathryn Seymour",
      "conference": "DC80",
      "id": 30351
    },
    {
      "link": "",
      "twitter": "",
      "description": "Kirsten is the Director of Recruiting at Novetta, an advanced analytics and cyber security company.  She studied HR Management at University of Maryland. After a short while working as a software developer, then help desk manager, she combined her love for technology and HR by becoming a Technical Recruiter and has been doing so for over 20 years. For the last decade, Kirsten has been primarily supporting the Information Security field, and is best known in the community for her involvement in the Car Hacking Village!",
      "title": "",
      "updated_at": "2018-10-01T17:38+0000",
      "name": "Kirsten Renner",
      "conference": "DC80",
      "id": 30352
    },
    {
      "link": "",
      "twitter": "@amne51ac",
      "description": "Mark Milhouse is a Computer Forensics Investigator at Edelson PC where he investigates high-profile tech-related consumer class action cases (namely digital privacy, security and fraud) and supports ongoing litigation.  Prior to his current position he served in the United States Marines as a 2651 (Intelligence Systems), deploying to Iraq, and supporting various elements within II Marine Expeditionary Force.  In his free time he enjoys cycling, traveling, and endless projects like building obscure web apps.",
      "title": "",
      "updated_at": "2018-10-01T17:38+0000",
      "name": "Mark Milhouse",
      "conference": "DC80",
      "id": 30353
    },
    {
      "link": "",
      "twitter": "@CurtBarnard",
      "description": "Curt holds an MS in Cyber Operations from the Air Force Institute of Technology, and has spent the last decade in cybersecurity across public and private industries, including venture capital. Curt’s research interests lie primarily in network analysis, anonymizing technologies, and generally breaking stuff.",
      "title": "",
      "updated_at": "2018-10-01T17:39+0000",
      "name": "Curt Barnard",
      "conference": "DC80",
      "id": 30354
    },
    {
      "link": "",
      "twitter": "@d4wud",
      "description": "Dr. Dawud Gordon is CEO & Co-Founder at TWOSENSE.AI, an NYC-based Behavioral Biometrics firm that makes authentication invisible through AI.  Dawud holds a Ph.D. in Computer Engineering from KIT in Karlsruhe, Germany for his work on using Machine Learning to for human behavior analytics. He has published over 30 peer-reviewed papers and patents on related topics, and won several awards for his research. Curt is the Founder and CEO of ThreshingFloor (threshingfloor.io). ",
      "title": "",
      "updated_at": "2018-10-01T17:39+0000",
      "name": "Dawud Gordon",
      "conference": "DC80",
      "id": 30355
    },
    {
      "link": "",
      "twitter": "@KyCarla",
      "description": "Carla Raisler is a cybersecurity professional in the healthcare industry and the department of defense. When she isn’t harassing her coworkers with phishing tests or security audits, she’s telling war stories while enjoying her favorite bourbon.",
      "title": "",
      "updated_at": "2018-10-01T17:40+0000",
      "name": "Carla A Raisler",
      "conference": "DC80",
      "id": 30356
    },
    {
      "link": "",
      "twitter": "@TheBull963",
      "description": "John is currently a hands-on CSO for a small SaaS company. He has over 25 years of experience in the IT and Security industry. John has worked in multiple sectors including Retail, Manufacturing, Medical, and Technology. He has held roles ranging from Systems Administrator, DBA, Director/CIO, and CSO. John currently holds a OSCP, GCIH, CISSP, and PMP certifications.",
      "title": "",
      "updated_at": "2018-10-01T17:40+0000",
      "name": "John Bullinger",
      "conference": "DC80",
      "id": 30357
    },
    {
      "link": "",
      "twitter": "@vvalien1",
      "description": "Chris Mallz would much rather spend his time hacking or researching than writing a Bio.",
      "title": "",
      "updated_at": "2018-10-01T17:40+0000",
      "name": "Chris Mallz",
      "conference": "DC80",
      "id": 30358
    },
    {
      "link": "",
      "twitter": "@kfosaaen",
      "description": "Karl is a Practice Director at NetSPI who specializes in network and web application penetration testing. With over ten years of consulting experience in the computer security industry, he has worked in a variety of industries and has made his way through many Active Directory domains. Karl also holds a BS in Computer Science from the University of Minnesota. This year, he has spent a fair amount of time digging into automating and assessing the Azure stack. Over the years at NetSPI, Karl has helped build out and maintain their GPU cracking boxes. Karl holds a couple of certifications, that is neat. Karl has previously spoken at THOTCON, DerbyCon 6.0, and BSidesPDX. In his spare time, you may see him trying to sell you a t-shirt as a swag goon at DEF CON.",
      "title": "",
      "updated_at": "2018-10-01T17:40+0000",
      "name": "Karl Fosaaen",
      "conference": "DC80",
      "id": 30359
    },
    {
      "link": "",
      "twitter": "@benevolust",
      "description": "Leslie is a network-focused penetration tester (learning about OT/ICS in their downtime). Relatedly, they're a perpetual Linux sysadmin and frequent conference volunteer and attendee. Typically you’ll find them scoping out WAPs, wiggling ATM card readers, and hiding in a corner with MP3s, a 3DS (playing JRPGs), or CTFs.",
      "title": "",
      "updated_at": "2018-10-01T17:43+0000",
      "name": "Lsly Ayyy",
      "conference": "DC80",
      "id": 30360
    },
    {
      "link": "",
      "twitter": "",
      "description": "Peter Arzamendi is a Security Researcher with NETSCOUT Arbor's ASERT team. He has expertise in vulnerability discovery, fuzzing, exploitation techniques, malware analysis, and protocol analysis. Areas of interest include static and dynamic analysis of binaries and hardware reverse engineering. He has over 15 years of experience in systems administration, computer engineering, and information systems security. He is active in the InfoSec community and has presented on security topics at Shmoocon, Hack in Paris, Blackhat Arsenal, and local venues. He has also contributed to several open source projects such as Metasploit, Fgdump, and Serpico.",
      "title": "",
      "updated_at": "2018-10-01T17:43+0000",
      "name": "Peter Arzamendi",
      "conference": "DC80",
      "id": 30361
    },
    {
      "link": "",
      "twitter": "@ch41_",
      "description": "Adam is a security practitioner, beard enthusiast, and heavy metal connoisseur. For the better part of a decade he has worked across multiple security disciplines, such as architecture design and implementation, penetration testing, security engineering, and incident handling and response. Adam is an Incident Handler with Red Canary, helping organizations find and evict evil.",
      "title": "",
      "updated_at": "2018-10-01T17:43+0000",
      "name": "Adam Mathis",
      "conference": "DC80",
      "id": 30362
    },
    {
      "link": "",
      "twitter": "@isaiahsarju",
      "description": "Isaiah Sarju is a co-owner of Revis Solutions, LLC, a boutique information security firm. He has contributed to the Microsoft Security Intelligence Report, conducted numerous white hat hacking attacks, and taught students how to become top tier defenders. He plays tabletop games, swims, and trains Brazilian Jiu-Jitsu.",
      "title": "",
      "updated_at": "2018-10-01T17:43+0000",
      "name": "Isaiah Sarju",
      "conference": "DC80",
      "id": 30363
    },
    {
      "link": "",
      "twitter": "@aprilwright",
      "description": "April C. Wright is a hacker, author, teacher, and community leader with over 25 years of breaking, making, fixing, and defending global critical communications and connections. She is an international speaker and trainer, educating others about Information Security, with the goal of protecting individual privacy and important assets to make the digital components that impact our lives safer and more secure. A security program specialist for a Fortune 15 company, April has held roles on offensive, defensive, operational, and development teams throughout her career, and been a speaker and contributor at numerous security conferences including BlackHat, DEF CON, DerbyCon, Hack in Paris, DefCamp, ITWeb, as well as for the US Government and industry organizations such as OWASP and ISSA. She has started multiple small businesses including a non-profit, is a member of the DEF CON Groups Core Team, and in 2017 she co-founded the Boston DEF CON Group DC617. April has collected dozens of certifications to add letters at the end of her name, almost died in Dracula’s secret staircase, and once read on ‘teh interwebs’ that researchers at the University of North Carolina released a comprehensive report in 2014 confirming that she is the “most significant and interesting person currently inhabiting the earth”, so it must be true.",
      "title": "",
      "updated_at": "2018-10-01T17:44+0000",
      "name": "April Wright",
      "conference": "DC80",
      "id": 30364
    },
    {
      "link": "",
      "twitter": "@ztgrace",
      "description": "Zach has worked in offensive security for the last eight years focusing on securing financial institutions by breaking into them. He is currently the red team lead for a Fortune 100. Zach is the creator of the open source security projects changeme and Sticky Keys Hunter, and has contributed to several others including Metasploit, Empire and Recon-ng.",
      "title": "",
      "updated_at": "2018-10-01T17:44+0000",
      "name": "Zach Grace",
      "conference": "DC80",
      "id": 30365
    },
    {
      "link": "",
      "twitter": "",
      "description": "Omer is End-Point team lead at Javelin Networks. The team focuses on methods to covertly manipulate OS internals. Before Javelin Networks, he was a malware researcher at IBM Trusteer for two years focusing on financial malware families and lectured about his research on Virus Bulletin and Zero Nights conferences. In the past he has worked at Algotec for six years developing medical imaging software and at IDF's technology unit for three years as dev team lead. In his free time he revives historical photographic processes.  ",
      "title": "",
      "updated_at": "2018-10-01T17:44+0000",
      "name": "Omer Yair",
      "conference": "DC80",
      "id": 30366
    },
    {
      "link": "",
      "twitter": "@junior_baines",
      "description": "Jacob is the team lead of Tenable's new zero day research team. Previously, he was working as a reverse engineer on Tenable's Nessus project.",
      "title": "",
      "updated_at": "2018-10-01T17:45+0000",
      "name": "Jacob Baines",
      "conference": "DC80",
      "id": 30367
    },
    {
      "link": "",
      "twitter": "",
      "description": "Eric Watkins: KR0VER- Is a security architect who is interested hacking all things RF. ",
      "title": "",
      "updated_at": "2018-10-01T17:45+0000",
      "name": "Eric Watkins",
      "conference": "DC80",
      "id": 30368
    },
    {
      "link": "",
      "twitter": "",
      "description": "Devin Noel: N7HKR - Is a security engineer who enjoys hacking and doing other cool things with technology.",
      "title": "",
      "updated_at": "2018-10-01T17:45+0000",
      "name": "Devin Noel",
      "conference": "DC80",
      "id": 30369
    },
    {
      "link": "",
      "twitter": "",
      "description": "Austin Baker started his career in InfoSec learning the ways of Digital Forensics and Incident Response. Then, he learned it was way more fun learning to do break things than how to put them back together. Since then, he's been a practicing Red Team member at Mandiant, helping secure organizations by pretending to be one of the bad guys. ",
      "title": "",
      "updated_at": "2018-10-01T17:46+0000",
      "name": "Austin Baker",
      "conference": "DC80",
      "id": 30370
    },
    {
      "link": "",
      "twitter": "@doughsec",
      "description": "Doug Bienstock splits his time at Mandiant performing Incident Response and Red Team work. He uses lessons learned from IRs to better simulate attacker techniques and aid organizations stay ahead of the bad guys.",
      "title": "",
      "updated_at": "2018-10-01T17:46+0000",
      "name": "Doug Bienstock",
      "conference": "DC80",
      "id": 30371
    },
    {
      "link": "",
      "twitter": "",
      "description": "Brandon has been working with AWS infrastructure for four years and is a Senior Cloud Infrastructure engineer at Twilio, where the challenge of real-time cloud communications requires thinking about security in new and exciting ways. He wants to replace himself with microservices & APIs but until he manages to do that, you’ll find him teaching anyone who will listen that they can be a “security person” too. ",
      "title": "",
      "updated_at": "2018-10-01T17:54+0000",
      "name": "Brandon Sherman ",
      "conference": "DC80",
      "id": 30372
    },
    {
      "link": "",
      "twitter": "@zanshinh4x",
      "description": "Tim and Brent are Sr. Security Consultants within NTT Security’s Threat Services group. They have developed Red Team and Social Engineering testing methodologies and have spoken at internationally recognized security conferences including DEFCON, DerbyCon, B-Sides, ISSA International, AIDE at Marshall Univ, Techno Sec & Forensics Invest. Con, and more. Tim has held management, IT and physical security roles across multiple industries, including healthcare and government. He is a regular contributor to NTT Security’s ‘#WarStoryWednesday' series, has developed methodologies for red team and social engineering assessments and has been featured in CSO on the subject of onsite social engineering. He is the founder of DC859 (the 859 area code DEFCON group) and is a core member for the DEFCON Conference “Groups” program. Brent is a Trusted Advisor for the Tennessee Department of Safety and Homeland Security on the topics of Physical and Cyber Security, is the founder of the Nashville DEF CON group (DC615), and is the Global Coordinator for the DEF CON conference “Groups” program. He has held the role of Web/Project Manager and IT Security Director at the headquarters of a global franchise company as well as Web Manager and information security positions for multiple television personalities and television shows on The Travel Channel. Brent has also been interviewed on the popular web series, “Hak5” with Darren Kitchen and BBC News. Both have been interviewed on the topic of “White hat hacking” for Microsoft’s “Roadtrip Nation” television series. Their experiences with traditional/non-traditional pentesting techniques include network, wireless, social engineering, application and physical testing. These techniques have led to highly successful Red Team assessments against corporate environments. By sharing their experiences, they hope to continue to contribute to the InfoSec community.",
      "title": "",
      "updated_at": "2018-10-01T17:55+0000",
      "name": "Tim Roberts",
      "conference": "DC80",
      "id": 30373
    },
    {
      "link": "",
      "twitter": "@brentwdesign",
      "description": "Tim and Brent are Sr. Security Consultants within NTT Security’s Threat Services group. They have developed Red Team and Social Engineering testing methodologies and have spoken at internationally recognized security conferences including DEFCON, DerbyCon, B-Sides, ISSA International, AIDE at Marshall Univ, Techno Sec & Forensics Invest. Con, and more. Tim has held management, IT and physical security roles across multiple industries, including healthcare and government. He is a regular contributor to NTT Security’s ‘#WarStoryWednesday' series, has developed methodologies for red team and social engineering assessments and has been featured in CSO on the subject of onsite social engineering. He is the founder of DC859 (the 859 area code DEFCON group) and is a core member for the DEFCON Conference “Groups” program. Brent is a Trusted Advisor for the Tennessee Department of Safety and Homeland Security on the topics of Physical and Cyber Security, is the founder of the Nashville DEF CON group (DC615), and is the Global Coordinator for the DEF CON conference “Groups” program. He has held the role of Web/Project Manager and IT Security Director at the headquarters of a global franchise company as well as Web Manager and information security positions for multiple television personalities and television shows on The Travel Channel. Brent has also been interviewed on the popular web series, “Hak5” with Darren Kitchen and BBC News. Both have been interviewed on the topic of “White hat hacking” for Microsoft’s “Roadtrip Nation” television series. Their experiences with traditional/non-traditional pentesting techniques include network, wireless, social engineering, application and physical testing. These techniques have led to highly successful Red Team assessments against corporate environments. By sharing their experiences, they hope to continue to contribute to the InfoSec community.",
      "title": "",
      "updated_at": "2018-10-01T17:55+0000",
      "name": "Brent White",
      "conference": "DC80",
      "id": 30374
    },
    {
      "link": "",
      "twitter": "@nevon",
      "description": "Currently an InfoSec director with a focus on incident response, awareness, and vendor risk, Dan has been traversing tracts of technology for over 20 years.  After dabbling in diversions from design to development, Dan settled into scrutinizing suspect security standards. Aside from alliteration, Dan enjoys spending time with his family, building & breaking things.",
      "title": "",
      "updated_at": "2018-10-01T17:55+0000",
      "name": "Dan Browder",
      "conference": "DC80",
      "id": 30375
    },
    {
      "link": "",
      "twitter": "@darby0x6d",
      "description": "A self-described developer, infosec nut, & Crossfit addict - Darby Mullen has worked on both the blue and the red sides of infosec, most recently running a team building a secure browsing platform.",
      "title": "",
      "updated_at": "2018-10-01T17:55+0000",
      "name": "Darby Mullen",
      "conference": "DC80",
      "id": 30376
    },
    {
      "link": "",
      "twitter": "@Francisckrs",
      "description": "Francisco currently runs a Managed Security Service Architecture team for a large multi-national computer security company. His passion and hobby is researching and understanding Nation-State hacking capabilities and tools. He has been on the forefront of research into the Equation Group’s post-exploitation tools and capabilities since their release by the Shadow Brokers and has spoken about this research at Derbycon, Thotcon, and other conferences. ",
      "title": "",
      "updated_at": "2018-10-01T17:56+0000",
      "name": "Francisco Donoso",
      "conference": "DC80",
      "id": 30377
    },
    {
      "link": "",
      "twitter": "@soen_vanned",
      "description": "Bryce has been an active competitive hacker for the past 13 years, is a core team member of V&, and competes regularly with Nasa Rejects and Spaceticles—previously playing with Mammon Machine and Men-In-Black-Hats, obtaining a Black Badge at DefCon 19.  Alongside V&, Bryce has run OpenCTF at DefCon for several years and is deeply embedded in the CTF community, encouraging newcomers to participate and learn as well as challenging seasoned CTF players with mind bending problems.  Professionally, Bryce has been a vulnerability researcher for several years and is currently a security consultant and penetration tester at Coalfire Inc.",
      "title": "",
      "updated_at": "2018-10-01T17:56+0000",
      "name": "Bryce \"soen\" Bearchell",
      "conference": "DC80",
      "id": 30378
    },
    {
      "link": "",
      "twitter": "@colemankane",
      "description": "Coleman Kane is the Principal Technologist for GE Aviation's security operations team in Cincinnati. He built the Cyber Intelligence program from the ground up, as well as working on teams developing sensoring and malware analysis platforms for the company. Coleman currently teaches cyber security courses as a Ph. D. candidate at the University of Cincinnati.",
      "title": "",
      "updated_at": "2018-10-01T17:56+0000",
      "name": "Coleman Kane",
      "conference": "DC80",
      "id": 30379
    },
    {
      "link": "",
      "twitter": "@4A4133",
      "description": "Detection Scientist, Bro NSM Enthusiast, PC Master Builder, BMW Track Instructor",
      "title": "",
      "updated_at": "2018-10-01T17:56+0000",
      "name": "John Althouse",
      "conference": "DC80",
      "id": 30380
    },
    {
      "link": "",
      "twitter": "@StanHacked",
      "description": "Stan has more than a decade of experience in offensive security, with a strong focus on red teaming and attack simulations. His passion is to analyse and adopt the tradecraft of the bad guys in order to closely mimic their techniques in attack simulations for his clients, ranging from banking to military. Stan loves developing malware for red teaming purposes (WinAPI <3) and exploring opportunities for abuse in Windows components such as MS Office, COM, .NET and PowerShell. During the conference you can ask him any question about the Dutch basketball league, and as a Scotch drinker (Islay, of course) he'd love to get a proper introduction into bourbon from a local expert.",
      "title": "",
      "updated_at": "2018-10-01T17:57+0000",
      "name": "Stan Hegt",
      "conference": "DC80",
      "id": 30381
    },
    {
      "link": "",
      "twitter": "",
      "description": "Pieter is a seasoned security specialist with 10 years of hands-on hacking experience. As a consultant he executed large scale pentest and red teaming engagements for numerous large multinationals. Furthermore Pieter worked as a SOC/threat intelligence analist and within Outflank executed incident response engagements for targeted attacks. As such he combines knowledge of real-life attacks and creative ways to detect them. Around the year 2000 Pieter maintained Office documents and templates, developed macro’s for Office and AutoCad and could program in native PostScript. Nowadays, he applies this knowledge to develop new ways to (ab)use Office to it's fullest extent. ",
      "title": "",
      "updated_at": "2018-10-01T17:57+0000",
      "name": "Pieter Ceelen",
      "conference": "DC80",
      "id": 30382
    },
    {
      "link": "",
      "twitter": "",
      "description": "Tomasz has been a security researcher for over six years, having spent the first five at the Department of Defense, followed by Assured Information Security, Inc. He has primarily specialized in low-level security research.",
      "title": "",
      "updated_at": "2018-10-01T17:57+0000",
      "name": "Tomasz Tuzel",
      "conference": "DC80",
      "id": 30383
    },
    {
      "link": "",
      "twitter": "",
      "description": "I have been working in the field for about 5 years now as an IT Security Manager and also do a little consulting on the side. I have a BS in Cybersecurity, Security + and currently working on my CISSP. In school I was the windows lead on our CCDC team. In CCDC I helped to set up the practice environment and run the practices. Our team competed in the Pacific-Rim region and also in Nationals.",
      "title": "",
      "updated_at": "2018-10-01T18:05+0000",
      "name": "Russell Nielsen",
      "conference": "DC80",
      "id": 30384
    },
    {
      "link": "",
      "twitter": "",
      "description": "Nick is a member of the Shellphish CTF team and employed by Raytheon CSI as a vulnerability researcher. Nick has published papers on automated bug finding and exploitation as well Android security, and competed in the DARPA Cyber Grand Challenge with team Shellphish.",
      "title": "",
      "updated_at": "2018-10-01T18:05+0000",
      "name": "Nick Stephens",
      "conference": "DC80",
      "id": 30385
    },
    {
      "link": "",
      "twitter": "",
      "description": "Adam Reiser is a security researcher with Cisco's Advanced Security Initiatives Group. His work includes red team engagements and hunting for zero days. He cultivated an early interest in information security as a sysadmin at the Open Computing Facility at UC Berkeley, while there completing his physics degree. His other interests include acroyoga and riparian restoration.",
      "title": "",
      "updated_at": "2018-10-01T18:05+0000",
      "name": "Adam Reiser",
      "conference": "DC80",
      "id": 30386
    },
    {
      "link": "",
      "twitter": "@import_au",
      "description": "With over 10 years’ experience in the information technology and cyber security fields, Adam has been recognized as an expert in these areas, strengthening the overall security posture for many organizations including NATO, Hewlett-Packard, Department of the Navy, and more recently, Walmart's Security Operations Center. Over the course of his career, Adam has specialized in development, innovation, and various defensive capabilities. ",
      "title": "",
      "updated_at": "2018-10-01T18:06+0000",
      "name": "Adam Gold",
      "conference": "DC80",
      "id": 30387
    },
    {
      "link": "",
      "twitter": "@DisK0nn3cT",
      "description": "Daniel Chrastil has over 10 years experience in security ranging from red teaming for the world's largest commercial organization, hacking web and mobile applications, developing and hosting CTFs, and building secure web application environments. Daniel uses his skills from his past life as a web developer and system administrator to develop open source security tools for the security community and is developer for the Empire Framework project.",
      "title": "",
      "updated_at": "2018-10-01T18:06+0000",
      "name": "Daniel Chrastil ",
      "conference": "DC80",
      "id": 30388
    },
    {
      "link": "",
      "twitter": "@Lerg",
      "description": "Andrew Kalat, is a Sr. Manager of Information Security at USBank and co-host, Defensive Security Podcast. Andrew is a 20 year veteran of the security industry, working in diverse roles such as architect, sales engineer, consultant, and management. He is also a private pilot, published author and avid photographer.",
      "title": "",
      "updated_at": "2018-10-01T18:06+0000",
      "name": "Andrew Kalat",
      "conference": "DC80",
      "id": 30389
    },
    {
      "link": "",
      "twitter": "@s0lst1c3",
      "description": "Gabriel Ryan is a penetration tester and researcher with a passion for wireless and infrastructure testing. He currently serves a co-founder and principle security consultant for Digital Silence, a Denver based consulting firm that specializes in impact driven penetration testing and red team engagements. Prior to joining Digital Silence, Gabriel worked as a penetration tester and researcher for Gotham Digital Silence, contributing heavily to their wireless security practice and regularly performing large scale infrastructure assessments and red teams for Fortune 500 companies. Some of Gabriel's most recent work includes the development of EAPHammer, an 802.11ac focused tool for breaching WPA2-EAP networks. On the side, he serves as a member of the BSides Las Vegas senior staff, coordinating wireless security for the event. In his spare time, he enjoys producing music, exploring the outdoors, and riding motorcycles.",
      "title": "",
      "updated_at": "2018-10-01T18:06+0000",
      "name": "Gabriel Ryan",
      "conference": "DC80",
      "id": 30390
    },
    {
      "link": "",
      "twitter": "@tatanus",
      "description": "Adam Compton has been a programmer, researcher, professional pentester, father, husband, and farmer.  Adam has over 18 years of programming, network security, incident response, security assessment, and penetration testing experience. Throughout Adam's career, he has worked for both federal and international government agencies as well as within various aspects of the private sector.",
      "title": "",
      "updated_at": "2018-10-01T18:07+0000",
      "name": "Adam Compton",
      "conference": "DC80",
      "id": 30391
    },
    {
      "link": "",
      "twitter": "",
      "description": "Mrs. Kusjanovic is a Senior Solutions Consultant for the North American branch of Eclectic IQ.  Her primary roles include conducting demonstrations of Threat Intelligence Platform and Intelligence Feed technologies and supporting customers with their operational and analytic needs.  Her career covers incident response in the SOC/NOSC/Fusion Center and a panoply of cyber security engineering responsibilities, inclusive of SIEM, firewalls, endpoint detection solutions, intrusion detection/prevention systems to name a few.  She has a bachelor’s degree from the University of Florida and is currently taking classes toward her Master’s Degree in Cyber Security/Computer Science. ",
      "title": "",
      "updated_at": "2018-10-01T18:07+0000",
      "name": "Katie Kusjanovic",
      "conference": "DC80",
      "id": 30392
    },
    {
      "link": "",
      "twitter": "@mattjshelton",
      "description": "Matt Shelton is a member of FireEye’s internal blue team.  In his role, he leads an intelligence-driven risk management program responsible for identifying technology risk at FireEye, prioritizing risk based on adversary intentions and capabilities, and then working with business partners around FireEye to ensure the correct mitigations are in place.  With over 18 years of experience in multiple security disciplines, Mr. Shelton has spent his career advising commercial, government, and military clients on how to build intelligence-led security programs.",
      "title": "",
      "updated_at": "2018-10-01T18:07+0000",
      "name": "Matt Shelton",
      "conference": "DC80",
      "id": 30393
    },
    {
      "link": "",
      "twitter": "@nogoodrobot",
      "description": "Kaleb is a blue teamer and recovering systems admin/network engineer. As a USAF veteran he has over two decades of hands on keyboard experience as well as CISSP and GMON.  His work has focused in the last five years on total network awareness and finding the bad before the bad burns the building down.",
      "title": "",
      "updated_at": "2018-10-01T18:07+0000",
      "name": "Kaleb Brown",
      "conference": "DC80",
      "id": 30394
    },
    {
      "link": "",
      "twitter": "@b0dach",
      "description": "For 20 years, Jamie has specialized defending, securing, and protecting corporate networks. He has worked as an adviser for major verticals including insurance, financial, manufacturing, retail, and health care. During this time, he built security operation centers for Fortune 500 companies, providing expert guidance in all areas of security operations. He has built incident response and threat intelligence programs, focusing on profiling threats specific to individual organizations, and took this information and built adaptive monitoring programs.",
      "title": "",
      "updated_at": "2018-10-01T18:08+0000",
      "name": "Jamie Murdock",
      "conference": "DC80",
      "id": 30395
    },
    {
      "link": "",
      "twitter": "@saraleal417",
      "description": "Sara Leal is a Senior Manager in the Security Operations Center (SOC) which is responsible for protecting Walmart and acquisition networks from malicious activity. She currently has responsibility for the SIEM (Security Incident and Event Management) Engineering team and the SOC Data Analytics team. Sara currently holds the GCIA and GMON SANS certifications. In her free time, she enjoys spending time with her three children ages 22, 14, and 11 and she loves to travel.",
      "title": "",
      "updated_at": "2018-10-01T18:08+0000",
      "name": "Sara Leal",
      "conference": "DC80",
      "id": 30396
    },
    {
      "link": "",
      "twitter": "@jrmorrow43",
      "description": "Jason Morrow is responsible for leading real time threat defense for fortune 1, it's subsidiaries' and acquisitions' networks. The scope of his role also includes incident management automation, orchestration, active defense, and RE. He holds the PMP, GSEC, GISP, GCIH, GMON, Network+, A+, CISSP and former holder of CCNA and CCSP certifications. Jason has presented cyber defense tactics at multiple universities, InfoSec cons, and the National CyberSecurity Collegiate Defense Competition (NCCDC).",
      "title": "",
      "updated_at": "2018-10-01T18:09+0000",
      "name": "Jason Morrow",
      "conference": "DC80",
      "id": 30397
    },
    {
      "link": "",
      "twitter": "@SpenGietz",
      "description": "With a background in software development, Spencer Gietzen is a penetration tester with Rhino Security Labs.  His primary focus as a penetration tester is security relating to Amazon Web Services post exploitation and configuration, where he has found success in discovering vulnerabilities and attack vectors through extensive research.",
      "title": "",
      "updated_at": "2018-10-01T19:03+0000",
      "name": "Spencer Gietzen",
      "conference": "DC80",
      "id": 30398
    },
    {
      "link": "",
      "twitter": "@josequinones",
      "description": "José L. Quiñones has 20+ years of experience in the IT field and holds a Bachelors in Science in Electronic Engineering Technology and various professional certifications in systems administration and cybersecurity. Jose has mainly worked in the Health and Education industries, works as an independent consultant in IT infrastructure, cloud and security architecture. In addition, Jose has worked with the start-up community and in the creation of the first IoT Lab in the Caribbean towards the goal of research and development of new technologies and solutions to build Smart Cities.  He is President/Co-Founder of Obsidis Cosortia, Inc a not for profit organization which mission is to promote professional development of information security for IT professionals, students and enthusiasts, and security awareness to the general public. Finally Jose, runs the local Defcon Group 787, is the head organizer of “Security B Sides Puerto Rico” and runs a personal blog about systems administration and security CODEFidelio.org. ",
      "title": "",
      "updated_at": "2018-10-01T19:17+0000",
      "name": "Jose Quinones",
      "conference": "DC80",
      "id": 30400
    },
    {
      "link": "",
      "twitter": "@carlos_perez",
      "description": "Carlos Perez has over 20 years experience in the security field. He is currently the Research Lead at TrustedSec helping develop new TTPs for the Force team. Carlos is best known for his contribution to the Metasploit, tools like DNSRecon and the overall Windows PowerShell security community. He is a co-host in the SecurityWeekly Podcast. He is Co-Founder of Obsidis Cosortia, Inc a not for profit organization which mission is to promote professional development of information security for IT professionals, students and enthusiasts, and security awareness to the general public.",
      "title": "",
      "updated_at": "2018-10-01T19:17+0000",
      "name": "Carlos Perez",
      "conference": "DC80",
      "id": 30401
    },
    {
      "link": "",
      "twitter": "@ladyred_6",
      "description": "As an active duty US Army Counterintelligence Agent (6 yrs), Judy provided weekly SAEDA briefings for new incoming unit soldiers and for yearly awareness training requirements. Judy received an Army award for the presentation’s effectiveness in engaging the audience, thereby enhancing self-awareness of the threat. Her experiences include training in traditional espionage tradecraft, along with supervising and conducting counterintelligence investigations of individuals, organizations, installations and activities in order to detect, assess and counter threats to national security. After leaving the Army, Judy started a civilian career in information security as:  domain admin for a global company, an IT manager implementing incident response system, Fraud department investigating people stealing company services, and now a Cyber Threat Intelligence Analyst, augmented by a 2nd Master’s Degree in Cybersecurity and Computer Forensics. ",
      "title": "",
      "updated_at": "2018-10-01T19:17+0000",
      "name": "Judy Towers",
      "conference": "DC80",
      "id": 30402
    },
    {
      "link": "",
      "twitter": "@thepacketrat",
      "description": "Sean Gallagher is the IT Editor and National Security Editor for Ars Technica. A former Navy officer and government IT contractor (and for a time the Director of IT Strategy for Ziff Davis Enterprise), Sean has been an IT journalist for over 20 years. He covers information security and privacy as part of his vast beat at Ars.  ",
      "title": "",
      "updated_at": "2018-10-01T19:18+0000",
      "name": "Sean Gallagher",
      "conference": "DC80",
      "id": 30403
    },
    {
      "link": "",
      "twitter": "@SteveD3",
      "description": "Prior to joining the journalism world in 2005, Steve Ragan spent 15 years as a freelance IT contractor focused on infrastructure management and security. He's a father of two and rounded geek with a strong technical background. ",
      "title": "",
      "updated_at": "2018-10-01T19:19+0000",
      "name": "Steve Ragan",
      "conference": "DC80",
      "id": 30404
    },
    {
      "link": "",
      "twitter": "@snd_wagenseil",
      "description": "Paul Wagenseil heads security and privacy coverage for Tom's Guide. He has also been a warehouse manager, a car deliveryman, a bartender, a fry cook and a dishwasher. That's all he's going to tell you unless you meet him in person.",
      "title": "",
      "updated_at": "2018-10-01T19:20+0000",
      "name": "Paul Wagenseil",
      "conference": "DC80",
      "id": 30405
    },
    {
      "link": "",
      "twitter": "@infojanitor",
      "description": "A senior security systems engineer with 25+ years’ experience currently employed at a fortune sixty company in the Washington DC area.  Day job, responsible for world-wide evaluation, certification, penetration and integrity testing of a variety of current and emerging technologies, networks, architectures, and devices.  Night hobbies - monitors major trade shows like CES in Las Vegas for the train-wreck factor as new technology seems to be developed and deployed with some if not most of the existing vulnerabilities, bugs, and issues of today.  Some issues dating back more than twenty years ago that should have been resolved.  When not stifled by my company’s legal team I have been permitted to speak on certain subjects to the security community on issues that I see in technology.  I'm an active member of the Northern Virginia Hackers association (NoVaH) a collective of security professionals, hackers, authors, makers, and tool developers.",
      "title": "",
      "updated_at": "2018-10-01T19:20+0000",
      "name": "Infojanitor",
      "conference": "DC80",
      "id": 30406
    },
    {
      "link": "",
      "twitter": "@0xAmit",
      "description": "Amit Serper, Head of security research, Cybereason Nocturnus group:Amit leads the security research at Cybereason's Nocturnus global security practice. He specializes in low-level, vulnerability and kernel research, malware analysis and reverse engineering. Whenever he is not taking apart malware and exploring the dark and undocumented corners of operating systems at the office, you could find him in his lab at home reverse engineering routers and other IoT devices and finding horrible bugs on them. Prior to joining Cybereason, Amit spent nine years leading security research projects and teams for the Israeli government, specifically in embedded system security. ",
      "title": "",
      "updated_at": "2018-10-01T19:21+0000",
      "name": "Amit Serper",
      "conference": "DC80",
      "id": 30407
    },
    {
      "link": "",
      "twitter": "",
      "description": "Niv Yona, Threat hunting and research lead, EMEA at Cybereason Nocturnus group - Niv began his career as a team leader of the security operations center in the Israeli Air Force, where he focused on incident response, forensics, and malware analysis. At Cybereason, Niv focuses on threat research that directly enhances product detections and the Nocturnus hunting playbook. ",
      "title": "",
      "updated_at": "2018-10-01T19:21+0000",
      "name": "Niv Yona",
      "conference": "DC80",
      "id": 30408
    },
    {
      "link": "",
      "twitter": "",
      "description": "Yuval Chuddy, Threat hunter and Security researcher at Cybereason Nocturnus group Yuval began his career as a security researcher in the cyber security department of the Israeli Air Force, where he focused on incident response, forensics, and malware analysis. At Cybereason, Yuval focuses on investigating targeted and complex attacks and conducts threat hunting in customer environments.",
      "title": "",
      "updated_at": "2018-10-01T19:21+0000",
      "name": "Yuval Chuddy",
      "conference": "DC80",
      "id": 30409
    },
    {
      "link": "",
      "twitter": "@synackpwn",
      "description": "SynAckPwn is a semi-professional retired troll that spends most of his time in a hardhat and popping MS08-067 in control systems.  Yes, MS08-067 is still a thing and he takes little pleasure in exploiting it.  Yes, when it comes to critical infrastructure, it’s still a problem. Yes, most of what you hear about grid hacking is bullsh!t.",
      "title": "",
      "updated_at": "2018-10-01T19:32+0000",
      "name": "SynAckPwn",
      "conference": "DC80",
      "id": 30411
    }
  ],
  "updated_at": "2018-10-01T19:32+0000"
}