{
  "speakers": [
    {
      "sptitle": "",
      "who": "Mike Sanders",
      "indexsp": 1,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "TBA"
    },
    {
      "sptitle": "",
      "who": "z0rro",
      "indexsp": 2,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "z0rro helps run DC562, does red teaming, and security research."
    },
    {
      "sptitle": "",
      "who": "Amit Serper",
      "indexsp": 3,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Amit leads the security research at Cybereason’s Boston HQ. He specializes in low-level, vulnerability and kernel research, malware analysis and reverse engineering. He also has extensive experience researching attacks on large scale networks and investigating undocumented OS resources and APIs. Prior to joining Cybereason, Amit spent nine years leading security research projects and teams for an Israeli intelligence agency, specifically in embedded system security. He’s presented at RSA, BSides, CircleCityCon, Derbycon, LayerOne and other conferences."
    },
    {
      "sptitle": "",
      "who": "Rtzq0",
      "indexsp": 4,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Rtzq0 is a \"DevOps\" (whatever the hell that means) consultant, hacker and organizer with DC562, and loves him some karate. Designing a 3d printer for hackers “There are a TON of 3d printers out there, and more being released every day. Increasing interest has led to increasing competition from Shenzen, which has driven prices lower and quality at low price points ever higher. But as more and more of these impressive products are produced, the 3d printing ecosystem moves further and further away from it’s RepRap roots, it’s hacker roots. More and more printer designs rely on prefab kits or sourcing proprietary metal parts, and less and less focus is being placed on developing something that you can fiddle with, remix, and rebuild with your friends and a modicum of study."
    },
    {
      "sptitle": "",
      "who": "Robert Adams",
      "indexsp": 5,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Robert is a licensed attorney and a member of the State Bar of California, the U.S. District Court Bar for the Central District of California, and the American Bar Association. I am listed as a Cooperating Attorney with the EFF and holds multiple certifications. He established his own law firm, RobbLAW, that specializes in information technology law, corporate compliance, privacy and data security law, computer law, and Internet/cyber law (even though he hates the term cyber, it’s how the State Bar categorizes it). Robert grew up in the 80’s and was fortunate enough to have a computer in his bedroom. He enjoyed playing with it but always wanted to be a lawyer; he loved arguing too much. Robert never thought about computers as a career until being discharged from the United States Marine Corps. He had just moved to Los Angeles and the only job available at the time was in desktop support. He knew enough about computers to figure out how to do the job so he took it. Over the years, Robert learned as much as he could and eventually worked my way up to becoming the Technical Lead Engineer in North America for Universal Music. After running their engineering program for a couple of years, Robert decided it was time to follow my calling and go to law school. He worked fulltime and went to law school in the evenings. After graduating, Robert transitioned from systems engineering to information security and compliance because it allowed me to keep my technical skills and apply my legal education."
    },
    {
      "sptitle": "",
      "who": "Security Panda",
      "indexsp": 6,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Brett is a Breaker of Web Applications, Leader of a DefCon Group, Maker of Tasty Food, and Owner of a Majestic Beard. He has over 17 years of experience in IT and Security, specializing in Web Application Pentesting, PCI practices, vulnerability scanning, and management."
    },
    {
      "sptitle": "",
      "who": "Wasabi",
      "indexsp": 7,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Researcher of embedded devices and internet of things"
    },
    {
      "sptitle": "",
      "who": "Matthew Stits",
      "indexsp": 8,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Matthew Stits has been in the security industry for nearly 20 years. He’s consulted and worked for a number of fortune 500 companies in the Communications, Finance, Casino Gaming and Payment Card industries. Today he’s a Security Architect and Researcher for Adobe focusing on emerging technologies and business cases."
    },
    {
      "sptitle": "",
      "who": "Katie Knowles",
      "indexsp": 9,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "@_sigil",
      "bio": "Katie Knowles (@_sigil) is a Security Consultant and Pentester with MWR InfoSecurity. Before her switch to offense, she implemented and managed enterprise security solutions. She enjoys good time spent on good projects, learning new tricks and incantations to befuddle innocent computers, and sharing her newfound knowledge with anyone (un)fortunate enough to be in earshot."
    },
    {
      "sptitle": "",
      "who": "Timur Yunusov",
      "indexsp": 10,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Timur Yunusov – Senior Expert of Banking systems security and author of multiple researches in field of application security including “”Apple Pay replay attacks”” showed at the BlackHat USA 2017, “”Bruteforce of PHPSESSID””, rated in Top Ten Web Hacking Techniques by WhiteHat Security and “”XML Out-Of-Band”” showed at the BlackHat EU. Professional application security researcher. Timur has previously spoken at CanSecWest, BlackHat USA, BlackHat EU, HackInTheBox, Nullcon, NoSuchCon, Hack In Paris, ZeroNights and Positive Hack Days."
    },
    {
      "sptitle": "",
      "who": "Leigh-Anne Galloway",
      "indexsp": 11,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "",
      "bio": "Leigh-Anne Galloway is the Cyber Security Resilience Lead at Positive Technologies where she advises organisations on how best to secure their applications and infrastructure against modern threats. She is an expert in the Application Security Unit, specializing in ATM and POS Security and is the author of security research in account recovery processes on social media websites. She has spoken at many conferences including DevSecCon, BSides, InfoSec Europe, Hacktivity, 8dot8, Blackhat EU and Troopers."
    },
    {
      "sptitle": "",
      "who": "Matthew Hoy",
      "indexsp": 12,
      "last_update": "2018-05-14T12:00:00-07:00",
      "media": "@mattrix_",
      "bio": "Matthew Hoy (@mattrix_). Matt has worked in the Information Security world for over 15 years in various Information Security roles from Security Analyst, Architect, Incident Response, Consulting and Management. Matt currently holds CISSP and SANS GCIH Certifications. Matt has presented at Toorcon Seattle, B-Sides Los Angeles, Toorcon San Diego, Circle City Con, Grrcon, DerbyCon, and of course LayeOne."
    },
    {
      "sptitle": "",
      "who": "Mark Liphardt",
      "indexsp": 13,
      "last_update": "2018-05-17T02:18:00-07:00",
      "media": "",
      "bio": "OG member of the hacking/InfoSec community. A computer forensics expert with a lifetime of experiences to share on many aspects of the tech industry. A Defcon goon for 25 years and longtime privacy advocate."
    }
  ],
  "update_date": "2018-05-17T02:18:00-07:00"
}
