{
	"speakers": [
		{
			"sptitle": "",
			"who": "Tim \"Lanmaster\" Tomes",
			"indexsp": 1800,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@LaNMaSteR53",
			"bio": "Christian, father, husband, veteran, code slinger, aspiring difference-maker and hacking enthusiast."
		},
		{
			"sptitle": "",
			"who": "FuzzyNop",
			"indexsp": 1802,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@FuzzyNop",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Erich Kron",
			"indexsp": 1801,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@ErichKron",
			"bio": "Security Awareness Advocate at KnowBe4, is a veteran information security professional with over 20 years’ experience in the medical, aerospace manufacturing and defense fields. He is the former security manager for the US Army’s 2nd Regional Cyber Center-Western Hemisphere and holds CISSP, CISSP-ISSAP, MCITP and ITIL v3 certifications, among others. Erich has worked with information security professionals around the world to provide the tools, training and educational opportunities to succeed in Information Security."
		},
		{
			"sptitle": "",
			"who": "Jordan Drysdale",
			"indexsp": 1803,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@Rev10D",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Kent Ickler",
			"indexsp": 1804,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@KentIckler",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Sherrie Cowley",
			"indexsp": 1805,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@sherriecowley",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Pau Munoz",
			"indexsp": 1806,
			"last_update": "2018-03-15T12:22:00-07:00",
			"media": "@devilafant",
			"bio": "Pau Munoz is a computer security enthusiast and a researcher at the university of Girona in Spain. He holds a degree in computer engineering and OSWP, OSCP and OSCE certificates. He started his career in computer security at the age of 16 and since then he went through different positions related to vulnerability analysis and security research focusing purple teaming and creative network defense strategy."
		},
		{
			"sptitle": "",
			"who": "Morgan Roman",
			"indexsp": 1807,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@distrustCaution",
			"bio": "Morgan Roman works on the application security team at DocuSign. He started his career writing integration tests for web applications and APIs as a software development engineer in test. He is passionate about finding ways to automate security testing and make it part of the deployment process."
		},
		{
			"sptitle": "",
			"who": "Waylon Granger",
			"indexsp": 1808,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@professor__plum",
			"bio": "Waylon Grange is an experienced reverse engineer, developer, and digital forensics examiner. He holds a graduate degree in Information Security from Johns Hopkins University and has worked numerous computer incident investigations spanning the globe. He currently works as a Senior Threat Researcher for Symantec and previously worked for the Department of Defense performing vulnerability research, software development, and Computer Network Operations."
		},
		{
			"sptitle": "",
			"who": "Gabriel Ryan",
			"indexsp": 1809,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Justin Larson",
			"indexsp": 1810,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@phant0mtrav3ler",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Seth Law",
			"indexsp": 1811,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@sethlaw",
			"bio": "appsec, mobile, hack, fix rinse, repeat"
		},
		{
			"sptitle": "",
			"who": "Tanya Janca",
			"indexsp": 1812,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@SheHacksPurple",
			"bio": "Tanya is a developer advocate specializing in application security; evangelizing about software security through public speaking, her open source project OWASP DevSlop, and various forms of teaching via workshops, blogs and community events.  As an ethical hacker, OWASP Project and Chapter Leader, software developer, effective altruist and professional computer geek of 20+ years, she is a person who is truly fascinated by the ‘science’ of computer science."
		},
		{
			"sptitle": "",
			"who": "Adam Steed",
			"indexsp": 1813,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": ""
		},
		{
			"sptitle": "",
			"who": "Robert Neel",
			"indexsp": 1814,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@redeemedHacker",
			"bio": "Robert Neel has fourteen years experience as a system/network administrator and security consultant/engineer/analyst in the private sector.  He is currently employed by a large financial institution where he established the Red Team and continues to lead it.  In addition, he has seven years experience in the government sector where he performed Vulnerability Analysis and Exploitation for the NSA.  He has experience with twenty-three programming languages and has written complex programs for both Offense and Defense in fifteen of those languages.  Robert is also the founder of PENConsultants.com.  When he is not Red Teaming, Robert loves to spend time with his wife and two children. They enjoy traveling, going to theme parks, and building their dream house together."
		},
		{
			"sptitle": "",
			"who": "David Thompson",
			"indexsp": 1815,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@dirty_tizzle",
			"bio": "David Thompson has 13 years experience in the security field.  He is currently employed by a large financial institution where he leads the New Detective Capabilities Project and is an active member of the Red Team.  He started his security road trip in the Air Force doing Vulnerability Assessments for the Air Force Blue Team and working Active Hunt Ops at NSA (OIF x2).  He then took a Pen Tester position with Johns Hopkins Applied Physics Lab working on Space Systems and other DoD projects.  Wanting to get back to TX, he took a Pen Tester job with the Air Force Blue Team (Threat Emulation Cell) working on Space, Aircraft and other Weapon Systems.  When not on the keyboard, he loves spending time with his wife and three girls.  They enjoy RVing, fishing, hunting and playing sports."
		},
		{
			"sptitle": "",
			"who": "Jayme Hancock",
			"indexsp": 1816,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@highmeh",
			"bio": "Jayme is a penetration tester with AppSec Consulting and former systems administrator with a strong interest in network security, physical security, and active defense. He holds the OSCP, CISSP, GCED, and CEH certifications. Jayme resides in Southern California and spends his free time off-roading, camping, traveling, and failing at astrophotography."
		},
		{
			"sptitle": "",
			"who": "Marley",
			"indexsp": 1817,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "@mkr_ultra",
			"bio": "Marley is a blue team engineer with 14 West. In her spare time she reads a lot and cries about space."
		},
		{
			"sptitle": "",
			"who": "Joe Gray",
			"indexsp": 1818,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Marley is a blue team engineer with 14 West. In her spare time she reads a lot and cries about space."
		},
		{
			"sptitle": "",
			"who": "Michael Whiteley",
			"indexsp": 1819,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "@compukidmike",
			"bio": "Michael Whiteley @compukidmike is an electrical engineer, IT manager, father, and Defcon black badge winner. He doesn’t like long walks on the beach, but prefers to be indoors with a fast internet connection."
		},
		{
			"sptitle": "",
			"who": "Sherrie Cowley",
			"indexsp": 1820,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "@SherrieCowley",
			"bio": "Sherrie Cowley @SherrieCowley has a Masters in Information Systems from the University of Utah with an emphasis on software engineering and cyber security. She has managed help desk, software engineering, and identity and access management teams and is currently an Information Security Manager for a large organization. She has presented at universities, was a keynote for Splunk Live, and acts as a liaison for InfraGard members and the FBI Cyber Task Force."
		},
		{
			"sptitle": "",
			"who": "Colin Jackson",
			"indexsp": 1821,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "@d1dymu5",
			"bio": "Father, locksport enthusiast, security engineer/architect, inventor."
		},
		{
			"sptitle": "",
			"who": "Nate",
			"indexsp": 1822,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "@n8zwn",
			"bio": "He is currently working as a Sr. Security Analyst for the past few years. His current position involves doing both red and blue team activities. He loves everything information security related as well as being outdoors with his family."
		},
		{
			"sptitle": "",
			"who": "Andrew Hall",
			"indexsp": 1823,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "@RuShan_EE",
			"bio": "Security expert and board designer. Father, electrical engineer, CISSP, graduate student, and enjoys all things security related."
		},
		{
			"sptitle": "",
			"who": "Jake",
			"indexsp": 1824,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "@s7a73farm",
			"bio": "Senior Security Engineer. Due to a severe case of ADD, Infosec was a natural habitat for him. Send him the problem that makes everyone else quit. He loves learning by breaking stuff. His favorite thing about... 'Oooh something shiny, brb!'"
		},
		{
			"sptitle": "",
			"who": "Dawn-Marie Hutchinson",
			"indexsp": 1825,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "",
			"bio": "Dawn-Marie Hutchinson brings 18 years of enterprise information technology experience to her role as executive director in the Office of the CISO at Optiv. A well-known thought leader and highly sought after speaker as an expert on the subjects of crisis management, incident response, threat mapping, data privacy, cyber security strategy and leadership. She is credited with establishing standards and controls for the anonymization of patient level data and authored the white paper for defining those levels, as well as use cases for the secondary uses of medical data.In addition to being recognized by CSO Magazine as one of twelve most influential women in cyber security she was also honored as SC Magazine’s \"8 Women to Watch,\" and on the CRN Women's Power 50 list honoring outstanding female executives prominently involved in the IT channel ecosystem for their successes and the far-reaching impact they are having on the technology industry."
		},
		{
			"sptitle": "",
			"who": "Eve Galparin",
			"indexsp": 1826,
			"last_update": "2018-03-13T12:00:00-07:00",
			"media": "",
			"bio": "Eva Galperin is EFF's Director of Cybersecurity. Prior to 2007, when she came to work for EFF, Eva worked in security and IT in Silicon Valley and earned degrees in Political Science and International Relations from SFSU. Her work is primarily focused on providing privacy and security for vulnerable populations around the world. To that end, she has applied the combination of her political science and technical background to everything from organizing EFF's Tor Relay Challenge, to writing privacy and security training materials (including Surveillance Self Defense and the Digital First Aid Kit), and publishing research on malware in Syria,Vietnam, Kazakhstan. When she is not collecting new and exotic malware, she practices aerial circus arts and learning new languages."
		},
		{
			"sptitle": "",
			"who": "Scott Piper",
			"indexsp": 1827,
			"last_update": "2018-03-17T16:08:00-06:00",
			"media": "@0xdabbad00",
			"bio": "Scott Piper is an independent AWS security consultant."
		}
	],
        "update_date": "2018-03-17T16:08:00-06:00"
}
