{
	"speakers": [
		{
			"sptitle": "",
			"who": "Avani Desai",
			"indexsp": 1800,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Avani Desai is a Partner and Executive Vice President at Schellman & Company, the largest niche CPA firm in the world that focuses on technology and security assessments. She is also CEO and co-founder of MyCryptoAlert, a push notification and portfolio app for cryptocurrency.\n\nAvani started her career working at a Big 4 accounting firm for over 10 years, where she led a team and oversaw IT Risk Management and Privacy across national service-lines. In addition, Avani managed the development of internal and external privacy programs and related practices, leveraging her deep knowledge with healthcare and emerging technologies, such as blockchain, cloud computing, artificial intelligence, and virtualization.\n\nNow at Schellman & Company, Avani has been focusing on growth strategies, strategic client and market development, industry analysis, and new services for the last five years. She has been featured in Forbes, CIO.com, and the Wall Street Journal, and is a sought after speaker as a voice on a variety of emerging topics, including security, privacy, information security, future technology trends, and the expansion of young women involved in technology.\n\nIn 2017, Avani, a crypto enthusiast, launched MyCryptoAlert, an app that provides a mobile solution for the alert and portfolio problems crypto investors face. Also passionate about strategic philanthropy, Avani sits on the board of Arnold Palmer Medical Center, the Central Florida Foundation, and is the co-chair of 100 Women Strong, a female-only venture capitalist based giving circle that focuses on solving community-based problems specific to women and children by using data analytics and big data. With all that being said, Avani still considers her greatest accomplishment to be personal rather than professional—she is the proud mother to her 7-year-old son, Sahil, and her 4-year-old daughter, Sareena."
		},
		{
			"sptitle": "",
			"who": "Kevin Cody",
			"indexsp": 1801,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Kevin is a Senior Application Security Consultant with experience working at several Fortune 500 enterprises. Although his particular expertise is geared toward hacking Web and Mobile applications, he is also experienced in the entire gamut from mainframes to embedded systems. Kevin is adamant on helping build-up developers through security, which can be seen in his involvement within OWASP or while speaking at events like CodeMash or BSides."
		},
		{
			"sptitle": "",
			"who": "Thomas Richards",
			"indexsp": 1802,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Thomas Richards, Associate Principal Consultant, has been with Cigital(now Synopsys) since 2012. His primary areas of expertise include Red Teaming and Mobile Security. He is an Offensive Security Certified Professional (OSCP). Thomas spends his days guiding working with clients on red teaming activities and initiatives. In his free time, he enjoys playing guitar, camping, and spending time with his wife and five kids."
		},
		{
			"sptitle": "",
			"who": "Bryan Smith",
			"indexsp": 1803,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Bryan A Smith is a Debian Gnu/Linux and BSD enthusiast and Systems Engineer. Bryan has used Free and Open Source Operating Systems since the late 90’s.\n\nHe contributes to several Open Source projects and has helped launch several startup ISP’s based in his area using Free and Open Source software.\n\nHe’s currently helping organize Devopsday Indianapolis. Bryan is also the Orlando initiator of The Things Network; powering global IoT initiatives."
		},
		{
			"sptitle": "",
			"who": "Fraq",
			"indexsp": 1804,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Ops engineer. Security professional. Veteran. Community builder and leader."
		},
		{
			"sptitle": "",
			"who": "Chad Seaman",
			"indexsp": 1805,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Internet dumpster diver, DDoS researcher, hunter of botnets, diddler of malware. Senior Security Response Team Engineer @ Akamai"
		},
		{
			"sptitle": "",
			"who": "David Switzer",
			"indexsp": 1806,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "David Switzer is a red team operator who has 20+ years of experience in systems and network security. Some alphabet Soup: GSE #136, G[cia|cih|awn|sec|stuff]), OSCE, CISSP and ITILv3 (I keep it gangsta). His obsessions/amusements include RF, wireless networks, hardware hacking, and other expensive time sinks."
		},
		{
			"sptitle": "",
			"who": "Jonathan Echavarria",
			"indexsp": 1807,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Jonathan Echavarria has over half a decade of experience. Certs:OSCE, OSCP and CEH."
		},
		{
			"sptitle": "",
			"who": "Beau Bullock",
			"indexsp": 1808,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Beau is a Senior Security Analyst at Black Hills Information Security and has held positions in the financial and health industries. He has experience with all aspects of enterprise network security including penetration testing, and vulnerability analysis. Beau is the developer of the PowerShell tool MailSniper, a Hack Naked TV host, and frequent speaker at industry events. @dafthack on Twitter."
		},
		{
			"sptitle": "",
			"who": "Mike Felch",
			"indexsp": 1809,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Mike is currently a red teamer / pentester for Black Hills Information Security. He began his career in 1997 as a Linux Administrator which eventually led to numerous offensive security roles, software development and hardware/software security research. Mike is also a lead forensics instructor for TeelTech, an Officer for OWASP Orlando (Chief Breaker) and an organizer for BSides Orlando."
		},
		{
			"sptitle": "",
			"who": "Jon Haas",
			"indexsp": 1810,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Jonathan Haas is the Managing Principal at Jet Set Security, where he leads the development of Information Security programs for multiple partners globally. Previously, Haas designed and implemented multiple highly acclaimed static analysis tools at various Fortune 10 companies. He presents at conferences around the world, as well as leading roundtable discussions for security professionals on risk management, corporate security and insider threat."
		},
		{
			"sptitle": "",
			"who": "Alex Lynch",
			"indexsp": 1811,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Alex Lynch is a student of Computer Science at the University of Central Florida. As a competing member of Knightsec, Hack@UCF’s offensive security team, he has won multiple computer security competitions including Cyberseed CTF and RIT’S CPTC. Currently working part-time as a security consultant, Alex specializes in web application security but also sometimes spends his time shooting down WiFi enabled drones."
		},
		{
			"sptitle": "",
			"who": "Dennis Murphy",
			"indexsp": 1812,
			"last_update": "2018-02-02T12:00:00-07:00",
			"media": "",
			"bio": "Designing, installing and maintaining process automation networks is where I started my career 25 years ago. Most of my experience with SCADA systems was integrating data between the IT and OT networks. In 2005, I realized how security was more of an afterthought in my work and I shifted my focus to securing ICS networks. Now I am turning into a network security monitoring (NSM) professional and using this technology to help ICS engineers understand the impacts their design decisions have on the security of control system networks. I focus on providing practical solutions to meet national critical infrastructure cyber security requirements. My main interest is in bridging the gap between the information technology (IT) security requirements and operational technology (OT) security requirements. Those requirements are not synchronized and causes much confusion and heartache in the industry."
		}
	],
	"update_date": "2018-02-02T10:00:00-07:00"
}
