{
  "schedule": [
    {
      "description": "When my implant gets discovered how will I know? Did the implant stop responding for some benign reason or is the IR team responding? With any luck they'll upload the sample somewhere public so I can find it, but what if I can find out if they start looking for specific bread crumbles in public data sources? At some point without any internal data all blue teams turn to OSINT which puts their searches within view of the advertising industry. In this talk I will detail how I was able to use online advertising to detect when a blue team is hot on my trail.",
      "speakers": [
        26001
      ],
      "title": "Detecting Blue Team Research Through Targeted Ads",
      "id": 26001,
      "link": "",
      "updated_at": "2018-07-02T13:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26001,
      "start_date": "2018-08-11T20:30+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "Programmable Logic Controllers (PLCs) are devices used on a variety of industrial plants, from small factories to critical infrastructures like nuclear power plants, dams and wastewater systems. Although PLCs were made robust to sustain tough environments, little care was taken to raise defenses against potential cyber threats. As a consequence, threats started pouring in and causing havoc. During this presentation I will talk about the architecture of a PLC and how it can be p0wned. There will be some live demonstration attacks against 3 different brands of PLCs (if the demo demons allow it, if not I will just show a video). Additionally, I will demonstrate two vulnerabilities I recently discovered, affecting the Rockwell MicroLogix 1400 series and the Schneider Modicon M221 controllers.",
      "speakers": [
        26002
      ],
      "title": "Hacking PLCs and Causing Havoc on Critical Infrastructures",
      "id": 26002,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26002,
      "start_date": "2018-08-11T18:00+0000",
      "end_date": "2018-08-11T18:45+0000"
    },
    {
      "description": "Recently, the inspection of huge traffic log is imposing a great burden on security analysts. Unfortunately, there have been few research efforts focusing on scalablility in analyzing very large PCAP file with reasonable computing resources. Asura is a portable and scalable PCAP file analyzer for detecting anomaly packets using massive multithreading. Asura's parallel packet dump inspection is based on task-based decomposition and therefore can handle massive threads for large PCAP file without considering tidy parameter selection in adopting data decomposition. Asura is designed to scale out in processing large PCAP file by taking as many threads as possible. \nAsura takes two steps. First, Asura extracts feature vector represented by associative containers of <sourceIP, destIP> pair. By doing this, the feature vector can be drastically small compared with the size of original PCAP files.  In other words, Asura can reduce packet dump data into the size of unique <sourceIP, destIP> pairs (for example, in experiment, Asura's output which is reduced in first step is about 2% compared with the size of original libpcap files). Second, a parallel clustering algorithm is applied for the feature vector which is represented as {<sourceIP, destIP>, V[i]} where V[i] is aggregated flow vector. In second step, Asura adopts an enhanced Kmeans algorithm. Concretely, two functions of Kmeans which are (1)calculating distance and (2)relabeling points are improved for parallel processing. \nIn experiment, in processing public PCAP datasets, Asura can identified 750 packets which are labeled as malicious from among 70 million (about 18GB) normal packets. In a nutshell, Asura successfully found 750 malicious packets in about 18GB packet dump. For Asura to inspect 70 million packets, it took reasonable computing time of around 350-450 minutes with 1000-5000 multithreading by running commodity workstation. Asura will be released under MIT license and available at author's GitHub site on the first day of DEF CON 26.",
      "speakers": [
        26003
      ],
      "title": "Asura: A huge PCAP file analyzer for anomaly packets detection using massive multithreading",
      "id": 26003,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Tool",
      "location": 26003,
      "start_date": "2018-08-12T20:30+0000",
      "end_date": "2018-08-12T20:50+0000"
    },
    {
      "description": "Though many security mechanisms are deployed in Apple's macOS and iOS systems, some old-fashioned or poor-quality kernel code still leaves the door widely open to attackers. Especially, as kernel's critical components, device drivers are frequently exploited to attack Apple systems. In fact, bug hunting in Apple kernel drivers is not easy since they are mostly closed-source and heavily relying on object-oriented programming. In this talk, we will share our experience of analyzing and attacking Apple kernel drivers. In specific, we will introduce a new tool called Ryuk. Ryuk employs static analysis techniques to discover bugs by itself or assist manual review. \nIn addition, we further combine static analysis with dynamic fuzzing for bug hunting in Apple drivers. In specific, we will introduce how we integrate Ryuk to the state-of-art Apple driver fuzzer, PassiveFuzzFrameworkOSX, for finding exploitable bugs. \n Most importantly, we will illustrate Ryuk's power with several new vulnerabilities that are recently discovered by Ryuk. In specific, we will show how we exploit these vulnerabilities for privilege escalation on macOS 10.13.3 and 10.13.2. We will not only explain why these bugs occur and how we find them, but also demonstrate how we exploit them with innovative kernel exploitation techniques.",
      "speakers": [
        26004,
        26005
      ],
      "title": " One bite and all your dreams will come true: Analyzing and Attacking Apple Kernel Drivers",
      "id": 26004,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26004,
      "start_date": "2018-08-12T21:00+0000",
      "end_date": "2018-08-12T21:45+0000"
    },
    {
      "description": "In this paper, a new replay attack based on Ethereum smart contracts is presented. In the token transfer, the risk of replay attack cannot be completely avoided when the sender's signatures are abused, which can bring the loss to users. And the reason is that the applying scope of the signatures is not properly designed in the smart contracts. To test and verify this loophole, we selected two similar smart contracts for our experiment, at the same time, we used our own accounts in these two contracts to carry out the experiment. Because the same signatures of the two contracts were used in the experiment, we got a double income from sender successfully. The experiment verified that the replay attack is really exist. Besides, the replay attack may exist in multiple smart contracts. We calculated the number of smart contracts with this loophole, as well as the corresponding transaction activities, which find some Ethereum smart contracts are risked for this loophole. According to the vulnerability of the contract signature, the risk level is calibrated and depicted. Furthermore, the replay attack pattern is extended to within contract, cross contract and cross chain, which provide the pertinence and well reference for protection. Finally, the countermeasures are proposed to fix this vulnerability.",
      "speakers": [
        26006,
        26007,
        26008,
        26009
      ],
      "title": "You may have paid more than you imagine—Replay Attacks on Ethereum Smart Contracts",
      "id": 26005,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26004,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T17:45+0000"
    },
    {
      "description": "Unless you've been living under a rock for the past 30 years or so, you probably know what a fax machine is.  For decades, fax machines were used worldwide as the main way of electronic document delivery. But this happened in the 1980s. Humanity has since developed far more advanced ways to send digital content, and fax machines are all in the past, right? After all, they should now be nothing more than a glorified museum item. Who on earth is still using fax machines? \nThe answer, to our great horror, is EVERYONE. State authorities, banks, service providers and many others are still using fax machines, despite their debatable quality and almost non-existent security. In fact, using fax machines is often mandatory and considered a solid and trustworthy method of delivering information. \nWhat the Fax?! We embarked on a journey with the singular goal of disrupting this insane state of affairs. We went to work, determined to show that the common fax machine could be compromised via mere access to its fully exposed and unprotected telephone line -- thus completely bypassing all perimeter security protections and shattering to pieces all modern-day security concepts. \nJoin us as we take you through the strange world of embedded operating systems, 30-year-old protocols, museum grade compression algorithms, weird extensions and undebuggable environments. See for yourself first-hand as we give a live demonstration of the first ever full fax exploitation, leading to complete control over the entire device as well as the network, using nothing but a standard telephone line. \nThis talk is intended to be the canary in the coal mine. The technology community cannot sit idly by while this ongoing madness is allowed to continue. The world must stop using FAX!",
      "speakers": [
        26010,
        26011
      ],
      "title": "What the Fax!?",
      "id": 26006,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit, Audience Participation",
      "location": 26001,
      "start_date": "2018-08-12T22:00+0000",
      "end_date": "2018-08-12T22:45+0000"
    },
    {
      "description": "Are you a malware developer for Android devices? We have very bad news for you: the Android-SDK packager (aapt) is leaking your time zone! We have found a bug inside this Android-SDK's component that relies in not properly setting the value of a variable used as an argument for localtime() function, when setting the \"Last Modified\" field for the Android App's files. Because of this, the time zone of anyone using the Android-SDK packager to generate their APKs is leaked. The curious thing is that, despite of this bug inside aapt, the problem goes even beyond aapt itself: its roots goes deep into an incorrect handling errors in the operative system functions localtime() (Windows) and localtime_r() (UNIX). \nBecause of in the world of Threat Intelligence determining the attacker's geographical location of is one of the most valuable data for attribution techniques, we focused our research in taking advantage of this bug for tracking Android malware developers. In addition to this, we have discovered another very effective way to find out the developer's time zone, based on a calculation of times extracting the GMT timestamp from the Android's app files and the UTC timestamp of the self-signed,\"disposable\" certificate added to the application (most common cases in malware developers). This is what we call: Rock appround the clock! Using these two different techniques, we have crunched some numbers with our 10 million apps database to determine how these leaked time zones (with one or another technique) are related with malware and which are the countries that generate more Android malicious applications, what is the possible relation between time zone and\"malware likelihood\" among other interesting numbers. \nBut that's not all, we have another bad news for malware developers: no IDE (even Android Studio) removes metadata from the files added to the Android app. We will show examples with real cases in which, after analyzing the metadata of files inside the .apk, we got to know country, language, or even more specific geographical location of the developer and -in some cases- the name of the suppose-to-be-anonymous developer! Finally, we will share the scripts we have built to get all this information with just a simple click.",
      "speakers": [
        26012,
        26013
      ],
      "title": "Rock appround the clock: Tracking malware developers by Android \"AAPT\" timezone disclosure bug",
      "id": 26007,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26003,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T17:45+0000"
    },
    {
      "description": "Advanced malware such as TDL4, Rovnix, Gapz, Omasco, Mebromi and others have exposed in recent years various techniques used to circumvent the usual defenses and have shown how much companies are not prepared to deal with these sophisticated threats. \r\nAlthough the industry has implemented new protections such as Virtualized Based Security, Windows SMM Security Mitigation Table (WSMT), Kernel Code Signing, HVCI, ELAM, Secure Boot, Boot Guard, BIOS Guard, and many others, it is still unknown the professionals of the architecture of these protections, what are the components attacked by these contemporary malwares in the context of BIOS / UEFI and what are the tricks used by them. Precisely because of the lack of adequate understanding, most machines (BIOS / UEFI + operating system) remain vulnerable in the same way as a few years ago. \r\nIn addition, there are a growing number of malwares that have used kernel drivers to circumvent limitations and protections in order to gain full access to the operating system and data. Exactly for these reasons, it is necessary to understand the way that malwares act as device drivers and what are the mechanisms used by these threats to infect an operating system. \r\nThe purpose of this presentation is to show clearly and without too much details that often hinders understanding, how these threats act, which components are attacked, what are the techniques used by these advanced malware to subvert the system and how existing protections work .",
      "speakers": [
        26014
      ],
      "title": "Ring 0/-2 Rootkits: bypassing defenses",
      "id": 26008,
      "link": "",
      "updated_at": "2018-07-02T13:58+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26002,
      "start_date": "2018-08-09T19:00+0000",
      "end_date": "2018-08-09T19:45+0000"
    },
    {
      "description": "We all protect our home networks, but how safe is your data once it leaves on its journey to the latest cat pictures? How does your traffic make it to its destination and what threats does it face on its way? What is BGP and why should you care? \n\n\t\nIn this talk, I'll explain the basic structure of the network that is the Internet and the trust relationships on which it is built.  We'll explore several types of attacks that you may have seen in the news that exploit this relationship to bring down websites, steal cryptocurrency, and monitor dissidents. \n\n\t\nBecause talking about bringing down the Internet isn't as much fun as doing, I'll show how to create a mini Internet using Mininet and demonstrate the attacks without the need for a BGP router or a lawyer. Finally, because nation states shouldn't get to have all the fun, I'll use Scapy and some novel techniques to demonstrate how a compromised router can be used to prevent attribution, frame a friend, or create a covert communication channel.",
      "speakers": [
        26015
      ],
      "title": "Trouble in the tubes: How internet routing security breaks down and how you can do it at home",
      "id": 26009,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26002,
      "start_date": "2018-08-12T20:00+0000",
      "end_date": "2018-08-12T20:45+0000"
    },
    {
      "description": "With \"Trust none over the Internet\" mindset, securing all communication between a client and a server with protocols such as TLS has become a common practice. However, while the communication over Internet is routinely secured, there is still an area where such security awareness is not seen: inside individual computers, where adversaries are often not expected. \nThis talk discusses the security of various inter-process communication (IPC) mechanisms that local processes and applications use to interact with each other. In particular, we show IPC-related vulnerabilities that allow a non-privileged process to steal passwords stored in popular password managers and even second factors from hardware tokens. With passwords being the primary way of authentication, the insecurity of this \"last mile\" causes the security of the rest of the communication strands to be obsolete. The vulnerabilities that we demonstrate can be exploited on multi-user computers that may have processes of multiple users running at the same time. The attacker is a non-privileged user trying to steal sensitive information from other users. Such computers can be found in enterprises with centralized access control that gives multiple users access to the same host. Computers with guest accounts and shared computers at home are similarly vulnerable.",
      "speakers": [
        26016,
        26017
      ],
      "title": "Last mile authentication problem: Exploiting the missing link in end-to-end secure communication",
      "id": 26010,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26003,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T19:45+0000"
    },
    {
      "description": "Windows Defender Antivirus's mpengine.dll implements the core of Defender's functionality in an enormous ~11 MB, 30,000+ function DLL. \nIn this presentation, we'll look at Defender's emulator for analysis of potentially malicious Windows binaries on the endpoint. To the best of my knowledge, there has never been a conference talk or publication on reverse engineering any antivirus binary emulator before. \nWe'll cover a range of topics including emulator internals—machine code to intermediate language translation and execution; memory management; Windows API emulation; NT kernel emulation; file system and registry emulation; integration with Defender's antivirus features; the virtual environment; etc.—building custom tooling for instrumenting the emulator; tricks that binaries can use to evade or subvert analysis; and attack surface within the emulator. \nAttendees will leave with an understanding of how modern antivirus software conducts emulation-based dynamic analysis on the endpoint, and how attackers might go about subverting or attacking these systems. I'll publish code for a binary for exploring the emulator from within, patches that I developed for instrumenting Defender built on top of Tavis Ormandy's loadlibrary project, and IDA scripts to help with analyzing mpengine.dll and Defender's \"VDLLs\"",
      "speakers": [
        26018
      ],
      "title": "Reverse Engineering Windows Defender's Emulator",
      "id": 26011,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-11T22:00+0000",
      "end_date": "2018-08-11T22:45+0000"
    },
    {
      "description": "Mobile phones are quite complicated and feature multiple embedded processors handling wifi, cellular connectivity, bluetooth, and other signal processing in addition to the application processor. Have you ever been curious about how your phone actually makes calls and texts on a low level? Or maybe you want to learn more about the internals of the baseband but have no clue where to start. We will dive into the internals of a qualcomm baseband, tracing it's evolution over the years until its current state. We will discuss the custom, in-house DSP architecture they now run on, and the proprietary RTOS running on it. We will also cover the architecture of the cellular stack, likely places vulnerabilities lie, and exploit mitigations in place. Finally we will cover debugging possibilities, and how to get started analyzing the baseband firmware—how to differentiate between RTOS and cellular functions, how to find C std library functions, and more.",
      "speakers": [
        26019
      ],
      "title": "A Journey Into Hexagon: Dissecting a Qualcomm Baseband",
      "id": 26012,
      "link": "",
      "updated_at": "2018-07-02T13:59+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26002,
      "start_date": "2018-08-09T20:00+0000",
      "end_date": "2018-08-09T20:45+0000"
    },
    {
      "description": "The arbiters of defense wield many static analysis tools; disassemblers, PE viewers, and anti-viruses are among them. When you peer into their minds, these tools reveal their perilous implementations of PE file parsing. They assume PE files come as-is, but the Windows Loader actually applies many mutations (some at the command of the PE itself) before execution ever begins. This talk is about bending that loader to one's whim with the Relocations Table as a command spell. It will demonstrate how the loader can be instrumented into a mutation engine capable of transforming an utterly mangled PE file into a valid executable. This method starts with multiple ASLR Preselection attacks that force binary mapping at a predictable address. It then mangles the PE file, garbling any byte not required prior to relocation. Finally, it embeds a new Relocations Table which, when paired with a preselected base address, causes the loader to reconstruct the PE and execute it with ease. This isn't a packer or a POC, it is a PE rebuilder which generates completely valid, stable, and vastly tool-breaking executables. This talk will show you how this attack twists the protocols of a machine against the controls meant to protect it. It flexes on tools with various look-what-I-can-break demonstrations and, if you write similar tools, it'll make you rethink how you do it.",
      "speakers": [
        26020
      ],
      "title": "Relocation Bonus: Attacking the Windows Loader Makes Analysts Switch Careers",
      "id": 26013,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-12T00:00+0000",
      "end_date": "2018-08-12T00:45+0000"
    },
    {
      "description": "Antidrone system industries have arised. Due to several, and even classic, vulnerabilities in communication systems now used by drones , anti-drone systems are able to take down those drone by means of well documented attacks. \nDrone/antidrone competition has already been set into the scene. This talk provides a new vision about drone protection against anti-drone systems, presenting \"The Interceptor Project\", a hand-sized nano drone based on single-core tiniest Linux Board: Vocore2. \nThis Linux board manages a WiFi (side/hidden) bidirectional channel communication that cannot be deauthenticated and it is replay-resistant, keeping all 802.11 hacking capabilities and standard utilities as any other WiFi hacker drone, with only the built-in adapter of the tiny Vocore2. Also, a \"just in case\", fallback control by SDR is implemented taking advantage of all the goods that SDR radio gives.  All embedded into a hand-sized aircraft to make detection and mitigation a real and new pain, with a very low budget: About $70.",
      "speakers": [
        26021
      ],
      "title": "Project Interceptor: avoiding counter-drone systems with nanodrones",
      "id": 26014,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Audience Participation",
      "location": 26002,
      "start_date": "2018-08-11T22:00+0000",
      "end_date": "2018-08-11T22:45+0000"
    },
    {
      "description": "Sniffing and attacking Bluetooth Low Energy devices has always been a real pain. Proprietary tools do the job but cannot be tuned to fit our offensive needs, while opensource tools work sometimes, but are not reliable and efficient. Even the recently released Man-in-the-Middle BLE attack tools have their limits, like their complexity and lack of features to analyze encrypted or short connections. \nFurthermore, as vendors do not seem inclined to improve the security of their devices by following the best practices, we decided to create a tool to lower the ticket: BtleJack. BtleJack not only provides an affordable and reliable way to sniff and analyze Bluetooth Low Energy devices and their protocol stacks, but also implements a brand new attack dubbed \"BtleJacking\" that provides a way to take control of any already connected BLE device. \nWe will demonstrate how this attack works on various devices, how to protect them and avoid hijacking and of course release the source code of the tool. \nVendors, be warned: BLE hijacking is real and should be considered in your threat model.",
      "speakers": [
        26022
      ],
      "title": "You'd better secure your BLE devices or we'll kick your butts !",
      "id": 26015,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26001,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T19:45+0000"
    },
    {
      "description": "DEF CON Closing Ceremonies",
      "speakers": [
        26025
      ],
      "title": "DEF CON Closing Ceremonies",
      "id": 26017,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Particption",
      "location": 26003,
      "start_date": "2018-08-12T23:00+0000",
      "end_date": "2018-08-13T00:45+0000"
    },
    {
      "description": "The term\"smart city\" evokes imagery of flying cars, shop windows that double as informational touchscreens, and other retro-futuristic fantasies of what the future may hold. Stepping away from the smart city fantasy, the reality is actually much more mundane. Many of these technologies have already quietly been deployed in cities across the world. In this talk, we examine the security of a cross-section of smart city devices currently in use today to reveal how deeply flawed they are and how the implications of these vulnerabilities could have serious consequences. \nIn addition to discussing newly discovered pre-auth attacks against multiple smart city devices from different categories of smart city technology, this presentation will discuss methods for how to figure out what smart city tech a given city is using, the privacy implications of smart cities, the implications of successful attacks on smart city tech, and what the future of smart city tech may hold.",
      "speakers": [
        26026,
        26027,
        26028
      ],
      "title": "Outsmarting the Smart City",
      "id": 26018,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26002,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-11T23:45+0000"
    },
    {
      "description": "Ten years ago, DEF CON 101 was founded by HighWiz as a way to introduce n00bs to DEF CON.  The idea was to help attendees get the best experience out of DEF CON (and also tell them how to survive the weekend!).  The DEF CON 101 panel has been a way for people who have participated in making DEF CON what it is today to share those experiences and, hopefully, inspire attendees to expand their horizons.  DEF CON offers so much more than just talks and the DEF CON 101 panel is the perfect place to learn about all things DEF CON so you, dear reader, can  get the best experience possible.  The panel will end with the time honored tradition of \"Name the n00b\" where lucky attendees will be brought up on stage to introduce themselves to you and earn the coveted 101 n00b handle.  Don't worry if you don't make it on to the stage, there will be plenty of other prizes for you to enjoy!",
      "speakers": [
        26029,
        26030,
        26031,
        26032,
        26033,
        26034,
        26035
      ],
      "title": "DEF CON 101 Panel",
      "id": 26019,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation",
      "location": 26002,
      "start_date": "2018-08-09T22:30+0000",
      "end_date": "2018-08-10T00:15+0000"
    },
    {
      "description": "Healthcare cybersecurity is in critical condition. That's not FUD, that's the bottom line from the Congressionally mandated Health Care Industry Cybersecurity Task Force report released just last year, a year which also saw the twin specters of WannaCry and NotPetya take down entire hospital systems while over half a million implanted pacemakers were recalled in the fallout of one of the most (ir?)responsible disclosures in recent memory. It's enough to make any concerned white hat reach for a stiff drink. And that's where we come in. After an incredibly successful, near-fire-code-violating jam packed session at DC25 as an Evening Lounge, 'D0 N0 H4rm' is diving deeper and going longer as it transforms into a Fireside Hax, assembling an even larger and more distinguished panel of expert hackers, policymakers, wonks, and health care providers to continue discussing, dissecting, and most importantly, debating the ways to keep patients safe in an increasingly perilous space. Featuring continuous audience interaction and with the same loose and informal flow that characterized the initial, libation rich hotel room gatherings, moderators quaddi and r3plicant invite you to add your voice to this incredibly important conversation. Pin this one down quickly, pre-registration is going to go fast.",
      "speakers": [
        26036,
        26037,
        26038,
        26039,
        26040,
        26041,
        26042,
        26043
      ],
      "title": "D0 N0 H4RM: A Healthcare Security Conversation",
      "id": 26020,
      "link": "",
      "updated_at": "2018-07-02T14:01+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26005,
      "start_date": "2018-08-10T16:00+0000",
      "end_date": "2018-08-11T00:00+0000"
    },
    {
      "description": "Why does my bank's website require my MFA token but Quicken sync does not? How is using Quicken or any personal financial software different from using my bank's website? How are they communicating with my bank? These questions ran through my head when balancing the family checkbook every month. \nAnswering these questions led me to deeply explore the 20 year old Open Financial Exchange (OFX) protocol and the over 3000 North American banks that support it. They led me to the over 30 different implementations running in the wild and to a broad and inviting attack surface presented by these banks' digital side doors. \nNow I'd like to guide you through how your Quicken, QuickBooks, Mint.com, or even GnuCash applications are gathering your checking account transactions, credit card purchases, stock portfolio, and tax documents. We'll watch them flow over the wire and learn about the jumble of software your bank's IT department deploys to provide them. We'll discuss how secure these systems are, that keep track of your money, and we'll send a few simple packets at several banks and count the number of security WTFs along the way. \nLastly, I'll demo and release a tool that fingerprints an OFX service, describes its capabilities, and assesses its security.",
      "speakers": [
        26044
      ],
      "title": "Your Bank's Digital Side Door",
      "id": 26021,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26002,
      "start_date": "2018-08-11T00:00+0000",
      "end_date": "2018-08-11T00:45+0000"
    },
    {
      "description": "Do you love DEF CON? Do you hate having to wait for it all year? Well, thanks to DEF CON groups, you're able to carry the spirit of DEF CON with you year round, and with local people, transcending borders, languages, and anything else that may separate us!\nIn this special event, your DEF CON groups team who works behind the scenes to make DCG possible will introduce themselves and provide status updates. After we're done talking, the remainder of time will be an informal open floor right there in the room to mingle and talk all things DCG.\nThere will be a:\nDesignated area in the room for those wanting to start/join a group\nDesignated area in the room for those wanting to share project ideas",
      "speakers": [
        26045,
        26046,
        26047,
        26048,
        26049,
        26050,
        26051
      ],
      "title": "PANEL: DEF CON GROUPS",
      "id": 26022,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation",
      "location": 26003,
      "start_date": "2018-08-12T22:00+0000",
      "end_date": "2018-08-12T22:45+0000"
    },
    {
      "description": "Financial institutions, home automation products, and offices near universal cryptographic decoders have increasingly used voice fingerprinting as a method for authentication. Recent advances in machine learning and text-to-speech have shown that synthetic, high-quality audio of subjects can be generated using transcripted speech from the target. Are current techniques for audio generation enough to spoof voice authentication algorithms? We demonstrate, using freely available machine learning models and limited budget, that standard speaker recognition and voice authentication systems are indeed fooled by targeted text-to-speech attacks. We further show a method which reduces data required to perform such an attack, demonstrating that more people are at risk for voice impersonation than previously thought.",
      "speakers": [
        26052,
        26053
      ],
      "title": "Your Voice is My Passport",
      "id": 26023,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26004,
      "start_date": "2018-08-10T23:00+0000",
      "end_date": "2018-08-10T23:45+0000"
    },
    {
      "description": "Your computer is not yours. You may have shelled out thousands of dollars for it.  It may be sitting right there on your desk.  You may have carved your name deep into its side with a blowtorch and chisel. But it's still not yours. Some vendors are building secret processor registers into your system's hardware, only accessible by shadowy third parties with trusted keys. We as the end users are being intentionally locked out and left in the dark, unable to access the heart of our own processors, while select organizations are granted full control of the internals of our CPUs. In this talk, we'll demonstrate our work on how to probe for and unlock these previously invisible secret registers, to break into all-powerful features buried deep within the processor core, to finally take back our own computers.",
      "speakers": [
        26054
      ],
      "title": "The ring 0 façade: awakening the processor's inner demons",
      "id": 26024,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26003,
      "start_date": "2018-08-11T20:30+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "Complexity is increasing. Trust eroding. In the wake of Spectre and Meltdown, when it seems that things cannot get any darker for processor security, the last light goes out. This talk will demonstrate what everyone has long feared but never proven: there are hardware backdoors in some x86 processors, and they're buried deeper than we ever imagined possible. While this research specifically examines a third-party processor, we use this as a stepping stone to explore the feasibility of more widespread hardware backdoors.",
      "speakers": [
        26054
      ],
      "title": "GOD MODE UNLOCKED: Hardware Backdoors in [redacted] x86 CPUs",
      "id": 26025,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26003,
      "start_date": "2018-08-10T21:00+0000",
      "end_date": "2018-08-10T21:45+0000"
    },
    {
      "description": " It began with the forging of the command line. And some things that should not have been forgotten, were lost. History became legend, legend became myth. \n  Sometimes you just need to pull out the third column of a CSV file. Sometimes you just need to sort IP addresses. Sometimes you have to pull out IP addresses from the third column and sort them, but only if the first column is a particular string and for some reason the case is random. \n  In this DEF CON 101 talk, we'll cover a ton of bash one-liners that we use to speed up our hacking. Along the way, we'll talk about the concepts behind each of them and how we apply various strategies to accomplish whatever weird data processing task comes up while testing exploits and attacking a network.",
      "speakers": [
        26055,
        26056
      ],
      "title": "One-liners to Rule Them All",
      "id": 26026,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26001,
      "start_date": "2018-08-10T18:00+0000",
      "end_date": "2018-08-10T18:45+0000"
    },
    {
      "description": "When purchasing a new domain name you would expect that you are the only one who can obtain a valid SSL certificate for it, however that is not always the case. When the domain had a prior owner(s), even several years prior, they may still possess a valid SSL certificate for it and there is very little you can do about it. \nUsing Certificate Transparency, we examined millions of domains and certificates and found thousands of examples where the previous owner for a domain still possessed a valid SSL certificate for the domain long after it changed ownership. We will review the results from our ongoing large scale quantitative analysis over past and current domains and certificates. We'll explore the massive scale of the problem, what we can do about it, how you can protect yourself, and a proposed process change to make this less of a problem going forwards. \nWe end by introducing BygoneSSL, a new tool and dashboard that shows an up to date view of affected domains and certificates using publicly available DNS data and Certificate Transparency logs. BygoneSSL will demonstrate how widespread the issue is, let domain owners determine if they could be affected, and can be used to track the number of affected domains over time.",
      "speakers": [
        26057,
        26058
      ],
      "title": "Lost and Found Certificates: dealing with residual certificates for pre-owned domains",
      "id": 26027,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-12T20:30+0000",
      "end_date": "2018-08-12T20:50+0000"
    },
    {
      "description": "Election Buster is an open source tool created in 2014 to identify malicious domains masquerading as candidate webpages and voter registration systems. During 2016, fake domains were used to compromise credentials of a Democratic National Committee (DNC) IT services company, and foreign adversaries probed voter registration systems. The tool now cross-checks domain information against open source threat intelligence feeds, and uses a semi-autonomous scheme for identifying phundraising and false flag sites via ensembled data mining and deep learning techniques. We identified Russian nationals registering fake campaign sites, candidates deploying defensive—and offensive—measures against their opponents, and candidates unintentionally exposing sensitive PII to the public. This talk provides an analysis of our 2016 Presidential Election data, and all data recently collected during the 2018 midterm elections. The talk also details technological and procedural measures that government offices and campaigns can use to defend themselves.",
      "speakers": [
        26059,
        26060
      ],
      "title": "Defending the 2018 Midterm Elections from Foreign Adversaries ",
      "id": 26028,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T17:45+0000"
    },
    {
      "description": "These days it's hard to find a business that doesn't accept faster payments. Mobile Point of Sales (mPOS) terminals have propelled this growth lowering the barriers for small and micro-sized businesses to accept non-cash payments. Older payment technologies like mag-stripe still account for the largest majority of all in-person transactions. This is complicated further by the introduction of new payment standards such as NFC. As with each new iteration in payment technology, inevitably weaknesses are introduced into this increasingly complex payment eco-system. \nIn this talk, we ask, what are the security and fraud implications of removing the economic barriers to accepting card payments; and what are the risks associated with continued reliance on old card standards like mag-stripe? In the past, testing for payment attack vectors has been limited to the scope of individual projects and to those that have permanent access to POS and payment infrastructure. Not anymore! \nIn what we believe to be the most comprehensive research conducted in this area, we consider four of the major mPOS providers spread across the US and Europe; Square, SumUp, iZettle and Paypal. We provide live demonstrations of new vulnerabilities that allow you to MitM transactions, send arbitrary code via Bluetooth and mobile application, modify payment values for mag-stripe transactions, and a vulnerability in firmware; DoS to RCE. Using this sampled geographic approach, we are able to show the current attack surface of mPOS and, to predict how this will evolve over the coming years. \nFor audience members that are interested in integrating testing practices into their organization or research practices, we will show you how to use mPOS to identify weaknesses in payment technologies, and how to remain undetected in spite of anti-fraud and security mechanisms.",
      "speakers": [
        26061,
        26062
      ],
      "title": "For the Love of Money: Finding and exploiting vulnerabilities in mobile point of sales systems",
      "id": 26029,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26004,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T17:45+0000"
    },
    {
      "description": "With the proliferation of Linux-based SoCs -- you've likely got one or two in your house, on your person or in your pocket -- it is often useful to look \"under the hood\" at what is running; Additionally, in-situ debugging may be unavailable due to read-only filesystems, memory is often limited, and other factors keep us from attacking a live device. This talk looks at attacking binaries outside their native environment using QEMU, the Quick Emulator, as well as techniques for extracting relevant content from devices and exploring them.",
      "speakers": [
        26063
      ],
      "title": "It's Assembler, Jim, but not as we know it: (ab)using binaries from embedded devices for fun and profit",
      "id": 26030,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26002,
      "start_date": "2018-08-10T19:00+0000",
      "end_date": "2018-08-10T19:45+0000"
    },
    {
      "description": "TLS 1.3 is the new secure communication protocol that should be already with us. One of its new features is 0-RTT (Zero Round Trip Time Resumption) that could potentially allow replay attacks. This is a known issue acknowledged by the TLS 1.3 specification, as the protocol does not provide replay protections for 0-RTT data, but proposed countermeasures that would need to be implemented on other layers, not at the protocol level. Therefore, the applications deployed with TLS 1.3 support could end up exposed to replay attacks depending on the implementation of those protections. \n      This talk will describe the technical details regarding the TLS 1.3 0-RTT feature and its associated risks. It will include Proof of Concepts (PoC) showing real-world replay attacks against TLS 1.3 libraries and browsers. Finally, potential solutions or mitigation controls would be discussed that will help to prevent those attacks when deploying software using a library with TLS 1.3 support.",
      "speakers": [
        26064,
        26065
      ],
      "title": "Playback: a TLS 1.3 story",
      "id": 26031,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26001,
      "start_date": "2018-08-10T22:00+0000",
      "end_date": "2018-08-10T22:45+0000"
    },
    {
      "description": "While most IoT accessory manufacturers have a narrow area of focus, Xiaomi, an Asian based vendor, controls a vast IoT ecosystem, including smart lightbulbs, sensors, cameras, vacuum cleaners, network speakers, electric scooters and even washing machines. In addition, Xiaomi also manufactures smartphones. Their products are sold not only in Asia, but also in Europe and North America. The company claims to have the biggest IoT platform worldwide.\n\n\nIn my talk, I will give a brief overview of the most common, Wi-Fi based, Xiaomi IoT devices. Their devices may have a deep integration in the daily life (like vacuum cleaners, smart toilet seats, cameras, sensors, lights).\n\n\nI will focus on the features, computational power, sensors, security and ability to root the devices. Let’s explore how you can have fun with the devices or use them for something useful, like mapping Wi-Fi signal strength while vacuuming your house. I will also cover some interesting things I discovered while reverse engineering Xiaomi's devices and discuss which protections were deployed by the developers (and which not).\n\n\nBe prepared to see the guts of many of these devices. We will exploit them and use them to exploit other devices.",
      "speakers": [
        26066
      ],
      "title": "Having fun with IoT: Reverse Engineering and Hacking of Xiaomi IoT Devices",
      "id": 26032,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26002,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T21:45+0000"
    },
    {
      "description": "White hat or critical grey hat trolling? Trolling as art? Trolling as hybrid warfare? Trolling as propaganda? In this Fireside Hax, we will challenge your assumptions about trolling. Trolls are attention hackers, using social and technical means to bait journalists, set agendas, game media gatekeepers, and direct audiences. Sometimes they also have fun. We will discuss a range of trolling techniques like sockpuppeting, dogpiling, doxing, attention honeypots, and cognitive denial of service attacks that we have not seen concisely catalogued elsewhere. We will also discuss high-profile examples of trolling such as\"training\" the Microsoft Tay chatbot, fake Antifa accounts, Russian sockpuppet accounts, and Phineas Fisher's use of Hacking Team's twitter account--and ask attendees to consider each as black hat attacks or grey hat attempts to point out critical societal vulnerabilities that should be\"patched.\" We will also talk about\"troll the troll\" accounts like ImposterBuster and YesYoureRacist and the role\"white hat trolls\" might play in auditing platforms or proposing platform-based controls. Time permitting, we will discuss art projects that trollishly critiqued the European Commission, Google AdSense, and the NSA. This will not be a lecture and it will not shy away from controversy. Join two members of the Media Manipulation Team at Data & Society to collectively consider the role trolling can play in pointing out the flaws in our attention/media landscape.",
      "speakers": [
        26067,
        26068,
        26069
      ],
      "title": "Beyond the Lulz:  Black-Hat Trolling, White-Hat Trolling, Attacking and Defending Our Attention Landscape",
      "id": 26033,
      "link": "",
      "updated_at": "2018-07-02T14:02+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26005,
      "start_date": "2018-08-11T16:00+0000",
      "end_date": "2018-08-12T00:00+0000"
    },
    {
      "description": "In recent years, Google has made many great efforts in exploit mitigation and attack surface reduction to strengthen the security of android system. It is becoming more and more difficult to remotely compromise Android phones especially Google’s Pixel phone.\r\n\r\n\r\nThe Pixel phone is protected by many layers of security. It was the only device that was not pwned in the 2017 Mobile Pwn2Own competition. But our team discovered a remote exploit chain—the first of its kind since the Android Security Rewards (ASR) program expansion, which could compromise The Pixel phone remotely. The exploit chain was reported to Android security team directly. They took it seriously and patched it quickly. Because of the severity and our detailed report, we were awarded the highest reward ($112,500) in the history of the ASR program.\r\n\r\n\r\nIn this talk we will detail how we used the exploit chain to inject arbitrary code into system_server process and get system user permissions. The exploit chain includes two bugs, CVE-2017-5116 and CVE-2017-14904. CVE-2017-5116 is a V8 engine bug related with Webassembly and SharedArrayBuffer. It is used to get remote code execution in sandboxed Chrome render process. CVE-2017-14904 is a bug in Android's libgralloc module that is used to escape from the sandbox. The way we used for sandbox escaping is very interesting, rarely talked about before. All details of vulnerabilities and mitigation bypassing techniques will be given in this talk.",
      "speakers": [
        26070,
        26071,
        26072
      ],
      "title": "Pwning \"the toughest target\": the exploit chain of winning the largest bug bounty in the history of ASR program",
      "id": 26034,
      "link": "",
      "updated_at": "2018-07-02T14:03+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26002,
      "start_date": "2018-08-09T18:00+0000",
      "end_date": "2018-08-09T18:45+0000"
    },
    {
      "description": "Many hackers like to contribute code, binaries, and exploits under pseudonyms, but how anonymous are these contributions really? In this talk, we will discuss our work on programmer de-anonymization from the standpoint of machine learning. We will show how abstract syntax trees contain stylistic fingerprints and how these can be used to potentially identify programmers from code and binaries. We perform programmer de-anonymization using both obfuscated binaries, and real-world code found in single-author GitHub repositories and the leaked Nulled.IO hacker forum.",
      "speakers": [
        26073,
        26074
      ],
      "title": "De-anonymizing Programmers from Source Code and Binaries",
      "id": 26035,
      "link": "",
      "updated_at": "2018-07-02T14:06+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26001,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T17:45+0000"
    },
    {
      "description": "Although vulnerabilities stemming from the deserialization of untrusted data have been understood for many years, unsafe deserialization continues to be a vulnerability class that isn't going away. Attention on Java deserialization vulnerabilities skyrocketed in 2015 when Frohoff and Lawrence published an RCE gadget chain in the Apache Commons library and as recently as last year's Black Hat, Muñoz and Miroshis presented a survey of dangerous JSON deserialization libraries. While much research and automated detection technology has so far focused on the discovery of vulnerable entry points (i.e. code that deserializes untrusted data), finding a \"gadget chain\" to actually make the vulnerability exploitable has thus far been a largely manual exercise. In this talk, I present a new technique for the automated discovery of deserialization gadget chains in Java, allowing defensive teams to quickly identify the significance of a deserialization vulnerability and allowing penetration testers to quickly develop working exploits. At the conclusion we will also be releasing a FOSS toolkit which utilizes this methodology and has been used to successfully develop many deserialization exploits in both internal applications and open source projects.",
      "speakers": [
        26075
      ],
      "title": "Automated Discovery of Deserialization Gadget Chains",
      "id": 26036,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Tool",
      "location": 26002,
      "start_date": "2018-08-10T23:00+0000",
      "end_date": "2018-08-10T23:45+0000"
    },
    {
      "description": "Cellular networks are connected with each other through a worldwide private, but not unaccessible network, called IPX network. Through this network user related information is exchanged for roaming purposes or for cross-network communication. This private network has been breached by criminals and nation states. Cellular networks are extremely complex and many attacks have been already been found e.g. DoS, location tracking, SMS interception, data interception. Many attacks have been seen in practice, but not all attack are understood and not all attack avenues using the IPX network have been explored. This presentation shows how a S9 interface in 4G networks, which is used for charging related user information exchange between operators can be exploited to perform fraud attacks. A demonstration with technical details will be given and guidance on practical countermeasures.",
      "speakers": [
        26076,
        26077
      ],
      "title": "4G—Who is paying your cellular phone bill?",
      "id": 26037,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26001,
      "start_date": "2018-08-10T21:00+0000",
      "end_date": "2018-08-10T21:45+0000"
    },
    {
      "description": "In the past two years, smart speakers have become the most popular IoT device, Amazon_ Google and Apple have introduced their own smart speaker products. Most of these smart speakers have natural language recognition, chat, music playback, IoT device control, shopping, and so on. Manufacturers use artificial intelligence technology to make smart speakers have similar human capabilities in the chat conversation. However, with the smart speakers coming into more and more homes, and the function is becoming more powerful, its security has been questioned by many people. People are worried that smart speakers will be hacked to leak their privacy, and our research proves that this concern is very necessary.\nIn this talk, we will present how to use multiple vulnerabilities to achieve remote attack some of the most popular smart speakers. Our final attack effects include silent listening, control speaker speaking content and other demonstrations. And we're also going to talk about how to extract firmware from BGA packages Flash chips such as EMMC, EMCP, NAND Flash, etc. In addition, it contains how to turn on debug interfaces and get root privileges by modifying firmware content and Re-soldering Flash chips, which can be of great help for subsequent vulnerability analysis and debugging. Finally, we will play several demo videos to demonstrate how we can remotely access some Smart Speaker Root permissions and use smart speakers for eavesdropping and playing voice.",
      "speakers": [
        26078,
        26079
      ],
      "title": " Breaking Smart Speakers: We are Listening to You.",
      "id": 26038,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26002,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T19:45+0000"
    },
    {
      "description": "When caching servers and load balancers became an integral part of the Internet's infrastructure, vendors introduced \"Edge Side Includes\" (ESI), a technology allowing malleability in caching systems. This legacy technology, still implemented in nearly all popular HTTP surrogates (caching/load balancing services), is dangerous by design and brings a yet unexplored vector for web-based attacks. \nThe ESI language consists of a small set of instructions represented by XML tags, served by the backend application server, which are processed on the Edge servers (load balancers, reverse proxies). Due to the upstream-trusting nature of Edge servers, ESI engines are not able to distinguish between ESI instructions legitimately provided by the application server and malicious instructions injected by a malicious party. We identified that ESI can be used to perform SSRF, bypass reflected XSS filters (Chrome), and perform Javascript-less cookie theft, including HTTPOnly cookies. \nIdentified affected vendors include Akamai, Varnish, Squid, Fastly, WebSphere, WebLogic, F5, and countless language-specific solutions (NodeJS, Ruby, etc.). This presentation will start by introducing ESI and visiting typical infrastructures leveraging it. We will then delve into identification, exploitation of popular ESI engines, and mitigation.",
      "speakers": [
        26080
      ],
      "title": "Edge Side Include Injection: Abusing Caching Servers into SSRF and Transparent Session Hijacking",
      "id": 26039,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26004,
      "start_date": "2018-08-12T20:30+0000",
      "end_date": "2018-08-12T20:50+0000"
    },
    {
      "description": "In his notorious book Leviathan, the XVII century English philosopher Thomas Hobbes stated that: we should give our obedience to an unaccountable sovereign otherwise what awaits us is a state of nature that closely resembles civil war—a situation of universal insecurity. It looks like a lot of current political leaders have red and found the teachings of Hobbes applicable to modern day online life.\r\nWe witness the rise of the Digital Leviathan. The same apps and applications that people use to connect, express opinions and dissatisfaction are used by governments (even democratic ones) to perform surveillance and censorship.\r\nThis talk will focus on evidence of Nation-State spying, performing surveillance, and censorship. The aim is to present a systematical approach of data regarding cyber attacks against political targets (NGO/political groups/media outlets/opposition), acquisition and/or use of spywares from private vendors, requested content/metadata from social media/content providers, and blocking of websites/censorship reported by multiple sources.\r\nThe findings of the research imply that: \r\n- 25 nations that have already used cyber offensive capabilities against political targets. \r\n- 60 nations acquired/developed spyware.\r\n- 117 nations requested content/metadata from social media/content providers.\r\n- 21 countries perform some level of censorship to online content.",
      "speakers": [
        26081,
        26082
      ],
      "title": "Digital Leviathan: a comprehensive list of Nation-State Big Brothers (from huge to little ones",
      "id": 26040,
      "link": "",
      "updated_at": "2018-07-02T14:09+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26001,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T21:20+0000"
    },
    {
      "description": "Pre-installed apps and firmware pose a risk due to vulnerabilities that can be pre-positioned on a device, rendering the device vulnerable on purchase. This means that the vulnerabilities are present even before the user enables wireless communications and starts installing third-party apps. To quantify the exposure of the Android end-users to vulnerabilities residing within pre-installed apps and firmware, we analyzed a wide range of Android vendors and carriers using devices spanning from low-end to flagship. Our primary focus was exposing pre-positioned threats on Android devices sold by United States (US) carriers, although our results affect devices worldwide. We will provide details of vulnerabilities in devices from all four major US carriers, as well two smaller US carriers, among others. The vulnerabilities we discovered on devices offered by the major US carriers are the following: arbitrary command execution as the system user, obtaining the modem logs and logcat logs, wiping all user data from a device (i.e., factory reset), obtaining and modifying a user’s text messages, sending arbitrary text messages, and getting the phone numbers of the user’s contacts, and more. All of the aforementioned capabilities are obtained outside of the normal Android permission model. Including both locked and unlocked devices, we provide details for 37 unique vulnerabilities affecting 25 Android devices with 11 of them being sold by US carriers. In this talk, we will present our framework that is capable of discovering 0-day vulnerabilities from binary firmware images and applications at scale allowing us to continuously monitor devices across different manufacturers and firmware versions. During the talk, we plan to perform a live demo of how our system works.",
      "speakers": [
        26083,
        26084
      ],
      "title": "Vulnerable Out of the Box: An Evaluation of Android Carrier Devices",
      "id": 26041,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation, Exploit",
      "location": 26003,
      "start_date": "2018-08-10T19:00+0000",
      "end_date": "2018-08-10T19:45+0000"
    },
    {
      "description": "",
      "speakers": [
        26085
      ],
      "title": "TBA",
      "id": 26042,
      "link": "",
      "updated_at": "2018-07-02T14:10+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26003,
      "start_date": "2018-08-10T18:00+0000",
      "end_date": "2018-08-10T18:45+0000"
    },
    {
      "description": "First, Dragnet collects dozens of OSINT data points on past and present social engineering targets. Then, using conversion data from previous engagements, Dragnet provides recommendations for use on your current targets: phishing templates, vishing scripts and physical pretexts- all to increase conversions with minimal effort. Finally, features like landing page cloning and domain registration (alongside your standard infrastructure deployment, call scheduling and email delivery) make Dragnet one hell of a catch.",
      "speakers": [
        26086
      ],
      "title": "Dragnet—Your Social Engineering Sidekick",
      "id": 26043,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26003,
      "start_date": "2018-08-10T20:30+0000",
      "end_date": "2018-08-10T20:50+0000"
    },
    {
      "description": "You buy a brand-new smartwatch. You receive emails and send messages, right on your wrist. How convenient, this mighty power! But great power always comes with great responsibility. Smartwatches hold precious information just like smartphones, so do they actually fulfill their responsibilities?\n\n\nIn this talk, we will investigate if the Samsung Gear smartwatch series properly screens unauthorized access to user information. More specifically, we will focus on a communication channel between applications and system services, and how each internal Tizen OS components play the parts in access control.\n\n\nBased on the analysis, we have developed a new simple tool to discover privilege violations in Tizen-based products. We will present an analysis on the Gear smartwatch which turns out to include a number of vulnerabilities in system services.\n\n\nWe will disclose several previously unknown exploits in this presentation. They enable an unprivileged application to take over the wireless services, the user’s email account, and more. Further discussions will center on the distribution of those exploits through a registered application in the market, and the causes of the vulnerabilities in detail.",
      "speakers": [
        26087,
        26088
      ],
      "title": "Your Watch Can Watch You! Gear Up for the Broken Privilege Pitfalls in the Samsung Gear Smartwatch",
      "id": 26044,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26003,
      "start_date": "2018-08-12T21:00+0000",
      "end_date": "2018-08-12T21:45+0000"
    },
    {
      "description": "The mitigations for Spectre highlighted a weak link in the patching process for many users: firmware (un)availability. While updated microcode was made publicly available for many processors, end-users are unable to directly consume it. Instead, platform and operating system vendors need to distribute firmware and kernel patches which include the new microcode. Inconsistent support from those vendors has left millions of users without a way to consume these critical security updates, until now. Micro-Renovator provides the ability to apply microcode updates without modifying either platform firmware or the operating system, through simple (and reversible) modifications to the EFI boot partition.",
      "speakers": [
        26089
      ],
      "title": "Micro-Renovator: Bringing Processor Firmware up to Code",
      "id": 26045,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-12T20:00+0000",
      "end_date": "2018-08-12T20:20+0000"
    },
    {
      "description": "In the counter-future where we, the dissidents and hackers, have control of technology, sending secret messages through blinkenlights can let us exchange information without being detected by dystopian leaders. By modulating light in a way that the human eye cannot see, this simple, yet clever, covert channel lets us hide in plain sight. To decode such transmissions, we must employ some sort of optical receiver.\n\n\nEnter OpticSpy, an open source hardware module that captures, amplifies, and converts an optical signal from a visible or infrared light source into a digital form that can be analyzed or decoded with a computer. This presentation provides a brief history of covert channels and optical communications, explores the development process and operational details of OpticSpy, and gives a variety of demonstrations of the unit in action.",
      "speakers": [
        26090
      ],
      "title": "Searching for the Light: Adventures with OpticSpy",
      "id": 26046,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26002,
      "start_date": "2018-08-12T18:00+0000",
      "end_date": "2018-08-12T18:45+0000"
    },
    {
      "description": "In this session, we introduce an open source hardware and software framework for fuzzing arbitrary RF protocols, all the way down to the PHY.  While fuzzing has long been relied on by security researchers to identify software bugs, applying fuzzing methodologies to RF and hardware systems has historically been challenging due to siloed tools and the limited capabilities of commodity RF chipsets.\n\n\nWe created the TumbleRF fuzzing orchestration framework to address these shortfalls by defining core fuzzing logic while abstracting a hardware interface API that can be mapped for compatibility with any RF driver.  Thus, supporting a new radio involves merely extending an API, rather than writing a protocol-specific fuzzer from scratch.\n\n\nAdditionally, we introduce Orthrus, a low-cost 2.4 GHz offensive radio tool that provides PHY-layer mutability to offer Software Defined Radio-like features in a flexible and low-latency embedded form factor.  By combining the two, researchers will be able to fuzz and test RF protocols with greater depth and precision than ever before.\n\n\nAttendees can expect to leave this talk with an understanding of how RF and hardware physical layers actually work, and how to identify security issues that lie latent in these designs.",
      "speakers": [
        26091,
        26092
      ],
      "title": "Designing and Applying Extensible RF Fuzzing Tools to Expose PHY Layer Vulnerabilities",
      "id": 26047,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26004,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T19:45+0000"
    },
    {
      "description": "In 2017, FireEye conducted an incident response at a critical infrastructure facility where a sophisticated threat actor deployed the TRITON attack framework for implanting Safety Instrumented System (SIS) controllers with a passive backdoor, which would allow an attacker to inject potentially destructive payloads at a later point in time. TRITON is the most complex publicly known embedded system exploit to date. While the functionality of the malware is understood, little known about attacker efforts when developing such an implant. With a timeline of exploit development like TRITON being in a year range, complex embedded exploitation is currently considered to be a boutique hacking. However, the public release of much of the TRITON code can now facilitate less experienced threat actors with designing similar exploits. The goal of this talk is to provide the audience with a\"through the eyes of the attacker\" experience when designing advanced embedded systems exploits for Industrial Control Systems (ICS). This talk is based on our extensive experience in reverse engineering Real Time Operating Systems (RTOS)/firmwares and developing embedded exploits to cause physical damage. \nIn the first part of the talk we will explain how to convert an 'undocumented device' into malicious code. We will share how to purchase industrial equipment and obtain needed documentation. \nAfter obtaining control over an embedded system, an actual attack still need to be performed. In the second part of the talk will concentrate on discovering exploitable firmware and hardware design features which would allow an attacker to impact industrial controller functions. We will present several scenarios such as hijacking internal clock, suppressing interrupts (IRQ config attack) and manipulation of the interrupt vector table (IVT), CPU pin configuration attack and placing code into TCM cache so it would not be even visible in the memory. \nThe TRITON payload can be thought of as a four-stage shellcode. Attack code related to first three stages constituted a discussed backdoor implant capable of receiving and executing the fourth stage. This stage would have been an actual 'physical damage payload' performing the disruptive operations. However, the attacker was discovered while preparing the implant, before advancing to physical damage stage. In this part of the talk we will show how one can symbolically execute TRITON using ANGR framework and test a code for damage scenario written for any CPU/hardware architecture of choice. \nDeveloping embedded exploits requires a significant amount of effort but it is totally worth of investment. While a small fraction of asset owners is slowly embracing ICS network monitoring solutions, the attackers are going one layer lower—into the control equipment (race-to-the-bottom). Developing embedded implants is worth the efforts due to lacking tools for detecting such implants and we will see more of advanced embedded exploitation in the nearest future. \nNote to reviewers: current abstract is too long and probably would need to be shortened if the application is selected for the presentation",
      "speakers": [
        26093,
        26094,
        26095
      ],
      "title": "Through the Eyes of the Attacker: Designing Embedded Systems Exploits for Industrial Control Systems",
      "id": 26048,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26002,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T17:45+0000"
    },
    {
      "description": "2018 is the 20th anniversary of the hacker think-tank L0pht Heavy Industries testimony before the US Senate Homeland Security & Governmental Affairs Committee on the topic of weak computer security in government. The testimony made national news when the group announced they could take down the Internet in 30 minutes. It was also the first-time hackers using handles appeared before a US Legislative body. \nMembers of the L0pht have grown from their hacker roots to become distinguished leaders and contributors in the security community and beyond. They run multi-million dollar security-focused organizations, have lobbied the government for better security laws, work for some of the largest companies in the world, and continue to spread the message of the positive aspects of hacking. \nWith several of the L0pht's original members, this discussion will cover the original testimony and the changes that have happened over the last 20 years. Is the government any more secure? Have they provided enough influence to help protect its citizens' data? What steps should we take to ensure user security and privacy in the future? We are hoping for audience participation and also welcome questions about any other time in the L0pht's relatively short, but poignant, existence.",
      "speakers": [
        26096,
        26097,
        26098,
        26099,
        26100,
        26101,
        26102,
        26103,
        26104
      ],
      "title": "The L0pht Testimony, 20 Years Later (and Other Things You Were Afraid to Ask)",
      "id": 26049,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation",
      "location": 26001,
      "start_date": "2018-08-11T00:00+0000",
      "end_date": "2018-08-11T00:45+0000"
    },
    {
      "description": "While you may not always be aware of them or even have heard of them, Crestron devices are everywhere. They can be found in universities, modern office buildings, sports arenas, and even high-end Las Vegas hotel rooms. If an environment has a lot of audio/video infrastructure, needs to interconnect or automate different IoT and building systems, or just wants the shades to close when the TV is turned on, chances are high that a Crestron device is controlling things from behind the scenes. And as these types of environments become the norm and grow ever more complex, the number of systems that Crestron devices are connected to grows as well. But it is in large part because of this complexity that installing and programming these devices is difficult enough without considering adding security. Instead of being a necessity, it's an extra headache that almost always gets entirely passed over. In this talk, I will take a look at different Crestron devices from a security perspective and discuss the many vulnerabilities and opportunities for fun to be found within. I will demonstrate both documented and undocumented features that can be used to achieve full system compromise and show the need to make securing these systems a priority, instead of an afterthought, in every deployment. In short, hijinx will ensue.",
      "speakers": [
        26105
      ],
      "title": "Who Controls the Controllers—Hacking Crestron IoT Automation Systems",
      "id": 26050,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26004,
      "start_date": "2018-08-10T19:00+0000",
      "end_date": "2018-08-10T19:45+0000"
    },
    {
      "description": "NSA Playset is back just in time for the 1983 theme of DEF CON 26!  The NSA is the best Big Brother that we could have.  But, if you've always been asking yourself: Where does he get those wonderful toys?  You're in for some good news.  Now you can play along, too. \nWe're building covert listening devices!  Capturing audio of the target has long been an intelligence goldmine and modern developments in signal processing make the loot even more valuable.  While implanted listening devices has a large body of open knowledge, we explore an area with a dearth of public knowledge and years of covert use.  We'll show off several of the approaches we took, including an updated and modernized use of RF retroreflection. \nBest of all, we'll do the neighborly thing and publish the technical details of the things we get working—and the things that don't work—to make it accessible and easy to do it all at home.",
      "speakers": [
        26106
      ],
      "title": "NSAPlayset: Audio",
      "id": 26051,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26002,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T19:45+0000"
    },
    {
      "description": "Typically, the activities of a malware attack occur on an execution timeline that generally consists of 3 segments—the vector, the stage, and the persistence. First, a vector, or method of exploitation is identified. This could be anything from logging in over a credentialed method like RDP or SSH and running a malicious payload directly, to exploiting a memory corruption vulnerability remotely. Second, that access is leveraged into running malicious code that prepares the victim for the deployment of persistence (commonly \"implant\"). While segments one and three have been extensively automated, a effective automated utility for deploying persistence in a dynamic and unified context has yet to present itself. \nEnter the Genesis Scripting Engine. \nThe Genesis Scripting Engine, or Gscript for short, is a framework for building multi-tenant executors for several implants in a stager. The engine works by embedding runtime logic (powered by the V8 Javascript Virtual Machine) for each persistence technique. This logic gets run at deploy time on the victim machine, in parallel for every implant contained with the stager. The Gscript engine leverages the multi-platform support of Golang to produce final stage one binaries for Windows, Mac, and Linux. \nThis talk will consist of an overview of the origins of the project,  a technical deep dive into the inner workings including the modified Javascript VM, a walk through of the CLI utility, and examples of how we've leveraged Gscript in the real world. \nMultiple demos involving practical application scenarios will be presented, as well as an opportunity for audience members to submit their own implants and have them built into a hydra on stage in a matter of minutes.",
      "speakers": [
        26107,
        26108,
        26109
      ],
      "title": "I'll See Your Missile and Raise You A MIRV: An overview of the Genesis Scripting Engine",
      "id": 26052,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Audience Participation, Tool",
      "location": 26003,
      "start_date": "2018-08-11T00:00+0000",
      "end_date": "2018-08-11T00:45+0000"
    },
    {
      "description": "Ever worry about the hardware you leave behind? In a world where servers are co-located, and notebooks get left in hotel rooms, the ability to resist tampering, and if necessary actively respond to attack, has become increasingly important. And of course everybody knows the best booby traps are the ones you don't know are there. This talk will prepare you for life in 1984, where the maids are evil, and step brothers can't be trusted. Whether your running servers as a high value target, or simply want to protect your Monero private key, this talk will show you to achieve FIPS 140-2 level 4 security, without the FIPS 140-2 level 4 price tag. Specifically, we'll cover acquisition considerations, physical hardening, firmware mitigation, tamper detection and more.",
      "speakers": [
        26110,
        26111
      ],
      "title": "Booby Trapping Boxes",
      "id": 26053,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26004,
      "start_date": "2018-08-11T22:00+0000",
      "end_date": "2018-08-11T22:45+0000"
    },
    {
      "description": "Knox Boxes, along with other rapid entry systems are increasing in popularity, as they allow first responders such as police, fire, and paramedics to quickly gain access to a building in the event of an emergency without having to force entry. These devices rely on the security and key control provided by various locks to prevent unauthorized access to buildings. In this talk, I will focus on vulnerabilities of the widely used Knox Box and Medeco cam lock to key duplication attacks. I will demonstrate how a sufficiently skilled attacker could obtain a key that would grant them access to thousands of residential and commercial buildings throughout America, as well as show off new tools designed to streamline the process of duplicating physical keys using CAD and 3D printing. What could possibly go wrong when someone tries to backdoor an entire city?",
      "speakers": [
        26112
      ],
      "title": "Please do not Duplicate: Attacking the Knox Box and Other Keyed Alike Systems",
      "id": 26054,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26004,
      "start_date": "2018-08-10T17:30+0000",
      "end_date": "2018-08-10T17:50+0000"
    },
    {
      "description": "In the past, when hackers did malicious program code injection, they used to adopt RunPE, AtomBombing, cross-process creation threads, and other approaches. They could forge their own execution program as any critical system service. However with increasing process of anti-virus techniques, these sensitive approaches have been gradually proactively killed. Therefore, hackers began to aim at another place, namely memory-level weakness, due to the breakages of critical system service itself. \nThis agenda will simply introduce a new memory injection technique that emerged after 2013, PowerLoadEx. Based on this concept,  three new injection methods will be disclosed as well. These makes good use of the memory vulnerability in Windows to inject malicious behavior into system critical services. The content will cover Windows reverse analysis, memory weakness analysis, how to use and utilize, and so on. The relevant PoC will be released at the end of the agenda.",
      "speakers": [
        26113
      ],
      "title": "Playing Malware Injection with Exploit thoughts",
      "id": 26055,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26004,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T21:20+0000"
    },
    {
      "description": "Most of modern OS are using sandboxing in order to prevent malicious apps from affecting other apps or even harming the OS itself. Google is constantly reinforcing Android’s sandbox protection, introducing new features to prevent any kind of sandbox bypass.\n\n                                  \nIn this talk we want to shed new light on a less known attack surface which affects all Android devices and allows an attacker to hijack the communication between privileged apps and the disk, bypassing Android’s latest sandbox protection.\n\n \nThe problem begins when privileged apps interact with files stored in exposed areas, and even worse, some of them will unintentionally break the sandbox by insecurely appending such data to its confinements.\n\n \nCan you imagine if someone could execute code in the context of your keyboard, or install an unwanted app without your consent? Well… It’s hardly within the realm of imagination.\n\nThe external storage and network based vulnerabilities we discovered, can be leveraged by the attacker to corrupt data, steal sensitive information or even take control of your device.",
      "speakers": [
        26114
      ],
      "title": "Man-In-The-Disk",
      "id": 26056,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26003,
      "start_date": "2018-08-12T20:00+0000",
      "end_date": "2018-08-12T20:20+0000"
    },
    {
      "description": "Fair elections are at the core of every democracy and are of paramount importance to our national security. The confidence in our electoral process is fundamental to ensuring that every vote- and therefore every voice- matters. In recent years, our Nation has become increasingly uneasy about the potential threats to our election infrastructure. The activities to undermine the confidence in the 2016 presidential election have been well documented and the United States (U.S.) Government has assessed that our adversaries will apply lessons learned from the 2016 election and will continue in their attempts to influence the U.S. and their allies' upcoming elections, including the 2018 mid-term elections. As the lead agency for securing the Nation's cyber infrastructure, the Department of Homeland Security (DHS) has a mission to maintain public trust and protect America's election systems. In January 2017, the DHS Secretary designated election systems as critical infrastructure. This designation means election infrastructure has become a priority in shaping our planning and policy initiatives, as well as how we allocate our resources. DHS is working directly with election officials across 8,000 election jurisdictions and throughout 55 States and territories, to help them safeguard their systems. As the threat environment evolves, DHS will continue to work with state and local partners to enhance our understanding of the threat, share timely and actionable threat information, and provide essential physical and cybersecurity tools and resources available to the public and private sectors to increase security and resiliency. DHS is committed to ensuring that our adversaries never succeed with their campaign to undermine our democracy.",
      "speakers": [
        26115
      ],
      "title": "Securing our Nation's Election Infrastructure",
      "id": 26057,
      "link": "",
      "updated_at": "2018-07-02T14:10+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26004,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T17:20+0000"
    },
    {
      "description": "Given the high pace at which new malware variants are generated, antivirus programs struggle to keep their signatures up-to-date, and AV scanners suffer from a considerable quantity of false negatives. The generation of effective signatures against new malware variants, while avoiding false positive detections, is a highly desirable but challenging task, typically requiring a substantial portion of human expert’s time. Artificial intelligence techniques can be applied to solve the malware signature generation problem.\n\n\nThe ultimate goal is to develop an algorithm able to automatically create a generalized family signature, eventually reducing threat exposure and increasing the quality of the detection. The proposed technique automatically generates an optimal signature to identify a malware family with very high precision and good recall using heuristics, evolutionary and linear programming algorithms.\n\n\nIn this talk I will present YaYaGen (Yet Another YARA Rule Generator), a tool to automatically generate Android malware signatures. Performances have been evaluated on a massive dataset of millions of applications available in the Koodous project, showing that in a few minutes the algorithm can generate precise ruleset able to catch 0-day malware, better than human generated ones.",
      "speakers": [
        26116
      ],
      "title": "Looking for the perfect signature: an automatic YARA rules generation algorithm in the AI-era",
      "id": 26058,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26004,
      "start_date": "2018-08-11T20:00+0000",
      "end_date": "2018-08-11T20:20+0000"
    },
    {
      "description": "With the presense of 2FA/MFA solutions growing, the attack surface for external attackers that have successfully phished/captured/cracked credentials is shrinking. However, many 2FA/MFA solutions leave gaps in their coverage which can allow attackers to leverage those credentials. For example, while OWA may be protected with 2FA, the Exchange Web Services Management API (EWS) offers many of the same features and functionalities without the same protections.\n\n\n\nIn this talk, I will introduce ExchangeRelayX, an NTLM relay tool that provides attackers with access to an interface that resembles a victim's OWA UI and has many of its functionalities - without ever cracking the relayed credentials.  ExchangeRelayX takes advantage of the gap in some 2FA/MFA solutions protecting Exchange, potentially resulting in a single-click phishing scheme enabling an attacker to exfiltrate sensitive data, perform limited active-directory enumeration, and execute further internal phishing attacks.",
      "speakers": [
        26117
      ],
      "title": "One-Click to OWA",
      "id": 26059,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26004,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-11T21:50+0000"
    },
    {
      "description": "When it comes to taking advantage of SMB connections, most tools available to penetration testers aim for system enumeration or for performing relay attacks to gain RCE. If signatures are required, or if the victims relayed are not local admins anywhere, that can put a real stint in leveraging SMB to gain any serious footholds in a network. Fortunately, the mentioned attacks are only the tip of the iceberg of the ways to gain RCE with insecure SMB connections – and there’s a new tool to help take full advantage of these opportunities.",
      "speakers": [
        26117
      ],
      "title": "SMBetray—Backdooring and breaking signatures",
      "id": 26060,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26003,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T21:45+0000"
    },
    {
      "description": "Software is increasingly used to make huge decisions about people's lives and often these decisions are made with little transparency or accountability to individuals.  If there is any place where transparency, third-party review, adversarial testing and true accountability is essential, it is the criminal justice system. Nevertheless, proprietary software is used throughout the system, and the trade secrets of software vendors are regularly deemed more important than the rights of the accused to understand and challenge decisions made by these complex systems.  In this talk, we will lay out the map of software in this space from DNA testing to facial recognition to estimating the likelihood that someone will commit a future crime. We will detail the substantial hurdles that prevent oversight and stunning examples of real problems found when hard won third-party review is finally achieved.  Finally, we will outline what you as a concerned citizen/hacker can do.  Nathan Adams will demo his findings from reviewing NYC's FST source code, which was finally made public by a federal judge after years of the city's lab fighting disclosure or even review. Jerome Greco will provide his insight into the wider world of software used in the criminal justice system—from technology that law enforcement admits to using but expects the public to trust without question to technology that law enforcement denies when the evidence says otherwise. Jeanna Matthews will talk about the wider space of algorithmic accountability and transparency and why even open source software is not enough.",
      "speakers": [
        26118,
        26119,
        26120
      ],
      "title": "You're just complaining because you're guilty: A DEF CON Guide to Adversarial Testing of Software Used In the Criminal Justice System",
      "id": 26061,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26001,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T17:45+0000"
    },
    {
      "description": "Surveillance had been a fact of life for sex workers wherever they have faced prohibition. Only two elements, communication and association, can differentiate between commercial and personal sex, criminal enforcement of prostitution laws have necessarily meant targeting the speech and affiliation of perceived sex workers. Enforcement of this nature is facilitated by profiling, institutional bias, and broad overreaching policies that fundamentally violate individual human rights. This has included condoms as evidence, non-consensual medical screenings, and targeted harassment of black transgender women as well as license plate recording projects and stings that focus disrupting immigration or migrant workers.  \r\nFor all of its risks, screening potential clients is safer over email than it is in person during a street based negotiation often in an isolated part of town. SESTA (Stop Enabling Sex Traffickers Act) comes at a time when compelling research demonstrates that Craigslist resulted in a 17% drop in the female homicide rate. SESTA will also put victims at risk by delaying their identification and recovery by eliminating a digital paper trail. Additionally, Section 230 of the Communications Decency Act is a vital protection for a free internet. Subverting SESTA will create greater economic disparity between sex workers and ultimately empower pimps and agencies over independent  providers.",
      "speakers": [
        26121
      ],
      "title": "Sex Work After SESTA/FOSTA",
      "id": 26062,
      "link": "",
      "updated_at": "2018-07-02T14:11+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26001,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-11T21:50+0000"
    },
    {
      "description": "Containerization, such as that provided by Docker, is becoming very popular among developers of large-scale applications. The good news: this is likely to make your life easier as an attacker. \nWhile exploitation and manipulation of traditional monolithic applications might require specialized experience and training in the target languages and execution environment, applications made up of services distributed among multiple containers can be effectively explored and exploited \"from within\" using many of the system- and network-level techniques that attackers, such as penetration testers, already know. \nThe goal of this talk is to provide a hacker experienced in exploitation and post-exploitation of networks and systems with an exposure to containerization and the implications it has on offensive operations. Docker is used as a concrete example for the case study. A hacker can expect to leave this presentation with a practical exposure to multi-container application post-exploitation.",
      "speakers": [
        26122
      ],
      "title": "An Attacker Looks at Docker: Approaching Multi-Container Applications",
      "id": 26063,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26002,
      "start_date": "2018-08-10T18:00+0000",
      "end_date": "2018-08-10T18:45+0000"
    },
    {
      "description": "It seems each day that passes brings new technology and an increasing dependence upon it. The medical field is no exception; medical professionals rely upon technology to provide them with accurate information and base life-changing decisions on this data. \nIn recent years there has been more attention paid to the security of medical devices; however, there has been little research done on the unique protocols used by these devices. In large, health care systems medical personnel take advantage of to make decisions on patient treatment and other critical care, use central monitoring stations. This information is gathered from many devices on the network using uncommon networking protocols.  What if this information wasn't accurate when a doctor prescribed medication?  What if a patient was thought to be peacefully resting, when in fact they are under cardiac arrest? \nMcAfee's Advanced Threat Research team has discovered a weakness in the RWHAT protocol, one of the networking protocols used by medical devices to monitor a patient's condition.  This protocol is utilized in some of the most critical systems used in hospitals.  This weakness allows the data to be modified by an attacker in real-time to provide false information to medical personnel.   Lack of authentication also allows rogue devices to be placed onto the network and mimic patient monitors.   \nThis presentation will include a technical dissection of the security issues inherent in this relatively unknown protocol.  It will describe real-world attack scenarios and demonstrate the ability to modify the communications in-transit to directly influence the receiving devices.  We will also explore the general lack of security mitigations in the medical devices field, the risks they pose, and techniques to address them.  The talk will conclude with a demonstration using actual medical device hardware and a live modification of a patient's critical data.",
      "speakers": [
        26123
      ],
      "title": "80 to 0 in under 5 seconds: Falsifying a medical patient's vitals",
      "id": 26064,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26003,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-11T23:45+0000"
    },
    {
      "description": "Defenders have been slowly adapting to the new reality: Any organization is a target. They bought boxes that blink and software that floods the SOC with alerts. None of this matters as much as how administration is performed: Pop an admin, own the system. Admins are being dragged into a new paradigm where they have to more securely administer the environment. What does this mean for the pentester or Red Teamer? \nAdmins are gradually using better methods like two-factor and more secure administrative channels. Security is improving at many organizations, often quite rapidly. If we can quickly identify the way that administration is being performed, we can better highlight the flaws in the admin process. \nThis talk explores some common methods Active Directory administrators (and others) use to protect their admin credentials and the flaws with these approaches. New recon methods will be provided on how to identify if the org uses an AD Red Forest (aka Admin Forest) and what that means for one hired to test the organization's defenses, as well as how to successfully avoid the Red Forest and still be successful on an engagement.\nSome of the areas explored in this talk:\n\t",
      "speakers": [
        26124
      ],
      "title": "Exploiting Active Directory Administrator Insecurities",
      "id": 26065,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26003,
      "start_date": "2018-08-11T18:00+0000",
      "end_date": "2018-08-11T18:45+0000"
    },
    {
      "description": "The police body camera market has been growing in popularity over the last few years. A recent (2016) Johns Hopkins University market survey found 60 different models have been produced specifically for law enforcement use. Rapid adoption is fueling this meteoric increase in availability and utilization. Additionally, device manufactures are attempting to package more and more technology into these devices. This has caused a deficiency in local municipalities' skills and budget to accurately assess the attack surface and exposure to the organization. Furthermore, departmental policies and procedures governing the secure deployment of these devices is largely insufficient. \nAt DEF CON, we will be introducing tactics, techniques, and procedures to assess the security of these devices. We will cover attacks against the physical devices, RF components, smartphone app's, and desktop software. The capabilities demonstrated and discussed will encompass publicly and privately available technologies. Additionally, the talk will cover multiple products and vendors, shedding light on industry wide issues and trends. Finally, we will be releasing software to detect and track various devices and tie these issues into real world events.",
      "speakers": [
        26125
      ],
      "title": "Ridealong Adventures—Critical Issues with Police Body Cameras",
      "id": 26066,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26004,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T19:45+0000"
    },
    {
      "description": "Security researchers have done a good amount of practical attacks in the past using chosen plain-text attacks on compressed traffic to steal sensitive data. In spite of how popular CRIME and BREACH were, little was talked about how this class of attacks was relevant to VPN networks. Compression oracle attacks are not limited to just TLS protected data. In this talk, we try these attacks on browser requests and responses which usually tunnel their HTTP traffic through VPNs. We also show a case study with a well-known VPN server and their plethora of clients. We then go into practical defenses and how mitigations in HTTP/2's HPACK and other mitigation techniques are the way forward rather than claiming 'Thou shall not compress traffic at all.' One of the things that we would like to showcase is how impedance mismatches in these different layers of technologies affect security and how they don't play well together.",
      "speakers": [
        26126
      ],
      "title": "Compression Oracle Attacks on VPN Networks",
      "id": 26067,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-11T18:00+0000",
      "end_date": "2018-08-11T18:45+0000"
    },
    {
      "description": "Commercial Android emulators such as NOX, BlueStacks and Leidian are very popular at the moment and most games can run on these emulators fast and soundly. The bad news for game vendors is that these emulators are usually shipped with root permission in the first place. On the other hand, cheating tools developers are happy because they can easily distribute their tools to abusers without requiring the abusers to have a physical rooted device, nor do they need to perform laborious tuning for different Android OS / firmware version. However, luckily for game vendors, commercial Android emulators usually use an x86/ARM mixed-mode emulation for speed-up. As a result, a standard native hooking/DBI framework won't work on this kind of platform. This drawback could discourage the cheating developers. \nIn this talk, I will introduce a native hooking framework on such a kind of mixed-mode emulators. The talk will include the process start routine of both command-line applications and Android JNI applications as well as how these routines differ on an emulator. The different emulation strategies adopted by different emulators and runtime environments (Dalvik/ART) will also be discussed. Based on these knowledge, I will explain why the existing hooking/DBI frameworks do not work on these emulators and how to make one that works. \nLastly, I will present a demo of using this hooking framework to cheat a game on emulator. With this demo, I will discuss how the dark market of mobile game cheating may develop in the foreseeable future.",
      "speakers": [
        26127
      ],
      "title": "One Step Ahead of Cheaters -- Instrumenting Android Emulators",
      "id": 26068,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26002,
      "start_date": "2018-08-11T20:00+0000",
      "end_date": "2018-08-11T20:20+0000"
    },
    {
      "description": "We will present a sample scene and panel talk on our documentary series Reverse Engineering to the hacking community, which has been in the works for 4 years. We have dozens of interviews spanning the first 3 decades of computer hacking, ultimately there will be hundreds. It's a big story, but for the purposes of DEF CON, we've put together a 17 min. Scene covering the 80s WarGames/Legion of Doom-era of computer hacking in the US. \n We've spoken to great people, but there are other viewpoints—this is a history that needs to be told by 1st person accounts. The accuracy and strength of our completed series is tantamount to the quality of who we interview and the questions that get asked. Accuracy is particularly important, there's been no shortage of media hype and lies regarding hacking since the 1980s. \n Our vision for this film series is inclusive and collaborative. We'd like to hear from attendees how to best tell the origin story of hacking to new generations, and more so the outside world who've been fed a lot of myths by the media. Those are the lawmakers and citizens of tomorrow that we need to reach. Little attention has been paid to the pioneering hacker spirit that has literally changed every aspect of life. We want to address and correct that.",
      "speakers": [
        26128,
        26129
      ],
      "title": "Reverse Engineering, hacking documentary series",
      "id": 26069,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26004,
      "start_date": "2018-08-11T00:00+0000",
      "end_date": "2018-08-11T00:45+0000"
    },
    {
      "description": "Relax and enjoy a Fireside Hax chat while you get the latest information about how the law is racing to catch up with technological change from staffers at the Electronic Frontier Foundation, the nation's premiere digital civil liberties group fighting for freedom and privacy in the computer age. This Fireside Hax discussion will include updates on current EFF issues such as the government's effort to undermine encryption (and add backdoors), the fight for network neutrality, discussion of our technology projects to spread encryption across the Web and emails, updates on cases and legislation affecting security research, and much more.  Half the session will be given over to question-and-answer, so it's your chance to ask EFF questions about the law and technology issues that are important to you.",
      "speakers": [
        26130,
        26131,
        26132,
        26133,
        26134,
        26135
      ],
      "title": "EFF Fireside Hax (AKA Ask the EFF)",
      "id": 26070,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation",
      "location": 26005,
      "start_date": "2018-08-11T16:00+0000",
      "end_date": "2018-08-12T00:00+0000"
    },
    {
      "description": "There are many Software Defined Radios (SDRs) available, with a great deal of time and effort having gone in to their design.  These are not those radios.  We present four radios that we have designed using crude, novel, and sometimes ridiculous methods for transmitting and receiving signals. \nThe arrival of SDR allowed more hackers than ever to experiment with radio protocols, but we're still using hardware built by other people. In the time honored hacker tradition of rolling our own tools, we'll demonstrate four simple radios that can be home-built using commonly available parts for little to no cost.",
      "speakers": [
        26136,
        26137
      ],
      "title": "Revolting Radios",
      "id": 26071,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26004,
      "start_date": "2018-08-10T21:00+0000",
      "end_date": "2018-08-10T21:45+0000"
    },
    {
      "description": "Wireless sensor networks are commonly thought of as IoT devices communicating using familiar short-range wireless protocols like Zigbee, MiWi, Thread and OpenWSN. A lesser known fact is that about a decade ago, two industrial wireless protocols (WirelessHART and ISA100.11a) have been designed for industrial applications, which are based on the common IEEE 802.15.4 RF standard. These Wireless Industrial Sensor Networks (WISN) are used in process field device networks to monitor temperature, pressure, levels, flow or vibrations. The petrochemical industry uses WISN in oil and gas fields and plants around the world. \nBoth IEC ratified standards have been commonly praised by the ICS industry for their security features, including strong encryption on multiple layers within the protocol stack, resistance to RF interference, and replay protection. While the standards in general look safe on paper, there are potential interesting attack vectors that require verification. However, security research so far has not yielded any significant results beyond basic attack vectors. Often these attacks have only been theorized, and not (publically) demonstrated. In addition, vendor implementations have not been thoroughly tested for security by independent third parties, due to protocol complexity and the lack of proper (hardware/software) tools. We strongly believe in Wright's principle,\"Security does not improve until practical tools for exploration of the attack surface are made available.\"",
      "speakers": [
        26138,
        26139
      ],
      "title": "It WISN't me, attacking industrial wireless mesh networks",
      "id": 26072,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26003,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T17:45+0000"
    },
    {
      "description": "Phone-based mobile money is becoming the dominant paradigm for financial services in the developing world processing more than a billion dollars per day for over 690 million users. For example, mPesa has an annual cash flow of over thirty billion USD, equivalent to nearly half of Kenya's GDP. Numerous other products exist inside of nearly every other market, including GCash in the Philippines and easyPaisa in Pakistan. As a part of this growth, competitors have appeared who leverage ThinSIMS, small SIM card add ons, to provide alternative mobile money implementations without operating their own mobile networks. However, the security implications of ThinSIMs are not well understood. \nThis talk dives into decade old telecom standards to explore how ThinSIMs work and what attackers of mobile money systems can do when they control the interface between the SIM card and the phone.  We will also demo two proof of concept exploits that use ThinSIMs to steal money from mobile money platforms and detail the difficulties of defense.",
      "speakers": [
        26140
      ],
      "title": "ThinSIM-based Attacks on Mobile Money Systems",
      "id": 26073,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26002,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T17:45+0000"
    },
    {
      "description": "The term\"incident response exercise\" can strike fear in the hearts of even the mostly steely-eyed professional. The idea of sitting around a table, talking through a catastrophic security event can be both simultaneously exhausting and incredibly boring. However, what instead of an participating in an\"incident response exercise,\" you instead got to plan an\"incident response role playing game?\" \nEnter our IR roleplaying game,\"Oh Noes! An Adventure Through the Cybers and Shit.\" As part of our day job, we do quarterly IR exercises. In order to make these exercises more engaging, more fun, and more useful, we turned these exercises into a role playing game. We found it so useful and fun, we're releasing it at DEF CON along with numerous scenarios for your dungeon master to take you through. \nAt this talk, we will talk about gamifying IR exercises and the rules of Oh Noes! We will equip you with dice and your own character sheet and we will walk you through the character creating process. That's right, in Oh Noes! you create your own character with specific skills and abilities that you level up as you play. A group of us will play through a short scenario so you can see how the game works. We will provide several sample scenarios, some ripped from the headlines (and some cribbed from @badthingsdaily) as well as provide guidance on what makes successful scenarios as you transition to be your own dungeon master.",
      "speakers": [
        26141,
        26142
      ],
      "title": "Oh Noes!—A Role Playing Incident Response Game",
      "id": 26074,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Audience Participation, Tool",
      "location": 26005,
      "start_date": "2018-08-10T16:00+0000",
      "end_date": "2018-08-11T00:00+0000"
    },
    {
      "description": "Google Play Store provides thousands of applications for monitoring your children/family members. Since these apps deal with highly sensitive information, they immediately raise questions on privacy and security. Who else can track the users? Is this data properly protected? To answer these questions, we analyzed a selection of the most popular tracking apps from the Google Play Store. \nMany apps and services suffer from grave security issues. Some apps use self-made algorithms instead of proper cryptography for data storage and transmission. Others do not even attempt to protect their communication at all and make use of the unprotected http protocol, or even give an attacker full access to a vulnerable backend system. Hard coded database credentials in apps allowed access to all stored user locations. We would be able to extract hundreds of thousands of tracking profiles, even in real time. In others, this wasn't even necessary, because the user authentication could be bypassed altogether. Flaws in server API allowed us to extract all user credentials (1.7m plain text passwords), further we saw full communication histories containing messages, pictures and location data. \nIn total, the state of tracker apps is worrisome, effectively leading to users unknowingly installing espionage software on their devices.",
      "speakers": [
        26143,
        26144,
        26145
      ],
      "title": "All your family secrets belong to us—Worrisome security issues in tracker apps",
      "id": 26075,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26001,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-11T23:45+0000"
    },
    {
      "description": "Blockchain adaptation has reached a fever pitch, andthe community is late to the game of securing these platforms against attack. With the open source community enamored with the success of Ethereum, the enterprise community has been quietly building the next generation of distributed trustless applications on permissioned blockchain technologies. As of early 2018, an estimated half of these blockchain projects relied on the Hyperledger Fabric platform.\n\n \nIn this talk we will discuss tools and techniques attackers can use to target Fabric. To this end we are demoing and releasing a new attack suite, Tineola, capable of performing network reconnaissance of a Hyperledger deployment, adding evil network peers to this deployment, using existing trusted peers for lateral network movement with reverse shells, and fuzzing application code deployed on Fabric.\n\n \nAs George Orwell said: \"Who controls the past controls the future. Who controls the present controls the past.\" This talk will demonstrate how a sufficiently armed red team can modify the blockchain past to control our digital future.",
      "speakers": [
        26146,
        26147
      ],
      "title": "Tineola: Taking a Bite Out of Enterprise Blockchain",
      "id": 26076,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26003,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T19:45+0000"
    },
    {
      "description": "Extreme network's embedded WingOS (Originally created by Motorola) is an operating system used in several wireless devices such as access points and controllers. This OS is being used in Motorola devices, Zebra devices and Extreme network's devices. This research started focusing in an access point widely used in many Aircrafts by several worldwide airlines but ended up in something bigger in terms of devices affected as this embedded operating system is not only used in AP's for Aircrafts but also in Healthcare, Government, Transportation, Smart cities, small to big enterprises... and more. \nBased on public information, we will see how vulnerable devices are actively used (outdoors) in big cities around the world. But also in Universities, Hotels,Casinos, Big companies, Mines, Hospitals and provides the Wi-Fi access for places such as the New york City Subway. \nIn this presentation we will show with technical details how several critical vulnerabilities were found in this embedded OS. First we will introduce some internals and details about the OS and then we will show the techniques used to reverse engineering the mipsN32 ABI code for the Cavium Octeon processor. It will be discussed how some code was emulated to detect how a dynamic password is generated with a cryptographic algorithm for a root shell backdoor. Besides, it will be shown how some protocols used by some services were reverse engineered to find unauthenticated heap and stack overflow vulnerabilities that could be exploitable trough Wireless or Ethernet connection. \nThis OS also uses a proprietary layer 2/3 protocol called MiNT. This protocol is used for communication between WingOS devices through VLAN or IP. This protocol was also reverse engineered and remote heap/stack overflow vulnerabilities were found on services using this protocol and will be shown. As a live demonstration, 2 devices will be used to exploit a remote stack overflow chaining several vulnerabilities as the attacker could do inside an aircraft (or other scenarios) through the Wi-Fi. As there are not public shellcodes for mipsN32 ABI, the particularities of creating a Shellcode for mipsN32 ABI will be also discussed.",
      "speakers": [
        26148
      ],
      "title": "Breaking Extreme Networks WingOS: How to own millions of devices running on Aircrafts, Government, Smart cities and more.",
      "id": 26077,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26003,
      "start_date": "2018-08-12T18:00+0000",
      "end_date": "2018-08-12T18:45+0000"
    },
    {
      "description": "Public keys are everywhere, after all, they are public. These keys are waiting to be reaped by those who know their real value. Hidden behind this public face lurks some potentially dangerous issues which could lead to a compromise of data and privacy. \nLeveraging hundreds of minion devices, we built a public key reaping machine (which we are open sourcing) and operated it on a global scale. Collected keys are tested for vulnerabilities such as the recent ROCA vulnerability or factorization using batch-GCD. We've collected over 300 million keys so far and built a database 4 to 10 times bigger than previous public works. \nPerforming the initial computation on over 300 million keys took about 10 days on a 280 vCPU cluster. Many optimizations allow our tool to incrementally test new RSA keys for common prime factors against the whole dataset in just a few minutes. \nAs a result of our research, we could have impersonated hundreds of people by breaking their PGP keys, mimicked thousands of servers thanks to their factored SSH keys and performed MitM attacks on over 200k websites relying on vulnerable X509 certificates. \nIn the end, we were able to do this in an entirely passive way. Going further is possible, but it would lead us to the dark side. Would big brother hesitate to go there?",
      "speakers": [
        26149,
        26150
      ],
      "title": "Reaping and breaking keys at scale: when crypto meets big data",
      "id": 26078,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Audience Participation, Tool",
      "location": 26001,
      "start_date": "2018-08-11T20:00+0000",
      "end_date": "2018-08-11T20:20+0000"
    },
    {
      "description": "In a world of high volume malware and limited researchers we need a dramatic improvement in our ability to process and analyze new and old malware at scale. Unfortunately what is currently available to the community is incredibly cost prohibitive or does not rise to the challenge. As malware authors and distributors share code and prepackaged tool kits, the corporate sponsored research community is dominated by solutions aimed at profit as opposed to augmenting capabilities available to the broader community. With that in mind, we are introducing our library for malware disassembly called Xori as an open source project. Xori is focused on helping reverse engineers analyze binaries, optimizing for time and effort spent per sample. \nXori is an automation-ready disassembly and static analysis library that consumes shellcode or PE binaries and provides triage analysis data. This Rust library emulates the stack, register states, and reference tables to identify suspicious functionality for manual analysis. Xori extracts structured data from binaries to use in machine learning and data science pipelines. \nWe will go over the pain-points of conventional open source disassemblers that Xori solves, examples of identifying suspicious functionality, and some of the interesting things we've done with the library.  We invite everyone in the community to use it, help contribute and make it an increasingly valuable tool for researchers alike.",
      "speakers": [
        26151,
        26152
      ],
      "title": "Finding Xori: Malware Analysis Triage with Automated Disassembly",
      "id": 26079,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-10T20:00+0000",
      "end_date": "2018-08-10T20:20+0000"
    },
    {
      "description": "Fuzzers have played an important role in the discovery of reliability and security flaws in software for decades. They have allowed for test case generation at a rate impossible by hand and the creation of test cases humans may never conceive of. While there are many excellent fuzzers available most are designed for mutating source files or input in random ways and attempting to discover edge cases in the handling of them. Some others are designed with structured input in mind and use grammars to more strategically generate and mutate possible inputs that adhere to the format defined. These specifically are the ones we care about for the goals of identifying differences between multiple implementations of a single language, finding bugs in parse tree generation/handling of tokens, and handling of the data at runtime once it has been successfully lexically and syntactically analyzed. We'll look at some of the shortcomings of existing fuzzers and discuss the implementation for a new platform designed to make fuzzer creation easier with the goal of being able utilize grammars from the implementations of the languages themselves.",
      "speakers": [
        26153
      ],
      "title": "Synfuzz: Building a Grammar Based Re-targetable Test Generation Framework ",
      "id": 26080,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26002,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T17:45+0000"
    },
    {
      "description": "Existing techniques for bypassing wired port security are limited to attacking 802.1x-2004, which does not provide encryption or the ability to perform authentication on a packet-by-packet basis [1][2][3][4]. The development of 802.1x-2010 mitigates these issues by using MacSEC to provide Layer 2 encryption and packet integrity check to the protocol [5]. Since MacSEC encrypts data on a hop-by-hop basis, it successfully protects against the bridge-based attacks pioneered by the likes of Steve Riley, Abb, and Alva Duckwall [5][6]. \nIn addition to the development of 802.1x-2010, improved 802.1x support by peripheral devices such as printers also poses a challenge to attackers. Gone are the days in which bypassing 802.1x was as simple as finding a printer and spoofing address, as hardware manufacturers have gotten smarter. \nIn this talk, we will introduce a novel technique for bypassing 802.1x-2010 by demonstrating how MacSEC fails when weak forms of EAP are used. Additionally, we will discuss how improved 802.1x support by peripheral devices does not necessarily translate to improved port-security due to the widespread use of weak EAP. Finally, we will consider how improvements to the Linux kernel have made bridge-based techniques easier to implement and demonstrate an alternative to using packet injection for network interaction. We have packaged each of these techniques and improvements into an open source tool called Silent Bridge, which we plan on releasing at the conference.",
      "speakers": [
        26154
      ],
      "title": "Bypassing Port-Security In 2018: Defeating MacSEC and 802.1x-2010",
      "id": 26081,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26003,
      "start_date": "2018-08-10T22:00+0000",
      "end_date": "2018-08-10T22:45+0000"
    },
    {
      "description": "The classic spy movie hacking sequence: The spy inserts a magic smartcard provided by the agency technicians into the enemy's computer, ...the screen unlocks... What we all laughed about is possible! \nSmartcards are secure and trustworthy. This is the idea smartcard driver developers have in mind when developing drivers and smartcard software. The work presented in this talk not only challenges, but crushes this assumption by attacking smartcard drivers using malicious smartcards. \nA fuzzing framework for *nix and Windows is presented along with some interesting bugs found by auditing and fuzzing smartcard drivers and middleware. Among them classic stack and heap buffer overflows, double frees, but also a replay attack against smartcard authentication. \nSince smartcards are used in the authentication process, a lot of vulnerabilities can be triggered by an unauthenticated user, in code running with high privileges. During the authors research, bugs were discovered in OpenSC (EPass, PIV, OpenPGP, CAC, Cryptoflex,...), YubiKey drivers, pam_p11, pam_pkc11, Apple smartcardservices...",
      "speakers": [
        26155
      ],
      "title": "In Soviet Russia Smartcard Hacks You",
      "id": 26082,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26003,
      "start_date": "2018-08-11T20:00+0000",
      "end_date": "2018-08-11T20:20+0000"
    },
    {
      "description": "First of all, it's math. Not meth. So everybody be cool, I'm not gonna touch your central nervous system stimulant substances. Now that this is established, I can start telling my story. And this story, like all good stories, begins where it ends. \nWait, no, not really. \nIt begins at a birthday party where the sister of a friend asked if I could help her with MATLAB. No matter how horrible memories I had about MATLAB, I just couldn't say no. So the next day, there was I, sitting in my room, installing the trial. And that's when the hacking started... \nBelieve me, there were a lot to hack in this case! Several gigabytes of installed materials, a few web servers, cloud integration, clustering capabilities, you name it. These software are bloated, they are basically their own little operating systems. \nYup, I used plural. Because I thought why discriminate MATLAB? I should really give a chance to Maple and Mathematica to fail too!. I did, and they did fail, and these failures gave the material for my talk. Basically this will be a dump of exploits (RCEs, file disclosures, etc.), and if you use any of those software and you are at least a bit security conscious, you should definitely listen to it.",
      "speakers": [
        26156
      ],
      "title": "All your math are belong to us",
      "id": 26083,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit, Audience Participation",
      "location": 26003,
      "start_date": "2018-08-11T22:00+0000",
      "end_date": "2018-08-11T22:45+0000"
    },
    {
      "description": "Regarding ptmalloc2, many heap exploitation techniques have been invented in the recent years, well documented on the famous how2heap repository, or as writeups of famous CTF challenges (like House of Orange). However, most of them require atleast a libc/heap leak , or fail in non-PIE binaries. My new technique titled House of Roman leverages a single bug to gain shell leaklessly on a PIE enabled Binary. I shall showcase the ease of aligning the heap to perform this attack, thus demonstrating its versatility. \nSince this a 20 mins talk, attendees should be aware of basic heap exploitation techniques, like fastbin attacks and unsorted bin attacks, and have a general idea of how the ptmalloc2 algorithm works. As a bonus, I also discuss how to land a fastbin chunk in memory regions with no size alignment (like __free_hook ).",
      "speakers": [
        26157
      ],
      "title": "House of Roman—a \"leakless\" heap fengshui to achieve RCE on PIE Binaries",
      "id": 26084,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26002,
      "start_date": "2018-08-11T20:30+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "So how do you debug bios and triage a vulnerability for exploitability with no stack trace or error log? How do BIOS developers do it? Do not worry! We will explain how anyone can have debug capabilities on modern Intel platforms and show you how this massively simplifies exploit dev. Developing an exploit for a BIOS vulnerability is a different experience than other types of exploit dev. Your available code base to draw from is unlike what you would expect when running at the operating system level and you have no gdb you can use. \nIn this talk we will summarize BIOS exploitation techniques and dive deeper into the specifics of an exploit we developed to provide reliable arbitrary code execution for an\"over-the-internet\" bios update vulnerability we found and responsibly disclosed. We will explain the relevant parts of UEFI and talk more about the exploit mitigations that exist there. We will also explain how to explore System Management Mode (SMM) in an Intel based platform, utilizing Intel hardware debug capabilities on an Intel 8th gen platform to obtain SMRAM content, analyze its contents, and search for vulnerable code.",
      "speakers": [
        26158,
        26159
      ],
      "title": "UEFI exploitation for the masses",
      "id": 26085,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26002,
      "start_date": "2018-08-10T21:00+0000",
      "end_date": "2018-08-10T21:45+0000"
    },
    {
      "description": "Practice shows that even the most secure software written by the best engineers contain bugs. Malware is not an exception. In most cases their authors do not follow the best secure software development practices thereby introducing an interesting attack scenario which can be used to stop or slow-down malware spreading, defend against DDoS attacks and take control over C&Cs and botnets. Several previous researches have demonstrated that such bugs exist and can be exploited. To find those bugs it would be reasonable to use coverage-guided fuzzing. \nThis talk aims to answer the following two questions: ___ we defend against malware by exploiting bugs in them ? How can we use fuzzing to find those bugs automatically ? \nThe author will show how we can apply coverage-guided fuzzing to automatically find bugs in sophisticated malicious samples such as botnet Mirai which was used to conduct one of the most destructive DDoS in history and various banking trojans. A new cross-platform tool implemented on top of WinAFL will be released and a set of 0day vulnerabilities will be presented. \nDo you want to see how a small addition to HTTP-response can stop a large-scale DDoS attack or how a smart bitflipping can cause RCE in a sophisticated banking trojan? If the answer is yes, this is definitely your talk.",
      "speakers": [
        26160
      ],
      "title": "Fuzzing Malware For Fun & Profit. Applying Coverage-guided Fuzzing to Find and Exploit Bugs in Modern Malware",
      "id": 26086,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26004,
      "start_date": "2018-08-12T22:00+0000",
      "end_date": "2018-08-12T22:45+0000"
    },
    {
      "description": "In this modern digital age of technically competent adversaries we forget that there may still be a need to conduct old school physical surveillance against a target.  Many organisations utilise surveillance teams and these may be in-house in the case of government agencies or third-party teams contracted for a specific task and their targets range from suspected terrorists to people accused of bogus insurance claims. \r\nWhilst most people think that they may never be placed under surveillance some professions increase this probability.  For example, if you are a member of the press with sources that you only meet face to face you could be a target especially if the source is a whistleblower or has information that their employer would rather they didn't give to you.  Would it seem far-fetched to think that a hacker, security researcher or a member of the EFF could be placed under surveillance?  Maybe even some current and former DEF CON speakers and attendees? \r\nThese teams are not the lone Private Investigator sat in their car at the bottom of your street but are highly trained individuals whose job is to remain undetected.  Their mission is to observe and identify interactions and document everything they see.  They aim to be \"The Grey Man\", that person, when asked to describe, you are unable to.  Their techniques have changed very little over decades because they work. \r\nThis talk will focus on mobile and foot surveillance techniques used by surveillance teams.  It will also include tips on identifying if you are under surveillance and how to make their life difficult.",
      "speakers": [
        26161,
        26162
      ],
      "title": "WAGGING THE TAIL—COVERT PASSIVE SURVEILLANCE AND HOW TO MAKE THEIR LIFE DIFFICULT",
      "id": 26087,
      "link": "",
      "updated_at": "2018-07-02T14:11+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26002,
      "start_date": "2018-08-09T21:00+0000",
      "end_date": "2018-08-09T21:45+0000"
    },
    {
      "description": "In 2014, we released the mana rogue AP toolkit at DEF CON 22. This fixed KARMA attacks which no longer worked against modern devices, added new capabilities such as KARMA against some EAP networks and provided an easy to use toolkit for conducting MitM attacks once associated. \nSince then, several changes in wifi client devices, including MAC randomisation, significant use of the 5GHz spectrum and an increased variety of configurations has made these attacks harder to conduct. Just firing up a vanilla script gets fewer credentials than it used to. \nTo address this mana will be re-released in this talk with several significant improvements to make it easier to conduct rogue AP MitM attacks against modern devices and networks. \nAfter years of using mana in many security assessments, we've realised rogue AP'ing and MitM'ing is no simple affair. This extended talk will provide an overview of mana, the new capabilities and features, and walk attendees through three scenarios and their nuances:",
      "speakers": [
        26163
      ],
      "title": "Practical & Improved Wifi MitM with Mana",
      "id": 26088,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Audience Participation, Tool",
      "location": 26001,
      "start_date": "2018-08-10T23:00+0000",
      "end_date": "2018-08-10T23:45+0000"
    },
    {
      "description": "The 3DS was one of Nintendo's first serious attempts at security, featuring a cool microkernel based OS and actual exploit mitigations. That didn't stop it from getting hacked pretty hard, making it possible for people to write their own homebrew software for the console. But Nintendo isn't one to back off from a fight and, as a result, has put significant effort into not only fixing vulnerabilities but also introducing new security features targeted specifically at killing exploit techniques used by hackers. This talk will describe hacking the console through all these defensive features by walking through a 0-day exploit chain that takes us all the way from zero access to a full system jailbreak.",
      "speakers": [
        26164
      ],
      "title": "Jailbreaking the 3DS through 7 years of hardening",
      "id": 26089,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26004,
      "start_date": "2018-08-11T18:00+0000",
      "end_date": "2018-08-11T18:45+0000"
    },
    {
      "description": "A talk at DEF CON 25 claimed that privacy is \"gone and never coming back.\" This talk offers a different view, inviting the audience to see privacy as fundamentally about equality-something we have never fully had but also should never regard as gone.\r\n\r\n\r\nThe speaker is a human rights lawyer and investigator, and will draw on decades of human rights thinking about state surveillance as well as her 2017 revelations about Defense Department monitoring of \"homegrown violent extremists.\" Adopting a feminist and race-conscious perspective and inviting audience participation, the talk will challenge received wisdom about basic concepts such as privacy, national security, the warrant requirement, and online radicalization. With a view to the future, it will also offer a thought-provoking history of the connections between privacy and equality in the United States-and the ways unchecked surveillance operates to categorize us and reinforce divisions between us.\r\n\r\n\r\nIt is easy to forget that _1984_ was partly a story about poverty and economic inequality. This talk embraces Orwell's insight into the connection between the erosion of privacy and a dangerous loss of equality, and carries it forward.",
      "speakers": [
        26165
      ],
      "title": "Privacy Is Equality—And It's Far from Dead",
      "id": 26090,
      "link": "",
      "updated_at": "2018-07-02T14:12+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26005,
      "start_date": "2018-08-11T16:00+0000",
      "end_date": "2018-08-12T00:00+0000"
    },
    {
      "description": "Fake News has got a sidekick and it's called Fake Science. This talk presents the findings and methodology from a team of investigative journalists, hackers and data scientists who delved into the parallel universe of fraudulent pseudo-academic conferences and journals; Fake science factories, twilight companies whose sole purpose is to give studies an air of scientific credibility while cashing in on millions of dollars in the process. Until recently, these fake science factories have remained relatively under the radar, with few outside of academia aware of their presence; but the highly profitable industry is growing significantly and with it, so are the implications. To the public, fake science is indistinguishable from legitimate science, which is facing similar accusations itself. Our findings highlight the prevalence of the pseudo-academic conferences, journals and publications and the damage they can and are doing to society.",
      "speakers": [
        26166,
        26167,
        26168
      ],
      "title": "Inside the Fake Science Factory",
      "id": 26091,
      "link": "",
      "updated_at": "2018-07-02T14:12+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26004,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-11T23:45+0000"
    },
    {
      "description": "Hack a lock and get free rides! (No free beer yet though...). This talk will explore the ever growing ride sharing economy and look at how the BLE \"Smart\" locks on shared bicycles work. The entire solution will be deconstructed and examined, from the mobile application to its supporting web services and finally communications with the lock. We will look at how to go about analysing communications between a mobile device and the lock, what works, what doesn't. \nPrevious talks on attacking BLE targeted the protocol itself using various hardware and software such as Ubertooth and Wireshark, which could be potentially difficult for someone new wanting to explore BLE and the ever connected IoT world. I'll simplify and stupidify the entire process such that anyone with a mobile phone and basic experience with Frida can go about breaking locks and hacking BLE the world over.",
      "speakers": [
        26169
      ],
      "title": "Hacking BLE Bicycle Locks for Fun and a Small Profit",
      "id": 26092,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26001,
      "start_date": "2018-08-12T21:00+0000",
      "end_date": "2018-08-12T21:45+0000"
    },
    {
      "description": "Most of us have knowledge of PCB construction. In the past reversing someone's design was an easy task due to the simplicity of the PCB design. Now with BGA's( Ball Grid Array's), manufacturers using several plane layers cover the entire PCB design and obscuring the details of the PCB from view. Thru the use of X-Ray, we are able to reverse engineer virtually anything. Slides will be presented show several PCB designs and how easy it was to reverse engineer the PCB. Also presenting videos of live views and dynamic zoom; this will demonstrate the true power of the X-Ray and its ability to see sub-micron features within the PCB structure and devices while manipulating the PCB.",
      "speakers": [
        26170
      ],
      "title": "You can run, but you can't hide.  Reverse engineering using X-Ray.",
      "id": 26093,
      "link": "",
      "updated_at": "2018-07-02T14:13+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26002,
      "start_date": "2018-08-10T20:30+0000",
      "end_date": "2018-08-10T20:50+0000"
    },
    {
      "description": "Most people are familiar with homograph attacks due to phishing or other attack campaigns using Internationalized Domain Names with look-alike characters. But homograph attacks exist against wide variety of systems that have gotten far less attention. This talk discusses the use of homographs to attack machine learning systems, to submit malicious software patches, and to craft cryptographic canary traps and leak repudiation mechanisms. It then introduces a generalized defense strategy that should work against homograph attacks in any context.",
      "speakers": [
        26171
      ],
      "title": "Weaponizing Unicode: Homographs Beyond IDNs",
      "id": 26094,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool",
      "location": 26002,
      "start_date": "2018-08-10T22:00+0000",
      "end_date": "2018-08-10T22:45+0000"
    },
    {
      "description": "Two years ago Richard Thieme spoke on “Playing Through the Pain: The Impact of Dark Knowledge on Security and Intelligence Professionals” for Def Con 24. He relied on dozens of experiences provided by colleagues over a quarter-century, colleagues from NSA, CIA, corporate, and military. Responses to the presentation have often been emotional and have corroborated his thesis. The real impact of this work on people over the long term has to be mitigated by counter-measures and strategies so scars can be endured or,even better,incorporated and put to use.\n\n\nIn this presentation, Thieme elaborates those strategies and counter-measures. In what is likely his final speech at Def Con, he speaks directly to the “human in the machine” AS a human being. It’s not about leaving the profession: it’s about what we can do to thrive and transcend the challenges. It‘s about “saving this space,” this play space of hacking, work and life, and knowing the cost of being fully human while encountering dehumanizing impacts.\n\n\nIt is easier to focus on exploits, cool tools, zero days, and the games we play in the space that “makes us smile.” It is not so easy to know how to play through the pain successfully. The damage to us does not show up in brain scans. It shows up in our families, our relationships, and our lives.\n\n\nThieme is not preaching, he is sharing insights based on what he too has had to transcend in his own life. They call a lot of us “supernormals,” which means we discovered resilient responses to deprivation, abuse, profound loss … or the daily challenges of work that makes clear that evil is real. We are driven, we never quit, we fight through adversity, we create and recreate personas that work, we do what has to be done. It pays to know how we do that and know THAT we know so we can recreate resilience in the face of whatever comes our way. \n\n\nA contractor for NSA suggested that everyone inside the agency should see the video of “Playing Through the Pain.” A long-time Def Con attendee asks all new hires to watch “Staring into the Abyss,” a talk Thieme did a few years before. This subject matter is seldom discussed aloud “out here” and by all accounts is not taken seriously “inside,” which is perhaps why there have been half a dozen suicides lately at NSA and a CIA veteran said, “I have 23 suicides on my mind, the most recent senior people who could not live with what they knew.”\n\n\nThe assumption baked into this talk: real hacking, its ethos and its execution, provides the tools we need to do this damn thing right.\n\nThis talk is in honor of Perry Barlow and the EFF.",
      "speakers": [
        26172
      ],
      "title": "The Road to Resilience: How Real Hacking Redeems this Damnable Profession",
      "id": 26095,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26001,
      "start_date": "2018-08-12T00:00+0000",
      "end_date": "2018-08-12T00:45+0000"
    },
    {
      "description": "We propose a new exploit technique that brings a whole-new attack surface to defeat path normalization, which is complicated in implementation due to many implicit properties and edge cases. This complication, being under-estimated or ignored by developers for a long time, has made our proposed attack vector possible, lethal, and general. Therefore, many 0days have been discovered via this approach in popular web frameworks written in trending programming languages, including Python, Ruby, Java, and JavaScript. \nBeing a very fundamental problem that exists in path normalization logic, sophisticated web frameworks can also suffer. For example, we've found various 0days on Java Spring Framework, Ruby on Rails, Next.js, and Python aiohttp, just to name a few. This general technique can also adapt to multi-layered web architecture, such as using Nginx or Apache as a proxy for Tomcat. In that case, reverse proxy protections can be bypassed. To make things worse, we're able to chain path normalization bugs to bypass authentication and achieve RCE in real world Bug Bounty Programs. Several scenarios will be demonstrated to illustrate how path normalization can be exploited to achieve sensitive information disclosure, SMB-Relay and RCE. \nUnderstanding the basics of this technique, the audience won't be surprised to know that more than 10 vulnerabilities have been found in sophisticated frameworks and multi-layered web architectures aforementioned via this technique.",
      "speakers": [
        26173
      ],
      "title": "Breaking Paser Logic: Take Your Path Normalization Off and Pop 0days Out!",
      "id": 26096,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26001,
      "start_date": "2018-08-10T19:00+0000",
      "end_date": "2018-08-10T19:45+0000"
    },
    {
      "description": "Voicemail systems have been with us since the 80s. They played a big role in the earlier hacking scene and re-reading those e-zines, articles and tutorials paints an interesting picture. Not much has changed. Not in the technology nor in the attack vectors. Can we leverage the last 30 years innovations to further compromise voicemail systems? And what is the real impact today of pwning these? \nIn this talk I will cover voicemail systems, it's security and how we can use oldskool techniques and new ones on top of current technology to compromise them. I will discuss the broader impact of gaining unauthorized access to voicemail systems today and introduce a new tool that automates the process.",
      "speakers": [
        26174
      ],
      "title": "Compromising online accounts by cracking voicemail systems",
      "id": 26097,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Audience Participation, Tool",
      "location": 26003,
      "start_date": "2018-08-10T20:00+0000",
      "end_date": "2018-08-10T20:20+0000"
    },
    {
      "description": "Just like the Windows platform, graphic drivers of macOS kernel are complicated and provide a large promising attack surface for EoPs and sandbox escapes from low-privileged processes. After auditing part of the binaries, I discovered a number of vulnerabilities last year. Including, NULL pointer dereference, stack-based buffer overflow, arbitrary kernel memory read and write, use-after-free, etc. Some of these vulnerabilities were reported to Apple Inc., such as the CVE-2017-7155, CVE-2017-7163, CVE-2017-13883.\nIn this presentation, I will share with you the detailed information about these vulnerabilities. Furthermore, from the attacker's perspective, I will also reveal some new exploit techniques and zero-days.",
      "speakers": [
        26175
      ],
      "title": "Attacking the macOS Kernel Graphics Driver",
      "id": 26098,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26001,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T19:45+0000"
    },
    {
      "description": "In the ever raging battle between malicious code and anti-malware tools, firewalls play an essential role. Many a malware has been generically thwarted thanks to the watchful eye of these products. \nHowever on macOS, firewalls are rather poorly understood. Apple's documentation surrounding it's network filter interfaces is rather lacking and all commercial macOS firewalls are closed source. \nThis talk aims to take a peek behind the proverbial curtain revealing how to both create and 'destroy' macOS firewalls. \nIn this talk, we'll first dive into what it takes to create an effective firewall for macOS. Yes we'll discuss core concepts such as kernel-level socket filtering—but also how to communicate with user-mode components, install privileged code in a secure manner, and simple ways to implement self-defense mechanisms (including protecting the UI from synthetic events). \nOf course any security tool, including firewalls, can be broken. After looking at various macOS malware specimens that proactively attempt to detect such firewalls, we'll don our 'gray' (black?) hats to discuss various attacks against these products. And while some attacks are well known, others are currently undisclosed and can generically bypass even today's most vigilant Mac firewalls. \nBut all is not lost. By proactively discussing such attacks, combined with our newly-found understandings of firewall internals, we can improve the existing status quo, advancing firewall development. With a little luck, such advancements may foil, or at least complicate the lives of tomorrow's sophisticated Mac malware!",
      "speakers": [
        26176
      ],
      "title": "Fire & Ice: Making and Breaking macOS Firewalls",
      "id": 26099,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit",
      "location": 26004,
      "start_date": "2018-08-10T20:00+0000",
      "end_date": "2018-08-10T20:20+0000"
    },
    {
      "description": "In today's digital world the mouse, not the pen is arguably mightier than the sword. Via a single click, countless security mechanisms may be completely bypassed. Run untrusted app? click ...allowed. Authorize keychain access? click ...allowed. Load 3rd-party kernel extension? click ...allowed. Authorize outgoing network connection? click ...allowed. Luckily security-conscious users will (hopefully) heed such warning dialogues—stopping malicious code in its tracks. But what if such clicks can be synthetically generated and interact with such prompts in a completely invisible way? Well, then everything pretty much goes to hell. \nOf course OS vendors such as Apple are keenly aware of this 'attack' vector, and thus strive to design their UI in a manner that is resistant against synthetic events. Unfortunately they failed. \nIn this talk we'll discuss a vulnerability (CVE-2017-7150) found in all recent versions of macOS that allowed unprivileged code to interact with any UI component including 'protected' security dialogues. Armed with the bug, it was trivial to programmatically bypass Apple's touted 'User-Approved Kext' security feature, dump all passwords from the keychain, bypass 3rd-party security tools, and much more! And as Apple's patch was incomplete (surprise surprise) we'll drop an 0day that (still) allows unprivileged code to post synthetic events and bypass various security mechanisms on a fully patched macOS box! \nAnd while it may seem that such synthetic interactions with the UI will be visible to the user, we'll discuss an elegant way to ensure they happen completely invisibly!",
      "speakers": [
        26176
      ],
      "title": "The Mouse is Mightier than the Sword",
      "id": 26100,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26002,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T17:45+0000"
    },
    {
      "description": "",
      "speakers": [
        26025
      ],
      "title": "Welcome To DEF CON & Badge Maker Talk",
      "id": 26101,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26003,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T17:45+0000"
    },
    {
      "description": "Barcodes and barcode scanners are ubiquitous in many industries and work with untrusted data on labels, boxes, and even phone screens. Most scanners also allow programming via barcodes to manipulate and inject keystrokes. See the problem? By scanning a few programming barcodes, you can infect a scanner and access the keyboard of the host device, letting you type commands just like a Rubber Ducky. This culminates in barcOwned—a small web app that allows you to program scanners and execute complex, device-agnostic payloads in seconds. Possible applications include keystroke injection (including special keys), infiltration and exfiltration of data on air-gapped systems, and good ol' denial of service attacks.",
      "speakers": [
        26177,
        26178
      ],
      "title": "barcOwned—Popping shells with your cereal box",
      "id": 26102,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo",
      "location": 26004,
      "start_date": "2018-08-12T20:00+0000",
      "end_date": "2018-08-12T20:20+0000"
    },
    {
      "description": "1984 didn't just happen because of a calendar. The world of 1984 was built by politicians who used the rule of law to change society into an oppressive surveillance state. In Washington D.C., politicians today are making decisions about what technologies we're permitted to use and how they'll be used in society. In this talk we'll break down 4-5 bills currently under discussion in Congress and explain who they'll impact the DEF CON community.",
      "speakers": [
        26131,
        26179
      ],
      "title": "Disrupting the Digital Dystopia or What the hell is happening in computer law?",
      "id": 26103,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation",
      "location": 26005,
      "start_date": "2018-08-10T16:00+0000",
      "end_date": "2018-08-11T00:00+0000"
    },
    {
      "description": "Attribution is hard. Typically, the most useful identifiers—IP addresses, email address, domains, and so on—are also the easiest things to spoof, obfuscate, or anonymise. Whilst more advanced techniques, such as correlating malicious activity with timezones, or linking attacks through the use of similar techniques or malware, can be useful, they tend to take investigators further away from the individuals responsible; at best, some inference about the country or specific actor group/collective can be made. \r\nIn this talk, I present a method for linking incidents to individual attackers with a high degree of accuracy, based on extremely fine-grained behavioural characteristics. This involves an investigatory technique known as \"case linkage analysis\" (CLA), which uses granular aspects of crime scene behaviours to link common offenders together through statistical comparison. It's been applied to some crime types before, but never to cyber attacks. \r\nI'll cover how CLA works, its advantages and disadvantages, and how it has previously been applied to a range of crimes, from burglary to homicide. I'll place it within the context of personality psychology, biometrics, forensic criminology, offender profiling, and forensic linguistics; and will walk through applying it practically. \r\nI'll then show the results of a novel experiment I conducted applying CLA to network intrusion attacks, which involved logging the keystrokes of volunteer attackers across different simulated intrusions, breaking these down into specific behaviours and syntax, and using these to link individuals to their offences. The end result: the way you type commands, including your choice and order of syntax, switches, and options, can form distinctive behavioural signatures, which can be used to link attackers together. Linking accuracy rates as high as 99% were achieved. \r\nFinally, I'll talk about the implications for both defenders and everyone else (particularly focusing on the privacy implications), explore ways in which these techniques could be defeated, and outline some ideas for future research in these areas.",
      "speakers": [
        26180
      ],
      "title": "Betrayed by the keyboard: How what you type can give you away",
      "id": 26104,
      "link": "",
      "updated_at": "2018-07-02T14:13+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26002,
      "start_date": "2018-08-12T21:00+0000",
      "end_date": "2018-08-12T21:45+0000"
    },
    {
      "description": "Software-Defined Networking (SDN) is now widely deployed in production environments with an ever-growing community. Due to its popularity, many attacks are proposed against this novel network model. In this talk, we further extend SDN attack surface and propose the Custom Attack, a novel attack against SDN networks that can cause serious security risks by exploiting legitimate SDN protocol messages. Unlike many attacks leverage misbehaved protocol interactions to incur unexpected controller events, we craft malicious protocol messages to exploit complex software vulnerabilities in SDN components. Our research shows that it was possible for a weak adversary to execute arbitrary command or manipulate data in the SDN controller without accessing the SDN controller or any applications, but only controlling a host or network switch.\n\n\nTo the best of our knowledge, Custom Attack is the first attack that can compromise multiple components of the SDN framework (e.g., User Interface, Database, Third-party libraries etc.). Till now we have tested 5 most popular SDN controllers and their applications and found all of them are vulnerable to Custom Attack in some degree.\n\n\n\nThis presentation will include:\n\n",
      "speakers": [
        26181,
        26182,
        26183
      ],
      "title": "Hacking the Brain: Customize Evil Protocol to Pwn an SDN Controller",
      "id": 26105,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26001,
      "start_date": "2018-08-10T20:30+0000",
      "end_date": "2018-08-10T20:50+0000"
    },
    {
      "description": "We started our own transit Internet Service Provider (ISP) to safely route anonymized packets across the globe, and you can too. Emerald Onion is a Seattle-based 501(c)3 not-for-profit and we want to help other hacker collectives start their own. Getting your own Autonomous System Number (ASN), managing Internet Protocol (IP) scopes, using Border Gateway Protocol (BGP) in Internet Exchange Points (IXPs), dealing with abuse complaints or government requests for user data -- this is all stuff that you can do. Not every technologist is comfortable with launching and managing a nonprofit organization let alone has all of the technical knowhow to run an ISP. We didn't either when we started. We had a goal, and that was to route unfiltered Tor exit traffic in the Seattle Internet Exchange despite National Security Agency (NSA) wiretaps in the Westin Exchange Building. This talk will cover high level challenges and opportunities surrounding privacy infrastructure in the United States.",
      "speakers": [
        26184
      ],
      "title": "Privacy infrastructure, challenges and opportunities",
      "id": 26106,
      "link": "",
      "updated_at": "2018-07-02T14:13+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "",
      "location": 26004,
      "start_date": "2018-08-10T22:00+0000",
      "end_date": "2018-08-10T22:45+0000"
    },
    {
      "description": "With a surge in the production of internet of things (IoT) devices, embedded development tools are becoming commonplace and the software they run on is often trusted to run in escalated modes. However, some of the embedded development tools on the market contain serious vulnerabilities that put users at risk. In this talk we discuss the various attack vectors that these embedded development tools expose users to, and why users should not blindly trust their tools. This talk will detail a variety reverse engineering, fuzzing, exploit development and protocol analysis techniques that we used to analyze and exploit the security of a common embedded debugger.",
      "speakers": [
        26185,
        26186
      ],
      "title": "Infecting The Embedded Supply Chain",
      "id": 26107,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26004,
      "start_date": "2018-08-11T20:30+0000",
      "end_date": "2018-08-11T21:15+0000"
    },
    {
      "description": "To avoid the tedious task of collecting water usage data by go user's home _ water meters that are equipped with wireless communication modules are now being put into use, in this talk we will take a water meter _which is using Lora wireless protocol_ as an example to analyze the security and privacy risks of this kind of meters_we will explain how to reverse engineer and analyze both the firmware and the hardware of a water meter system, we will be talking about its security risks from multiple perspectives , physical, data link, and sensors. Do notice that LORA is not only used in water meter ,it is being used in a lot of IoT scenarios_so the methods we employed to analyze LORA in this talk are also useful when you do tests of other LORA based systems .",
      "speakers": [
        26187,
        26188,
        26189
      ],
      "title": "Lora Smart Water Meter Security Analysis",
      "id": 26108,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Tool",
      "location": 26004,
      "start_date": "2018-08-10T18:00+0000",
      "end_date": "2018-08-10T18:45+0000"
    },
    {
      "description": "The Teddy Ruxpin is an iconic toy from the 1980's featuring an animatronic teddy bear that reads stories from cassette tapes to children. In late 2017, a new model of the toy was released with improvements including Bluetooth connectivity, LCD eyes, and a companion mobile application. While the new bear features a number of improvements, the Teddy Ruxpin's original ability to add new stories by replacing the included cassettes is no longer applicable, and it requires users to supply files to the bear in a proprietary format. \nThis presentation aims to show how the new Teddy Ruxpin was reverse engineered down to a very low level in order to create new content. I will reveal the inner workings of the hardware and software within the bear and document the process used to reverse engineer it. I will then examine the communication between the mobile application and Teddy Ruxpin as well as the custom structure of the digital books read by the bear. I will end the presentation by releasing a toolset that allows users to create their own stories followed by a demo showcasing the Teddy Ruxpin greeting the DEF CON audience.",
      "speakers": [
        26190
      ],
      "title": "Dissecting the Teddy Ruxpin: Reverse Engineering the Smart Bear",
      "id": 26109,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Audience Participation, Tool",
      "location": 26002,
      "start_date": "2018-08-10T20:00+0000",
      "end_date": "2018-08-10T20:20+0000"
    },
    {
      "description": "MS17-010 is the most important patch in the history of operating systems, fixing remote code execution vulnerabilities in the world of modern Windows. The ETERNAL exploits, written by the Equation Group and dumped by the Shadow Brokers, have been used in the most damaging cyber attacks in computing history: WannaCry, NotPetya, Olympic Destroyer, and many others. \nYet, how these complicated exploits work has not been made clear to most. This is due to the ETERNAL exploits taking advantage of undocumented features of the Windows kernel and the esoteric SMBv1 protocol. \nThis talk will condense years of research into Windows internals and the SMBv1 protocol driver. Descriptions of full reverse engineering of internal structures and all historical background info needed to understand how the exploit chains for ETERNALBLUE, ETERNALCHAMPION, ETERNALROMANCE, and ETERNALSYNERGY work will be provided. \nThis talk will also describe how the MS17-010 patch fixed the vulnerabilities, and identify additional vulnerabilities that were patched around the same time.",
      "speakers": [
        26191
      ],
      "title": "Demystifying MS17-010: Reverse Engineering the ETERNAL Exploits",
      "id": 26110,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Tool, Exploit, Audience Participation",
      "location": 26004,
      "start_date": "2018-08-12T18:00+0000",
      "end_date": "2018-08-12T18:45+0000"
    },
    {
      "description": "Apple's sandbox was introduced as \"SeatBelt\" in macOS 10.5 which provided the first full-fledged implementation of the MACF policy. After a successful trial on macOS, Apple applied sandbox mechanism to iOS 6. In its implementation, the policy hooked dozens of operations. The number of hooks has been growing steadily when new system calls or newly discovered threats appeared. In the beginning, Apple's sandbox used a black list approach which means Apple originally concentrated on the known dangerous APIs and blocked them, allowing all others by default. However, with the evolution of Apple's sandbox, it applies a white list approach that denies all APIs and only allows secure ones that Apple trusts. \nIn this talk, we will first introduce Apple's sandbox mechanism and profiles in the latest iOS. Then, we discuss iOS IPC mechanism and review several old classic sandbox escape bugs. Most importantly, we show two new zero-day sandbox escape vulnerabilities we recently discovered in the latest iOS 11.4. Besides, we share our experience of exploiting vulnerabilities in system services through OOL msg heap spray and ROP (Return-oriented programming). In addition, we discuss a task port exploit technique which can be used to control the whole remote process through Mach messages. By using these techniques, security researchers could find and exploit sandbox escape bugs to control iOS user mode system services and further attack the kernel.",
      "speakers": [
        26004,
        26005
      ],
      "title": "Fasten your seatbelts: We are escaping iOS 11 sandbox!",
      "id": 26111,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26004,
      "start_date": "2018-08-10T20:30+0000",
      "end_date": "2018-08-10T20:50+0000"
    },
    {
      "description": "There are billions of ARM Cortex M based SOC being deployed in embedded systems.  Most of these devices are Internet ready and definitely security is always the main concern. Vendors would always apply security measurements into the ARM Cortex M product for few major reasons: 1) People will not be able to copy and replicate the product; 2) License control for the hardware and software; 3) Prevent malicious code injection in to the firmware. Vendors normally rely on the security measurements built within the chip (unique ID number/signature) or security measurements built around the chip (secure boot).\nIn this talk, we will share the ARM Cortex M SOC vulnerability that we discovered and it will be two parts:\nThe first is security measurement build within the SOC and how we break it. We could gain control of changing the SOC unique ID and write the firmware or even turn the device into a trojan or bot.\nThe second is security measure built around the SOC and how we break the Secure Boot elements and write into the firmware.",
      "speakers": [
        26007,
        26192,
        26193,
        26194
      ],
      "title": "Your Peripheral Has Planted Malware—An Exploit of NXP SOCs Vulnerability",
      "id": 26112,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Demo, Exploit",
      "location": 26003,
      "start_date": "2018-08-10T23:00+0000",
      "end_date": "2018-08-10T23:45+0000"
    },
    {
      "description": "Orwell's concept of 1984 has more to do with government misuse of technology than technology itself. New technology allows for more opportunity, but unchecked, it allows for complete government control. \nRepresentative Daniel Zolnikov is the nation's leading politician regarding privacy and surveillance and has enacted numerous laws safeguarding fourth amendment rights regarding digital communications and technology. Daniel will walk you down the road of how political misuse of technology can and will turn the Federal Government into an unprecedented nanny state that will lead to a suppressed free flow of information and fear of stepping out of line. His story includes insights on how unique left and right coalitions were formed to pass these laws in his home state of Montana, and how he prevailed against law enforcement groups who opposed implementing warrant requirements. \nThis discussion is aimed at sharing insights no matter your political affiliation. All of Daniel's legislation has passed with overwhelming bi-partisan support through both bodies in Montana's legislature and was signed by the governor of the opposite party. Although most speeches involving politicians tend to lead towards rhetoric, Daniel's goal is to share enough information to be able to understand why change has not taken place yet, and leave you understanding how to remedy that. \nHis story will give you insights into the politics that states and the nation face when reforming these issues, and his down to earth approach will bring the topic down to a level of humor and easy understanding. There is no need for any technical or political insight to be able to appreciate this topic and the work Daniel has done on behalf of the more technologically savvy enthusiasts. \nThe theme of DEF CON 26 would be inconsistent without taking into consideration policy and how it ties in closely with technology. Technology relies on policy, and policy has the implications of dictating the use of technology. The two can go hand in hand, or end up squaring up against each other. You are an important, and lesser heard voice in the world of aged politicians with limited vision. The Orwellian state existed due to a mixture of bad policies and technology. Although the theme focuses on technology used to disrupt the surveillance state, the other half of the battle is ensuring this state does not reach the disastrous conclusions of 1984. \nDaniel believes we can move forward with technology without living in fear of our government. If you want to have some hope and direction towards the future of policy regarding surveillance and technology, Daniel will leave you with the optimism that there is still a chance that our nation can have a balanced approach that ensures 1984 does not become the norm in the future and will help you understand how to take part in this action.",
      "speakers": [
        26195
      ],
      "title": "Politics and the Surveillance State. The story of a young politician's successful efforts to fight surveillance and pass the nation's strongest privacy bills. ",
      "id": 26113,
      "link": "",
      "updated_at": "2018-06-30T18:57+0000",
      "conference": "DC26",
      "event_type": 1,
      "includes": "Audience Participation",
      "location": 26001,
      "start_date": "2018-08-12T18:00+0000",
      "end_date": "2018-08-12T18:45+0000"
    },
    {
      "description": "Protect data with strong cryptography (AES, RSA, SHA) and attack these systems (Existential Forgery, Padding Oracle, and more). Apply these techniques to blockchains including Bitcoin, Ethereum, and Multichain.\nThis is a hands-on workshop with a series of CTF-style challenges, beginning with simple data conversions and extending to advanced methods appropriate for experts. We will briefly explain and demonstrate the techniques, and trainers will help participants individually with the challenges.",
      "speakers": [
        26200,
        26201,
        26202
      ],
      "title": "Crypto Hero",
      "id": 26150,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26006,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T21:00+0000"
    },
    {
      "description": "Nowadays, JSON Web Tokens are everywhere. They are used as session tokens, Oauth tokens or just to pass information between applications or microservices. By design, JWT contains a high number of security and cryptography pitfalls that creates interesting vulnerabilities. In this workshop, we are going to learn how to exploit some of those issues: the none algorithm, guessing the hmac secret, using a public key as a hmac secret... and finally CVE-2018-0114: a bug in the Cisco's Node JOSE.",
      "speakers": [
        26203,
        26204
      ],
      "title": "JWAT...Attacking JSON Web Tokens",
      "id": 26151,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26007,
      "start_date": "2018-08-10T21:30+0000",
      "end_date": "2018-08-11T01:30+0000"
    },
    {
      "description": "The main focus of this class is a software tool and programming language OpenSCAD. Through a specific example we will learn to reproduce physical objects. We'll cover the entire workflow from measurement, sketching, modeling, and manufacturing. Additional hints for optimizing your design for 3D printing will enable rapid product iteration. All modeling in OpenSCAD is through writing commands which brings many powerful properties of software such as parameterization, version control, and reusable components to CAD modeling. Ultimately with the combination of these skills you'll be equipped to repair and improve your stuff.",
      "speakers": [
        26205
      ],
      "title": " Reverse Engineering with OpenSCAD and 3D Printing",
      "id": 26152,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26008,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T21:00+0000"
    },
    {
      "description": "ARM architecture based systems are on the rise and seen in almost every hand-held or embedded device. The increasing popularity and growth of the Internet of Things (IoT) have allowed widespread use of ARM architecture. As with any other thing in this world, increasing popularity and usage brings new security challenges and attacks. This workshop aims to provide an introduction to ARM architecture, assembly and explore intermediate level exploitation techniques on ARM along with hands-on examples and challenges.\nThis session is aimed at security professionals and personnel who possess general security knowledge and wish to enter the field of ARM exploitation.\nThe attendees will walk away with basic knowledge and skills of ARM Architecture, Assembly, and Exploitation techniques.\nThe workshop will provide a base for the attendees to develop exploit research expertise on the ARM based platforms\nTopics Covered:\n\n\n\nIntroduction to ARM CPU Architecture \n\nRegisters\n\nModes of Operations\n\nARM Assembly Language Instruction Set\n\nIntroduction to ARM functions and working\n\nDebugging on ARM\n\nStack Overflow on ARM\n\nHow to write a shellcode\n\nHow to reverse a shellcode",
      "speakers": [
        26206
      ],
      "title": "ARM eXploitation 101",
      "id": 26153,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26007,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T21:00+0000"
    },
    {
      "description": "With the recent advancement in connected/smart device and availability of ready-made framework for both hardware and software development. Companies want to rapidly get into smart device market. it is necessary to look at the security feature of these smart device as our digital lives are connected with these devices.\nBluetooth has been around for almost a decade and with the need of low power wireless network and interoperability. Bluetooth has been used in vast majority of the device because of its low power footprint and interoperability as most of our smartphones have Bluetooth\nIn this workshop, we will be learning on how to fuzz the Bluetooth LE functionality of smart devices and exploit it. In the process, we will learn about how the Bluetooth low energy protocol works and various tools involved in reversing a smart band. We will also introduce a Bluetooth fuzzing framework called as Buzz and use it to crash or find other information in the smart band. \nBy the end of the class, we will also touch base on the hardware level exploits like accessing the serial port, debugging port and bypass Flash Read protection to extract the firmware from the smart band and demos on the same.",
      "speakers": [
        26207
      ],
      "title": "Buzzing Smart Devices: Smart Band Hacking",
      "id": 26154,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26008,
      "start_date": "2018-08-10T21:30+0000",
      "end_date": "2018-08-11T01:30+0000"
    },
    {
      "description": "This hands-on workshop teaches you how to both attack and defend Active Directory. We will start by deploying an Active Directory environment using the typical security settings found in most medium to large organizations. Participants will then learn current common methods and tools used to exploit Active Directory against a lab environment. Participants will create a hardened Active Directory environment using advanced methods to secure domain controllers from attack and then try to compromise their hardened environments.",
      "speakers": [
        26208,
        26209
      ],
      "title": "Attacking Active Directory and Advanced Defense Methods in 2018",
      "id": 26155,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26009,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T21:00+0000"
    },
    {
      "description": "Penetration testers can have the tables turned on them by attackers, to the detriment of client and tester security. Vulnerabilities exist in widely-used penetration testing tools and procedures. Testing often takes place in hostile environments: across the public Internet, over wireless, and on client networks where attackers may already have a foothold. \nIn these environments, common penetration testing practices can be targeted by third-party attackers. This can compromise testing teams in the style of \"ihuntpineapples\", or worse: quietly and over a long period of time. The confidentiality, integrity, and availability of client networks is also put at risk by \"sloppy\" testing techniques.\nIn this workshop, we present a comprehensive set of recommendations that can be used to build secure penetration testing operations. This includes technical recommendations, policies, procedures, and guidance on how to communicate and work with client organizations about the risks and mitigations. The goal is to develop testing practices that:\n- ...are more professionally sound\n\n - ...protect client organizations\n\n - ...protect penetration testers' infrastructure, and\n\n - ...avoid a negative impact on speed, agility, and creativity of testers\nThe recommendations are illustrated with entertaining and informative hands-on exercises. For the DEF CON 26 version of this class, the exercises have been updated to take place within Docker containers, and a portion of the class will involve introducing penetration testers to the use (and abuse) of containers. \nExercises include:\n\n - Vulnerability analysis of a penetration testing device's firmware\n\n - Quick and dirty code audits of high-risk testing tools\n\n - Monitoring and hijacking post-exploitation command and control\n\n - Layering security around otherwise insecure tools.\nAfter this workshop, you will walk away with actionable recommendations for improving the maturity and security of your penetration testing operations, as well as an exposure to the technical aspects of protecting the confidentiality of sensitive client data. You will participate in hands-on exercises that illustrate the importance of analyzing your own tools for vulnerabilities, and learn how to think like an attacker that hunts attackers. You'll hear about the challenges that are inherent in performing penetration tests on sensitive client networks, and learn how to layer security around your practices to reduce the risks.",
      "speakers": [
        26210,
        26211
      ],
      "title": "Penetration Testing Environments: Client & Test Security",
      "id": 26156,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26010,
      "start_date": "2018-08-10T21:30+0000",
      "end_date": "2018-08-11T01:30+0000"
    },
    {
      "description": "This hands-on training will walk attendees through leveraging the open source ELK (Elastic) stack to proactively identify malicious activity. The basic tools and techniques taught during this class can be used to investigate isolated security incidents or implemented at scale for continuous monitoring and hunting. Attendees will be provided with access to a preconfigured ELK cluster and extensive sample logs containing diverse malicious events waiting to be discovered. The training will conclude with a friendly CTF to give attendees an opportunity to collaborate on teams and put their learning into practice in a simulated network environment.",
      "speakers": [
        26212,
        26213,
        26214
      ],
      "title": "Threat Hunting with ELK",
      "id": 26157,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26009,
      "start_date": "2018-08-10T21:30+0000",
      "end_date": "2018-08-11T01:30+0000"
    },
    {
      "description": "Developers and Operations teams (DevOps) have moved towards containers and modern technologies. Attackers are catching up with these technologies and finding security flaws in them. In this workshop, we will look at how we can test for security issues and vulnerabilities in Dockerised environments . Throughout the workshop we will learn how we can find security misconfigurations, insecure defaults and container escape techniques to gain access to host operating system (or) clusters. In the workshop, we will look at real world scenarios where attackers compromised containers to gain the access to applications, data and other assets.\nBy the end of workshop participants will be able to:\n\n- Understand Docker security architecture\n\n- Audit containerised environments\n\n- Perform container escapes to get access to host environments\n\nThe participants will get the following:\n\n- A Gitbook(pdf, epub, mobi) with complete workshop content\n\n- Virtual machines to learn & practice\n\n- Other references to learn more about topics covered in the workshop",
      "speakers": [
        26215
      ],
      "title": "Attacking & Auditing Docker Containers Using Open Source",
      "id": 26158,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26010,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T21:00+0000"
    },
    {
      "description": "Let's get our hands dirty in Software Defined Networking! Whether you're a network engineer or just a netsec enthusiast, this workshop will provide you with tools and guidance to set up, attack, and secure a software defined network from scratch using open-source tools and cloud-based switching software. Each attendee will be given access to a lab environment where they can deploy, test, configure, break, and secure a software defined network. All scripts and deployment instructions will be provided at the end, so you can continue your testing and research back home, or use it to make friends and win bets at the pub.",
      "speakers": [
        26216
      ],
      "title": "Deploying, Attacking, and Securing Software Defined Networks",
      "id": 26159,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26006,
      "start_date": "2018-08-10T21:30+0000",
      "end_date": "2018-08-11T01:30+0000"
    },
    {
      "description": "Interested in hardware hacking, but don't know where to start? This workshop covers the basic skills you'll need for hacking modern embedded systems, including soldering/desoldering, circuit board modification, signal monitoring/analysis, and memory extraction. It is a subset of Joe Grand's Hands-on Hardware Hacking training class that he has been teaching since 2005.",
      "speakers": [
        26217
      ],
      "title": "Joe Grand's Hardware Hacking Basics",
      "id": 26160,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26011,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T21:00+0000"
    },
    {
      "description": "OpticSpy is an open source hardware module for experimenting with optical data transmissions. It captures, amplifies, and converts an optical signal from a visible or infrared light source into a digital form that can be analyzed or decoded with a computer. With OpticSpy, electronics hobbyists and hardware hackers can search for covert channels, which intentionally exfiltrate data in a way undetectable to the human eye, add data transfer functionality to a project, or explore signals from remote controls and other systems that send information through light waves. \nIn this workshop, creator Joe Grand will present a brief history of the project and then guide you through the process of building, calibrating, and testing your own kit version of OpticSpy.",
      "speakers": [
        26217
      ],
      "title": "Build Your Own OpticSpy Receiver Module",
      "id": 26161,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26011,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-12T01:30+0000"
    },
    {
      "description": "AWS is the most widely used cloud environments today and almost every security professional have to encounter this environment whether you are attacking an organization or defending it. In this fast-paced workshop we will teach participants with some neat tools, techniques and procedures to attack the most widely used AWS services as well as to defend them.\n- Recon / Information Gathering on AWS Services\n\n  - Attacking S3 buckets\n\n  - Exploiting web application flaws to compromise AWS services (IAM/KMS)\n\n  - Attacking Serverless applications\n\n  - Disrupting AWS Logging\n\n  - Attacking Misconfigured Cloud SDN\n\n\t\nTakeaways:\n Students will be able to understand and appreciate the delta in attack surface which gets added due to moving to cloud. And subsequently design architecture and develop applications to defend them.\n\t\n\t\nWhat will participants be provided?\n\n  - PDF copy of slide deck\n\n  - Lab VM\n\n  - Workshop lab manual\n\n  - Bonus labs\n\n\t\n\tTarget Audience:\n\n  - Cloud Security Engineers\n\n  - DevOps engineers\n\n  - Security Analyst\n\n  - Penetration Testers\n\n  - Anyone else who is interested in Cloud Security\n\n  - If you are an Expert or Advanced user, you may join us as co-trainers! :-)",
      "speakers": [
        26218,
        26219
      ],
      "title": "Attack & Defense in AWS Environments",
      "id": 26162,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26010,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T21:00+0000"
    },
    {
      "description": "Big Data have been for quiet a good time the driving force for innovation in many markets around. Data is the current asset that companies from around the world look for to crunch and extract information and knowledge, get new insights in order to create new services and products to deliver to their customers and finally improve their profits.\nBecause of that, it is imperative to protect such an important asset. In this workshop we will look at Haddoop from the point of view of security. We will learn what the Hadoop ecosystem has to offer us to protect our data, starting with Kerberos, perimeter security with Apache Knox, Configuring authorization with Apache Ranger and enabling encryption of the HDFS (Hadoop File System).\n1) Kerberos is used in Hadoop to provide an authentication system for users and other system interacting with the Hadoop cluster and it's services. Strongly authenticating and establishing a user's identity is the basis for secure access in Hadoop. Users need to be able to reliably \"identify\" themselves and then have that identity propagated throughout the Hadoop cluster. Hadoop uses Kerberos as the basis for strong authentication and identity propagation for both user and services. More info: https://web.mit.edu/kerberos/\n2) The Apache Knox Gateway (Knox) is a system to extend the reach of Apache Hadoop services to users outside of a Hadoop cluster without reducing Hadoop Security. Knox also simplifies Hadoop security for users who access the cluster data and execute jobs. The Knox Gateway is designed as a reverse proxy. The Apache Knox Gateway is an Application Gateway for interacting with the REST APIs and UIs of Apache Hadoop deployments. The Knox Gateway provides a single access point for all REST and HTTP interactions with Apache Hadoop clusters. More info: https://knox.apache.org/\n3) Apache Ranger is a framework to enable, monitor and manage comprehensive data security across the Hadoop platform. The vision with Ranger is to provide comprehensive security across the Apache Hadoop ecosystem",
      "speakers": [
        26220
      ],
      "title": "Securing Big Data in Hadoop",
      "id": 26163,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26006,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-12T01:30+0000"
    },
    {
      "description": "Microsoft does a great effort to harden the Windows kernel and limit attackers to load their custom drivers (kernel rootkits) with the introduction of Driver Signature Enforcement in Win7x64. In this 4 hour workshop we will learn the limitation of this enforcement and practice how we can bypass it. We will explore 4 different methods (from very easy to difficult) on various versions of Windows, including Windows 10. We will see how and why they work, and which malware used them in the past.\nFirst we will see how we can use leaked certificates to overcome DSE as well as how we can turn it OFF by design, and what are its limitations. Then we will use WinDBG to look into the kernel and find the various flags used to control DSE and use the HackSysExtremeVulnerableDriver to do kernel exploitation for setting those to the value we require. We will use a simple dummy driver to demonstrate unsigned driver loading.",
      "speakers": [
        26221
      ],
      "title": "Bypassing Windows Driver Signature Enforcement",
      "id": 26164,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26011,
      "start_date": "2018-08-10T17:00+0000",
      "end_date": "2018-08-10T21:00+0000"
    },
    {
      "description": "In recent years malscripts and file based exploits have become a main delivery method for malware. Malscripts are often heavily obfuscated and they can take many different forms including WScript, Javascript, macros, and PowerShell. There has also been been a rise in document based exploits used to deliver and execute these malscripts. As a result incident responders and malware analysts need to be comfortable analyzing different document formats, identifying potential exploits, and analyze malscripts.\nIn this workshop you will work through the triage of a live malware delivery chain that includes a malicious document, malicious scripts, and a final malware payload. During this process you will be exposed to different document based exploits, and you will practice the skills required to manually analyze malscripts. This workshop focuses on the fundamental analysis techniques used when identifying, deobfuscating, and analyzing maldocs and malscripts. However, we will also provide an introduction to automation tools and techniques that can be used to speed up the analysis process. \nThis workshop is aimed at junior incident responders, hobby malware analysts, and general security or IT practitioners who are interested in learning more about the malware triage process. If you have no experience with malware analysis but you have a good understanding of scripting languages like VBScript, and Javascript, and you are familiar with windows internals you should have no problem completing the workshop. You will be provided with a VirtualMachine to use during the workshop, please make sure to bring a laptop that meets the following requirements. Your laptop must have VirtualBox installed and working (VMWare is not supported). Your laptop must have at least 60GB of disk space free, preferably 100GB. Your laptop must be able to mount USB storage devices. Make sure you have the appropriate dongle if you need one.",
      "speakers": [
        26222,
        26223
      ],
      "title": "Analyzing Malscripts: Return of the Exploits!",
      "id": 26165,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26010,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-12T01:30+0000"
    },
    {
      "description": "Get hands on experience writing custom network protocol fuzzers. This class will cover the basics of network protocol \"smart fuzzing.\" Exercises will utilize the open source network protocol fuzzing framework, boofuzz. Attendees will gain practice reverse engineering a network protocol, implementing and iterating on a custom fuzzer, and identifying vulnerabilities.\n\nAfter:\n\n1. You will know the basics of fuzzing.\n\n2. You will know how to write custom network protocol fuzzers using state of the art open source tools.\n\n3. You will have hands on experience with this widely-discussed but still largely mysterious test method.\n\nBefore:\n\n1.You should be comfortable doing some programming in Python.\n\n 2. You should understand basic network protocol concepts.\n\n 3. You should be familiar with WireShark and how to use it.\n\nWhat you won't learn:\n\n 1. Exploit development.\n\n 2. Python programming. Because you can already do that (see above).",
      "speakers": [
        26224,
        26225
      ],
      "title": "Advanced Custom Network Protocol Fuzzing",
      "id": 26166,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26009,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T21:00+0000"
    },
    {
      "description": "Attendees to this workshop will experience a step by step walk through in setting up a Gscript build environment (which will include the Golang programing language as a requirement, along with the required libraries). Subsequently, attendees will obtain a basic overview of the Gscript capabilities in using conditional logic to navigate within, and deploy persistence mechanisms upon, target hosts.\nUpon completion, each attendee will depart with a laptop (whichever one they brought _)containing a full Gscript build & testing environment, and at least 1 custom Gscript of their own design and purpose.",
      "speakers": [
        26226,
        26227,
        26228
      ],
      "title": "Building Environmentally Responsive Implants with Gscript",
      "id": 26167,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26009,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-12T01:30+0000"
    },
    {
      "description": "This workshop will give participants information how to use afl (American fuzzy lop) to identify vulnerabilities in different applications and modules.\n  afl is a security-oriented fuzzer, that allows to efficiently and automatically test software components allowing to find interesting security issues.\n  It is one of leading tools and essential component in the toolbox of security researcher and hacker (penetration tester).\n  List of afl trophies (issues found using afl) can be read at: \nhttp://lcamtuf.coredump.cx/afl/\n\n  Participants will have possibility to learn how afl works and how to use it successfully based on real life cases - vulnerabilities found by trainers in different open source components.\n  During the training multiple cases and tips will be presented (see detailed outline for more complete list).",
      "speakers": [
        26229,
        26230
      ],
      "title": "Fuzzing with AFL (American Fuzzy Lop)",
      "id": 26168,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26008,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T21:00+0000"
    },
    {
      "description": "During a targeted penetration test or red team engagement, consultants will have clear engagement goals and targets such as a particular database or access to specific blueprints within the environment. \n During the engagement, obtaining shells on servers & workstations as standalone devices will not provide access to the target data. The pentesters will need to move from one host to another in order perform reconnaissance and eventually, get to the target.\n This workshop aims to provide the necessary background knowledge to understand and execute lateral movement techniques on both MS Windows and Linux. More than just showing which tools and parameters to use like Youtube video would, this workshop will dive deep and describe with detail, the specific services of each OS and how they can be abused to achieve lateral movement. This knowledge will allow the students to learn the actual techniques and not just a bunch of tools.",
      "speakers": [
        26231,
        26232
      ],
      "title": "Lateral Movement 101: 2018 Update",
      "id": 26169,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26007,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-12T01:30+0000"
    },
    {
      "description": "Dive into the world of using the PowerShell Empire Remote Access Tool (RAT). The students will learn to use Empire. They will build command & control, evade some defensive controls, and other red team tips and tricks. Additionally, students will gain insight on how to build more complex infrastructure for Red Team operations, automate common tasks, and extract engagement data for reporting.",
      "speakers": [
        26233
      ],
      "title": "Weapons Training for the Empire",
      "id": 26170,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26008,
      "start_date": "2018-08-11T21:30+0000",
      "end_date": "2018-08-12T01:30+0000"
    },
    {
      "description": "As hackers, sometimes we need to send data without anybody knowing anything. We don't want anybody to know what we're sending, so we use encryption. That's the easy part. We also don't want anybody to know that we're sending any data. That's the hard part. The observation of our presence on the network could be enough to get us in trouble. And that's just not acceptable. We need to figure out a way to hide in plain sight.\nCreating an environment where data can be sent securely and our presence on the network is hidden, is not an easy thing to do. We can't rely on centralized technologies, which means we need to build a decentralized network. The network should be adaptive and flexible enough to send any type of data to any number of users. But how do we inject anonymity into a network while still supporting the verification of identity between parties? Can we establish trust without having to trust?\nThis workshop takes you through the process of creating a decentralized network that allows you to circumvent detection by governments and corporations. You'll be able to securely communicate and share data while masking your online identity. You'll create an adaptive, node-based infrastructure where data is shared via Distributed Hash Tables (DHT) backed by real-time asymmetric Elliptic-curve cryptography (ECC). If you've ever wanted to punch a hole through a great (or not-so-great) firewall, this workshop is for you.\nPlease note that this is a medium-level, technical workshop and requires that attendees have prior experience in at least one programming language, preferably C or C++. Bring your laptop, a USB flash drive, and your favorite C/C++ 11 compiler (>= gcc/g++ 4.9.2 or msvc 2015).",
      "speakers": [
        26234
      ],
      "title": "Decentralized Hacker Net",
      "id": 26171,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26006,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T21:00+0000"
    },
    {
      "description": "\"HACKING THINGZ POWERED BY MACHINE LEARNING\" is a hands-on workshop that gives attendees a crash course in performing practical adversarial attacks on modern technology powered by machine learning. This will NOT be an intro to ML class - do that on your own time online before or after the class - deep ML knowledge is definitely *not* required. We will perform mischief on ML systems that most tech-savvy people interact with on a daily basis: face recognition, (smartphone authentication) speech recognition, (home assistants) and web application firewalls (need we say more?) ;) We won't just be explaining the theory and tomfoolery behind these attacks - we'll walk you through each step of each attack and show you how *absolutely anyone* can hack systems like these with just a little bit* of background in ML hacking.\n* This is an intermediate technical class suitable for attendees with some ability to read and write basic Python code. To get the most out of this workshop, surface-level understanding of machine learning is good. (i.e. be able to give a one-line answer to the question \"What is machine learning?\")",
      "speakers": [
        26235,
        26236
      ],
      "title": "Hacking Thingz Powered By Machine Learning",
      "id": 26172,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26011,
      "start_date": "2018-08-10T21:30+0000",
      "end_date": "2018-08-11T01:30+0000"
    },
    {
      "description": "Many cities around the world have implemented multi-million dollar \"trunked\" radio systems for their transit, municipal, public safety, police, fire and EMS radio networks. Large commercial organizations (like Caesar's) also use frequency sharing trunked radio systems due to the hundreds (if not thousands) of staff... all requiring radio access. This workshop will walk you through the basics of trunked radio systems, how they work, and how you can set up a listening post to decode these systems and listen in. This workshop will cover setting up and using the Trunk88 scanning software, and how to scan other conventional (non-trunked) radio systems such as MOTOTRBO, Tetra, EDACS, and other systems. Live interception and decoding of a trunked system and a DMR/TRBO system will be done by students. We will also quickly walk through scanning popular archaic pager systems like POCSAG. ",
      "speakers": [
        26237,
        26238
      ],
      "title": "Adventures in Radio Scanning: Advanced Scanning Techniques with SDR",
      "id": 26173,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26007,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T21:00+0000"
    },
    {
      "description": "The workshop aims at delivering hands on experience to pentest 802.15.4 and BLE commercial devices. \n By design and purpose, IoT was meant to serve the whims of human, taking human laziness to next level.\n Hence in this due effort, there was least || no attention paid towards the state of security of IoT.\n However, this doesn't mean, the motives of users are deterred to use insecure IoT devices/setups.\nDue to high demand for automation in M2M communication, the IoT concept took a position in the industrial sector for better and fast work ignoring security aspect. \n Absence of this aspect in the production is making all IoT communications and wireless communications vulnerable largely.\nOn the other hand, BLE devices have been used everywhere. They are being used in home automation, healthcare,\n SensorTags and Bluetooth Password Manager etc. As a matter of fact, these BLE devices are equally vulnerable as that of IEEE 802.15.4 based devices. The impact is huge as these technologies are used in industrial applications like water dams and other ICS systems.\n\n Prebuilt VM with lab manuals will be provided to attendees.\n The workshop is structured for beginner to intermediate level attendees who do not have any experience in IoT wireless communication.",
      "speakers": [
        26239,
        26240
      ],
      "title": "Guided Tour to IEEE 802.15.4 and BLE Exploitation",
      "id": 26174,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26011,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T21:00+0000"
    },
    {
      "description": "This workshop will provide a foundation to attendees on the basics of performing a forensic investigation on a corporate or SOHO network.  The course will primarily discuss forensics on a Windows system and network, but, Linux and Mac systems will be briefly discusses during the workshop where applicable.\n\nAttendees will learn techniques on how to properly collect possible evidentiary data, how to store the collected data, how to analyze the information and evaluate the data.\nTopics that will be covered include:\n- Pre-incident.. Setting up your forensic analysis toolkit.\n- First contact with an incident.  What should you do and not do.\n- Collecting volatile data.  Tools and techniques\n- Collecting and storing non-volatile data.\n- Utilizing open source software to analyze the data\n- Making a determination and writing the report based on the analyzed data.\n- What to do with the collected and analyzed information.\n\nThis workshop is intended to provide a basic overview of how to properly collect and handle data in a corporate or enterprise network.  The course will cover several tools and provide labs for the students to complete to familiarize themselves with how the tools work and the proper procedures to use.  However, this class will not make a deep dive into any of the tools.  Nor is this class intended for the professional forensic investigator.",
      "speakers": [
        26241
      ],
      "title": "Forensic Investigation for the Non-Forensic Investigator",
      "id": 26175,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26011,
      "start_date": "2018-08-09T21:30+0000",
      "end_date": "2018-08-10T01:30+0000"
    },
    {
      "description": "With more and more teams moving to Agile, security engineers need to be ready to find bugs by just looking at a diff in Stash or Github. This workshop will give you the basics to get started and know what to look for. Based on 3 exercises in 3 different languages (PHP, Golang and Ruby), we will cover simple to more advanced issues and show you where to look and what you can find. After this workshop, you will be ready to start doing code review for fun or as a way to get further as part of a post-exploitation.",
      "speakers": [
        26203,
        26204
      ],
      "title": "Finding Needles in Haystacks",
      "id": 26176,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26007,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T21:00+0000"
    },
    {
      "description": "Many people talk about ICS & SCADA security nowadays, but only a few people actually have the opportunity to get their hands dirty and understand how these systems work. Have you ever wanted to know how to make a train derail, or stop a production line? Well, this workshop is made for you!\nThe goal of this workshop is to give you the knowledge required to start attacking SCADA networks and PLCs, and give you hands-on experience on real devices by hacking our model train!\nIn this workshop, we will cover the main components and the commonly associated security flaws of industrial control systems, aka SCADA systems. We will then focus on their key assets, Programmable Logic Controllers (PLCs), and discover how they work, how they communicate, how they can be programmed to learn the methods and tools you can use to p*wn them.\nThen we will move on to real-world by attacking real PLCs from two major manufacturers on a dedicated setup featuring robot arms and a model train! Let's capture the flag!",
      "speakers": [
        26242,
        26243
      ],
      "title": "Pentesting ICS 101",
      "id": 26177,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26008,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T21:00+0000"
    },
    {
      "description": "WebViews allow developers to embed HTML pages into mobile applications and their use is widespread, from merely displaying a simple help page to wrapping an entire website inside a mobile app.\n Developers now \"control the browser\" and things can go very wrong: a cross site scripting vulnerability can be catastrophic for a mobile application and result in the exfiltration of user's data stored on the device or in someone listening to user conversations.\n The \"Where's My Browser?\" vulnerable-by-design mobile applications for Android and iOS have been written by the presenter as a teaching tool for hacking WebViews.\n The workshop covers the attack surface of Android and iOS WebViews and presents techniques and tools for identifying and exploiting those vulnerabilities. Attendees will practice their skills against the \"Where's My Browser?\" mobile apps. The source code of the applications will help students in recognizing common coding mistakes.",
      "speakers": [
        26244,
        26245
      ],
      "title": "Where's My Browser? Learn Hacking iOS and Android WebViews",
      "id": 26178,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26009,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T21:00+0000"
    },
    {
      "description": "Using cryptography is often a subtle practice and mistakes can result in significant vulnerabilities. This workshop will cover many of these vulnerabilities which have shown up in the real world. This will be a hands-on workshop where you will implement the attacks after each one is explained. I will provide a VM with Python dependencies and skeleton code included so you can focus on implementing the attack. A good way to determine if this workshop is for you is to look at the challenges at cryptopals.com and see if those look interesting, but you could use in person help understanding the attacks. While not a strict subset of those challenges, there is significant overlap.",
      "speakers": [
        26246
      ],
      "title": "Introduction to Cryptographic Attacks",
      "id": 26179,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26008,
      "start_date": "2018-08-09T21:30+0000",
      "end_date": "2018-08-10T01:30+0000"
    },
    {
      "description": "This workshop will instruct attendees on how to carry out sophisticated wireless attacks against corporate infrastructure. Attendees will learn how to attack and gain access to WPA2-Enterprise networks, bypass network access controls, and perform replay attacks to gain administrative control over an Active Directory environment. External wireless adapters and additional required equipment will be provided to all workshop attendees, and material learned in the lectures will be practiced within a realistic lab environment. \nAreas of focus include:\n* Wireless reconnaissance and target identification within a red team environment\n\n * Attacking and gaining entry to WPA2-EAP wireless networks\n\n * LLMNR/NBT-NS Poisoning\n\n * Firewall and NAC Evasion Using Indirect Wireless Pivots\n\n * MITM and SMB Relay Attacks\n\n * Downgrading modern SSL/TLS implementations using partial HSTS bypasses",
      "speakers": [
        26247,
        26248
      ],
      "title": "Advanced Wireless Attacks Against Enterprise Networks",
      "id": 26180,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26009,
      "start_date": "2018-08-09T21:30+0000",
      "end_date": "2018-08-10T01:30+0000"
    },
    {
      "description": "Join us in this hands-on introduction to fuzzing workshop, where we will explore how common fuzzing tools (e.g. AFL, libFuzzer, BooFuzz, etc..) are used to discover previously unknown bugs within applications.\nWe will first cover a general process to follow when fuzzing a targeted application and then provide hands-on labs where students will be able to apply this fuzzing process to quickly discover bugs within applications. \nSeveral different fuzzing techniques will be covered including fuzzing file inputs via blind mutations (e.g. radamsa), fuzzing specific functions within an application via in-process evolutionary fuzzing (e.g. libFuzzer), compile-time instrumentation based fuzzing (e.g. AFL), and fuzzing of network services via generation based fuzzing (e.g. BooFuzz aka Sulley).",
      "speakers": [
        26249,
        26250
      ],
      "title": "Fuzzing FTW",
      "id": 26181,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26007,
      "start_date": "2018-08-09T21:30+0000",
      "end_date": "2018-08-10T01:30+0000"
    },
    {
      "description": "This is a workshop about Radio-frequency Identification (RFID), including a basic introduction and a set of practical hands-on challenges. We will start with explaining the theory behind RFID, including the different types and protocols (e.g. HID, Mifare) and how to perform an RFID assessment. Afterwards, the participants can take on several challenges (of increasing difficulty) with RFID readers that we will provide. Our objective is to make this workshop fun and accessible to a wide audience.",
      "speakers": [
        26251,
        26252
      ],
      "title": "Playing with RFID",
      "id": 26182,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26010,
      "start_date": "2018-08-09T21:30+0000",
      "end_date": "2018-08-10T01:30+0000"
    },
    {
      "description": "Join the packet hunters behind NPR's Project Eavesdrop for an interactive, hands-on workshop where we'll hunt for juicy bits of personal & corporate data on the wire. Using Wireshark, ngrep,\n tcpflow, xplico and other Linux packet digging tools, you'll learn how to extract PII from a packet capture or live stream, including passwords, emails, photos/images, cookies, session IDs, credit card\n numbers, SSNs, GPS coordinates, mobile device details, cell carrier info, vulnerable client software, weak SSL sessions, and much more. Useful for detecting privacy/data leakage, passive pentesting, & network forensics, these techniques expose what an intermediary can discern about an individual or organization through passive monitoring of network traffic.",
      "speakers": [
        26253,
        26254
      ],
      "title": "Packet Mining for Privacy Leakage",
      "id": 26183,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26006,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T21:00+0000"
    },
    {
      "description": "Reverse engineering has become an increasingly important element of network security. The ability to break a system down in order to understand its base components and how they interact is critical to understanding not just how the system works, but the ways it can leave your network vulnerable. This is especially true at the application level, where insecure or poorly managed applications can leak sensitive data. In this hands-on workshop, attendees will learn how to reverse engineer real application-layer protocols. During our time together, we'll start at the surface and do a deep technical dive into the network traffic of a common remote access application. Along the way, we'll: \n1. Introduce protocol reverse engineering and explain its importance\n\n 2. Learn how to discover structured data\n\n 3. Determine if data is encoded or encrypted\n\n 4. Understand how various protocols interact\n\n 5. Uncover secondary communications and information leaks in a hands-on fashion\nAll materials and content are freely available at \nhttps://dl.awakesecurity.com/defcon/nw_re_tools/resources.html\n and will remain so.",
      "speakers": [
        26255
      ],
      "title": "The Truth is in the Network: Reverse Engineering Application-Layer Protocols Via PCAP",
      "id": 26184,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26006,
      "start_date": "2018-08-09T21:30+0000",
      "end_date": "2018-08-10T01:30+0000"
    },
    {
      "description": "It is common knowledge that automating security testing, especially for rapid-release applications is an essential requirement from multiple perspectives. One perspective is that of security testing in a Continuous Delivery Pipeline (as part of CI/CD) and the other is the perspective of a Penetration Tester. In a CI/CD Pipeline, one would like security tests to be triggered in an automated manner. These tests should provide information related to application vulnerabilities to engineering teams, early in the SDL (Software Development Lifecycle), preferably before these apps are deployed to production. From the perspective of the Pentester, there is the obvious shortage of time and resources. Pentesters spend a lot of time repeating standard manual processes, thereby losing out on time to perform more deep, insightful analysis of the target application to uncover serious security flaws. Targeted Automation, can be very useful for a Pentester as well.",
      "speakers": [
        26256,
        26257
      ],
      "title": "Building Autonomous AppSec Test Pipelines with the Robot Framework",
      "id": 26185,
      "link": "",
      "updated_at": "2018-07-02T15:05+0000",
      "conference": "DC26",
      "event_type": 3,
      "includes": "",
      "location": 26010,
      "start_date": "2018-08-09T17:00+0000",
      "end_date": "2018-08-09T21:00+0000"
    },
    {
      "description": "The newly upgraded #WiFiCactus for DEF CON 26 is a passive wireless monitoring backpack that listens to 60 channels of 2.4 and 5 gHz WiFi at the same time. New this year is the ability to capture 802.11AC traffic and upgrades to remove bandwidth bottlenecks. This tool uses Kismet to capture the data from the each radio and aggregates them into a single searchable web interface. This tool is also capable of identifying wireless threats, troubleshooting complex wireless environments and helping with correlation analysis between Bluetooth and WiFi.",
      "speakers": [
        26275
      ],
      "title": "#WiFiCactus",
      "id": 26190,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T18:50+0000"
    },
    {
      "description": "ADRecon is a tool which extracts various artifacts (as highlighted below) out of an AD environment in a specially formatted Microsoft Excel report that includes summary views with metrics to facilitate analysis. The report can provide a holistic picture of the current state of the target AD environment. The tool is useful to various classes of security professionals like system administrators, security professionals, DFIR, etc. It can also be an invaluable post-exploitation tool for a penetration tester. It can be run from any workstation that is connected to the environment, even hosts that are not domain members. Furthermore, the tool can be executed in the context of a non-privileged (i.e. standard domain user) accounts. Fine Grained Password Policy, LAPS and BitLocker may require Privileged user accounts. The tool will use Microsoft Remote Server Administration Tools (RSAT) if available, otherwise it will communicate with the Domain Controller using LDAP.\n\n\nThe following information is gathered by the tool: Forest; Domain; Trusts; Sites; Subnets; Default Password Policy; Fine Grained Password Policy (if implemented); Domain Controllers, SMB versions, whether SMB Signing is supported and FSMO roles; Users and their attributes; Service Principal Names (SPNs); Groups and memberships; Organizational Units (OUs); ACLs for the Domain, OUs, Root Containers and GroupPolicy objects; Group Policy Object details; DNS Zones and Records; Printers; Computers and their attributes; LAPS passwords (if implemented); BitLocker Recovery Keys (if implemented); and GPOReport (requires RSAT).",
      "speakers": [
        26276
      ],
      "title": "ADRecon: Active Directory Recon",
      "id": 26191,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "Angad is a framework to automate classification of an unlabelled malware dataset using multi-dimensional modelling. The input dataset is analyzed to collect various attributes which are then arranged in a number of feature vectors. These vectors are then individually visualized, indexed and then queried for each new input file. Matching vectors are labelled as per their AV detection categories for now but this could be changed to a heuristics approach if needed. If dynamic behavior or network traffic details are available, vectors are also converted into activity graphs that depict evolution of activity with a predefined time scale. This results into an animation of malware/malware category's behavior traits and is also useful in identifying activity overlaps across the input dataset.\n\n\nMalware detection is a challenging task as the landscape is ever-evolving. Every other day, a new variant or a known malware family is reported and signature driven tools race against time to add detection. The process worsens when the rate of incoming samples is in thousands on a daily basis, making static/dynamic analysis alone of no use.\n\n\nAngad tries to address this issue by leveraging well-known data classification techniques to the malware domain. It tries to provide a known interface to the multi-dimensional modelling approach within a standalone package.",
      "speakers": [
        26277
      ],
      "title": "Angad: A Malware Detection Framework using Multi-Dimensional Visualization",
      "id": 26192,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-12T00:50+0000"
    },
    {
      "description": "Archery is an opensource vulnerability assessment and management tool which helps developers and pentesters to perform scans and manage vulnerabilities. Archery uses popular opensource tools to perform comprehensive scanning for web application and network. It also performs web application dynamic authenticated scanning and covers the whole applications by using selenium. The developers can also utilize the tool for implementation of their DevOps CI/CD environment.",
      "speakers": [
        26278
      ],
      "title": "Archery - Open Source Vulnerability Assessment and Management",
      "id": 26193,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T18:50+0000"
    },
    {
      "description": "BLEMystique is an ESP32 based custom BLE target which can be configured by the user to behave like one of the multiple BLE devices. BLEMystique allows a pentester to play with the BLE side of different kind of smart devices with a single piece of affordable ESP32 chip. BLEMystique contains multiple device profiles, for example, Smart Lock, Smart health band, Smart bulb, Heart rate monitor, Smart Bottle and more.\n\n\nThe BLEMystique code and manuals will be released to general public. So, apart from using the pre-configured devices, the users can also add support for devices for their choice and use their ESP32 board for target practice. In this manner, this tool can improve the overall experience of learning BLE pentesting.",
      "speakers": [
        26279,
        26280
      ],
      "title": "BLEMystique – Affordable custom BLE target",
      "id": 26194,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "boofuzz is an open source network protocol fuzzing framework, competing with closed source commercial products like Defensics and Peach.\n\n\nInheriting from the open source tools Spike and Sulley, boofuzz improves on a long line of block-based fuzzing frameworks.\n\n\nThe framework allows hackers to specify protocol formats, and boofuzz does the heavy lifting of generating mutations specific to the format. boofuzz makes developing protocol-specific \"smart\" fuzzers relatively easy. Make no mistake, designing a smart network protocol fuzzer is no trivial task, but boofuzz provides a solid foundation for producing quality fuzzers.\n\n\nWritten in Python, boofuzz builds on its predecessor, Sulley, with key features including:\n\n-  Online documentation.\n\n-  More extensibility including support for arbitrary communications mediums.\n\n-  Built-in support for serial fuzzing, ethernet- and IP-layer, UDP broadcast.\n\n-  Much easier install experience!\n\n-  Far fewer bugs.",
      "speakers": [
        26281
      ],
      "title": "boofuzz",
      "id": 26195,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-12T00:50+0000"
    },
    {
      "description": "Home-based open source network analytics and machine learning threat detection\n\n\nCHIRON is a home analytics based on ELK stack combined with Machine\nLearning threat detection framework AKTAION. CHIRON parses and\ndisplays data from P0f, Nmap, and BRO IDS. CHIRON is  designed for\nhome use and will give great visibility to home internet devices\n(IOT, Computers, Cellphones, Tablets, etc). CHIRON is integrated with\nAKTAION which detects exploit delivery ransomware/phishing.",
      "speakers": [
        26282,
        26283
      ],
      "title": "CHIRON",
      "id": 26196,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T18:50+0000"
    },
    {
      "description": "Nowadays, cloud infrastructure is pretty much the de-facto service used by large/small companies. Most of the organisations have partially or entirely moved to cloud. With more and more companies moving to cloud, the security of cloud becomes a major concern.\nWhile AWS, GCP & Azure provide you protection with traditional security methodologies and have a neat structure for authorisation/configuration, their security is as robust as the person in-charge of creating/assigning these configuration policies. We all know, human error is inevitable and any such human mistake could lead to catastrophic damage to the environment.\n\n\nKnowing this, audit of cloud infrastructure becomes a hectic task! There are a few open source tools which help in cloud auditing but none of them have an exhaustive checklist. Also, collecting, setting up all the tools and looking at different result sets is a painful task. Moreover, while maintaining big infrastructures, system audit of server instances is a major task as well.\n\n\nCS Suite is a one stop tool for auditing the security posture of the AWS/GCP/Azure infrastructures and does OS audits as well. CS Suite leverages current open source tools capabilities and has custom checks added into one tool to rule them all.",
      "speakers": [
        26284
      ],
      "title": "Cloud Security Suite - One stop tool for AWS, GCP & Azure Security Audit",
      "id": 26197,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "Conformer is a penetration testing tool, mostly used for external assessments to perform password based attacks against common webforms. Conformer was created from a need for password guessing against new web forms, without having to do prior burp work each time, and wanting to automate such attacks. Conformer is modular with many different parameters and options that can be customized to make for a powerful attack. Conformer has been used in countless assessments to obtain valid user credentials for accessing the internal environment through VPN, other internal resources or data to further the assessment.",
      "speakers": [
        26285
      ],
      "title": "Conformer",
      "id": 26198,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T18:50+0000"
    },
    {
      "description": "Deception techniques - if deployed well - can be very effective for organizations to improve network defense and can be a useful arsenal for blue teams to detect attacks at very early stage of cyber kill chain. But the challenge we have seen is deploying, managing and administering decoys across large networks. Although there are lot of commercial tools in this space, we haven't come across open source tools which can achieve this.\n\n\nWith this in mind, we have developed DejaVu which is an open source deception framework which can be used to deploy, configure and administer decoys centrally across the infrastructure. A web-based management console can be used by the defender to deploy multiple interactive decoys (HTTP Servers,SQL,SMB,FTP,SSH,client side–NBNS) strategically across their network on different VLANs. Logging and alerting dashboard displays detailed information about the alerts generated and can be further configured to generate high accuracy alert; and how these alerts should be handled.\n\n\nDecoys can also be placed on the client VLANs to detect client side attacks such as responder/LLMNR attacks using client side decoys. Additionally, common attacks which the adversary uses to compromise such as abusing Tomcat/SQL server for initial foothold can be deployed as decoys, luring the attacker and enabling detection.",
      "speakers": [
        26286,
        26287
      ],
      "title": "DejaVU - An Open Source Deception Framework",
      "id": 26199,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T20:50+0000"
    },
    {
      "description": "EAPHammer is a toolkit for performing targeted evil twin attacks against WPA2-Enterprise networks. It is designed to be used in full scope wireless assessments and red team engagements. As such, focus is placed on providing an easy-to-use interface that can be leveraged to execute powerful wireless attacks with minimal manual configuration. To illustrate how fast this tool is, here's an example of how to setup and execute a credential stealing evil twin attack against a WPA2-EAP network in just two commands:\n\n\n # generate certificates\n\n./eaphammer --cert-wizard\n\n\n# launch attack\n\n./eaphammer -i wlan0 --channel 4 --auth wpa --essid CorpWifi --creds\n\n\nEAPHammer’s userbase has doubled since its debut in early 2017, and the project has matured substantially to meet this demand. It is now the first rogue AP attack tool to offer out-of-the-box support for attacks against 802.11n/ac. Most of the added complexity associated with these protocols is managed automatically by EAPHammer.\n\n We’ve also added some cool feature like Hashcat support, Karma, and SSID cloaking, as well as an extended UI and config management system for advanced users who require granular control over their rogue access points.\n\n \nTo check out the codebase, head to \nhttps://github.com/s0lst1c3/eaphammer",
      "speakers": [
        26288
      ],
      "title": "EAPHammer",
      "id": 26200,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T22:50+0000"
    },
    {
      "description": "Expl-iot is an open source flexible and extendable framework for IoT Security Testing and exploitation. It will provide the building block for writing exploits and other IoT security assessment test cases with ease. Expliot will support most IoT communication protocols, firmware analysis, hardware interfacing functionality and test cases that can be used from within the framework to quickly map and exploit an IoT product or IoT Infrastructure.It will help the security community in writing quick IoT test cases and exploits. The objectives of the framework are: 1. Easy of use 2. Extendable 3. Support for hardware, radio and IoT protocol analysisWe released Expl-iot ruby version in 2017. Once we started implementing hardware and radio functionality, we realized that ruby does not have much support for hardware and radio analysis which led us to deprecate it and re-write it in python to support more functionality. We are currently working on the python3 version and will release it in a month. The new beta release is envisioned to have support for UART(serial), ZigBee, BLE, MQTT, CoAP (next version will have support for JTAG, I2C and SPI) and few miscellaneous test cases.",
      "speakers": [
        26289
      ],
      "title": "Expl-iot - IoT Security Testing and Exploitation framework",
      "id": 26201,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T20:50+0000"
    },
    {
      "description": "Perimeter defenses are holding an important role in computer security. However, when we check the method of APT groups, a single spear-phishing usually enough to gain a foothold on the network. Therefore, red teams are mostly focused on \"assume breach\" type of scenarios. In these scenarios, testers need to use a post-exploitation framework. Besides that, testers also need to hide the server-agent communication from NIDS (Network Intrusion Detection Systems). firstorder is designed to evade Empire's C2-Agent communication from anomaly-based intrusion detection systems. It takes a traffic capture file (pcap) of the network and tries to identify normal traffic profile. According to results, it creates an Empire HTTP listener with appropriate options.",
      "speakers": [
        26290,
        26291
      ],
      "title": "firstorder",
      "id": 26202,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T18:50+0000"
    },
    {
      "description": "GreyNoise is a system that collects all of the background noise of the Internet. Using a large network of geographically and logically dispersed passive collector nodes, GreyNoise collects, labels, and analyzes all of the omnidirectional, indiscriminate Internet-wide scan and attack traffic. GreyNoise data can be used to filter pointless alerts in the SOC, identify compromised devices, pinpoint targeted reconnaissance, track emerging threats, and quantify vulnerability weaponization timelines.",
      "speakers": [
        26292
      ],
      "title": "GreyNoise",
      "id": 26203,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "GyoiThon is a fully automated penetration testing tool against web server. \nGyoiThon nondestructively identifies the software installed on web server (OS, Middleware, Framework, CMS, etc...) using multiple methods such as machine learning, Google Hacking, pattern matching. After that, GyoiThon executes valid exploits for the identified software. Finally, GyoiThon generates report of scan results. GyoiThon executes the above processing fully automatically.\n\n\nGyoiThon consists of three engines: \n\n\n* Software analysis engine:\n\nIt identifies software based on HTTP response obtained by normal access to web server using Machine Learning base and signature base. In addition, it uses Google Hacking.\n\n\n* Vulnerability determination engine:\n\nIt collects vulnerability information corresponding to identified software by the software analysis engine. And, it executes an exploit corresponding to the vulnerability of the software and checks whether the software is affected by the vulnerability.\n\n\n* Report generation engine:\n\nIt generates a report that summarizes the risks of vulnerabilities and the countermeasure.\n\n\nTraditional penetration testing tools are very inefficient because they execute all signatures. On the other hand, GyoiThon is very efficient because it executes only valid exploits for the identified software. As a result, the user's burden will be greatly reduce, and GyoiThon will greatly contribute to the security improvement of many web servers.",
      "speakers": [
        26293,
        26294,
        26295
      ],
      "title": "GyoiThon",
      "id": 26204,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T18:50+0000"
    },
    {
      "description": "Halcyon IDE lets you quickly and easily develop Nmap scripts for performing advanced scans on applications and infrastructures with a wide range capabilities from recon to exploitation. It is the first IDE released exclusively for Nmap script development. Halcyon IDE is free and open source project (always will be) released under MIT license to provide an easier development interface for rapidly growing information security community around the world. The project was initially started as an evening free time \"coffee shop\" project and has taken a serious step for its developer/contributors to spend dedicated time for its improvements very actively. More information and source code: https://halcyon-ide.org",
      "speakers": [
        26296
      ],
      "title": "Halcyon IDE",
      "id": 26205,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T18:50+0000"
    },
    {
      "description": "We (at ProtoCentral) developed the HealthyPi HAT for the Raspberry Pi as a way of opening up the healthcare and open source medical to anyone. The HealthyPi is made of the same \"medical-grade\" components found in regular vital sign monitors, for a fraction of the cost of such system. This is our way of democratizing medical hardware to develop new areas of research.\n\n\nOur objective when we began developing the HealthyPi was to make a simple vital sign monitoring system which is simple, affordable, open-source (important !) and accessible. HealthyPI is completely open-source and is our way of \"hacking\" patient monitoring systems by getting data that you need, in the way that you need and extending on that without getting involved in sticky proprietary NDAs and such.\n\n\n*Demo will allow people to come, check out and play with (and possibly hack) the HealthyPi device while getting their vital signs monitored.*",
      "speakers": [
        26297
      ],
      "title": "HealthyPi - Connected Health",
      "id": 26206,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T22:50+0000"
    },
    {
      "description": "We present Honeycomb - A repository of honeypot services and integrations for the information security community.\nOur vision: Honeycomb will be the pip or apt-get for honeypots.\n\n\nWhile working hard to create various honeypots for several high profile vulnerabilities, we realized we were repeating some of the underlying work that’s involved in creating a honeypot -  a useful honeypot is easy to deploy, configure and collects reports. We have these capabilities in Cymmetria’s commercial deception product but we wanted to open source this functionality to the community so everyone could benefit from it.\n\n\nEventually came the idea for honeycomb - an extensible platform for writing honeypots which comes with a repository of useful honeypots which makes it super easy to create new honeypots. Honeycomb and the honeypot repository together form a powerful tool for security professionals looking to gain threat intelligence on the latest threats.\n\n\nWe are currently in the process of finalizing the release of the project and working on releasing additional plugins. Join us to learn how to utilize existing honeycomb capabilities as well as writing honeypot services and integrations on your own!",
      "speakers": [
        26298,
        26299
      ],
      "title": "Honeycomb - An extensible honeypot framework",
      "id": 26207,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-12T00:50+0000"
    },
    {
      "description": "DNS is the control plane of the Internet. Usually DNS is used for good but:\n\n\n- It can be used to track users locations and their behaviour;\n\n- Malware uses DNS to command and control, exfiltrate data or redirect traffic;\n\n        - According with 2016 Cisco annual security report - 91.3% of malware use DNS;\n\n- Advertisements companies usually use separate and obscure domains to show ads;\n\n- Free DNS services (e.g. 1.1.1.1, 8.8.8.8, 9.9.9.9 etc) can help you to address some concerns but you can not define your own protection settings or ad filters.\n\n\nioc2rpz is a custom DNS server which automatically converts indicators (e.g. malicious FQDNs, IPs) from various sources into RPZ feeds and automatically maintains/updates them. The feeds can be distributed to any open source and/or commercial DNS servers which support RPZ, e.g. ISC Bind, PowerDNS. \nYou can run your own DNS server with RPZ filtering on a router, desktop, server and even Arduino. System memory is the only limitation.\n\n\nWith ioc2rpz you can define your own feeds, actions and prevent undesired communications.",
      "speakers": [
        26300
      ],
      "title": "ioc2rpz",
      "id": 26208,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T22:50+0000"
    },
    {
      "description": "Cracks passwords or keys from a small key space near instantly. A small key space being a few trillion (40+ bits). It costs about 3 bytes/key and usually <100ms. The largest known deployment (made by a different less efficient program) is 160 TB. It is assumed that people are running similar ones to attack brain wallets.",
      "speakers": [
        26301
      ],
      "title": "LHT (Lossy Hash Table)",
      "id": 26209,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T22:50+0000"
    },
    {
      "description": "Think of Local sheriff as a reconnaissance tool in your browser for gathering information about what companies know about you.\nWhile you as a user normally browse the internet it works in the background and helps you identify what sensitive information(PII – Name, Date Of Birth, Email, Passwords, Passport number, Auth tokens.) are being shared/leaked to which all third-parties and by which all websites.\n\n\nThe issues that Local Sheriff helps identify:\n\n    -  What sensitive information with is being shared this which parties?\n\n    -  What companies are behind these third parties?\n\n    -  What can they doing with this information? EG: de-anonymize users on the internet, create shadow profiles.\n\n\nLocal Sheriff can also be used by organizations to audit:\n\n    -   Which all the third-parties that are being used on their websites.\n\n    -   The third-parties on the websites are implemented in a way that respect user’s privacy and sensitive data is not being leaked to them.\n\n\nLocal Sheriff is a web-extension that can used with Chrome, Opera, Firefox.",
      "speakers": [
        26302
      ],
      "title": "Local Sheriff",
      "id": 26210,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T18:50+0000"
    },
    {
      "description": "Detecting attackers who use WiFi as a vector is hard because of\nsecurity issues inherent in the 802.11 protocol, as well as\ncommoditized ways of near-perfect spoofing of WiFi enabled devices.\n\n\nSecurity professionals work around this by treating WiFi traffic as\ninsecure and encrypting data on higher layers of the protocol stack.\nSophisticated attackers do not limit their efforts to jamming or\ntapping of wireless communication, but try to use deception techniques\nto trick human operators of WiFi devices into revealing secrets. The\nlist of attacks that are possible after a user has been convinced to\nconnect to a rogue access point that is under the attacker's control\nranges from DNS spoofing to crafted captive portals that can be used\nfor classic phishing attempts.\n\n\nThis is why the new nzyme release introduces its own set of WiFi\ndeception techniques. It is turning the tables and attempts to trick\nattackers into attacking our own simulated, wireless infrastructure\nthat resembles realistic clients and access points. Together with the\ngeneral collection of all 802.11 management frames already offered in\nthe existing release, nzyme now replays all relevant communication to\nand from our decoy transceivers to a log management system like\nGraylog for analysis and alerting. This combination allows tricking\nattackers into revealing themselves by leaving easy to identify traces\nduring all exploitation phases.\n\n\nApplying WiFi deception to defensive perimeters gives the blue team a\nchance to reveal, delay, and condition attackers.",
      "speakers": [
        26303
      ],
      "title": "nzyme",
      "id": 26211,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T18:50+0000"
    },
    {
      "description": "The tool is a stand alone web self service application that graphically represents all the evolving OpenC2 commands to allow OpenC2 application developers to click and generate OpenC2 commands. The tool makes it extremely easy for even beginners to work on the creation of OpenC2 commands. The tool provides the OpenC2 command output in JSON and in curl, nodejs and python code to be easily integrate into Incident Response or Orchestration platforms.",
      "speakers": [
        26304
      ],
      "title": "GUI Tool for OpenC2 Command Generation",
      "id": 26212,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T19:00+0000",
      "end_date": "2018-08-12T20:50+0000"
    },
    {
      "description": "Orthrus is a small appliance that allows the user to create a cryptographically secured USB volume from two microSD cards. The data on the two cards is encrypted with AES-256 XEX mode, and all of the key material used to derive the volume key is spread between the two cards. There are no passwords to manage. If you have both cards, you have everything. If you have only one, you have half the data encrypted with a key you cannot reconstruct. This allows for “two-man control” over a dataset. Orthrus itself has no keys of its own and a volume created or written with one Orthrus can be used with any other (or on any other thing that implements the Orthrus open specification). Orthrus is open source hardware and firmware.",
      "speakers": [
        26305
      ],
      "title": "Orthrus",
      "id": 26213,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T17:00+0000",
      "end_date": "2018-08-11T18:50+0000"
    },
    {
      "description": "PA Toolkit is a collection of traffic analysis plugins to extend the functionality of Wireshark from a micro-analysis tool and protocol dissector to the macro analyzer and threat hunter. PA Toolkit contains plugins (both dissectors and taps) covering various scenarios for multiple protocols, including:\n\n\n\n\n- WiFi   (WiFi network summary, Detecting beacon, deauth floods, Evil twin etc.)\n\n\n- VoIP ( Overview of extensions, servers, Detecting invite flood, message flood, SIP auth bruteforcing, Decrypting encrypted VoIP conversation)\n\n\n-  HTTP (Listing all visited websites, downloaded files, streaming files, Detecting HTTP Tunnels)\n\n\n-  HTTPS (Listing all websites opened on HTTPS, Detecting self-signed certificates)\n\n\n-  ARP (MAC-IP table, Detect MAC spoofing and ARP poisoning)\n\n\n-  DNS (Listing DNS servers used and DNS resolution, Detecting DNS Tunnels)\n\n\n\n\nThe key advantage of using PA toolkit is that any user can check security related summary and detect common attacks just by running Wireshark. And, he can do this on the platform of his choice. Also, as the project is open source and written in newbie-friendly Lua language, one can easily extend existing plugins or reuse the code to write plugins of his own.",
      "speakers": [
        26279,
        26280
      ],
      "title": "PA Toolkit – Wireshark plugins for Pentesters",
      "id": 26214,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-12T00:50+0000"
    },
    {
      "description": "Passionfruit is a cross-platform app analyze tool for iOS. It aims to provide a powerful and user friendly gui for app pentesting and reverse engineering. In this demo we’ll cover the most common tasks in iOS RE, like dumping decrypted apps from AppStore, exploring filesystem and other runtime introspections.",
      "speakers": [
        26306,
        26307
      ],
      "title": "Passionfruit",
      "id": 26215,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T18:50+0000"
    },
    {
      "description": "The PCILeech direct memory access attack toolkit was presented at DEF CON 24 and quickly became popular amongst red teamers and governments alike. Hardware sold out, FPGA support was introduced and devices are once again available! We will demonstrate how to take total control of still vulnerable systems via PCIe DMA code injection. Kernels will be subverted, full disk encryption defeated and shells spawned! Processes will be enumerated and their virtual memory abused - all by using affordable hardware and the open source PCILeech toolkit.",
      "speakers": [
        26308,
        26309
      ],
      "title": "PCILeech",
      "id": 26216,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-12T17:00+0000",
      "end_date": "2018-08-12T18:50+0000"
    },
    {
      "description": "An open platform for bug hunters emphasizing on manual security testing.\n\n\nSh00t is a dynamic task manager to replace simple text editors or task management tools that are NOT meant for security testing\nprovides checklists for security testing\nhelps in reporting with custom bug templates\n\n\nSh00t benefits best for pen testers, bug bounty hunters, security researchers and anybody who love bugs!\n\n\nWritten in Python and powered by Django web framework.",
      "speakers": [
        26310
      ],
      "title": "Sh00t - An open platform for manual security testers & bug hunters",
      "id": 26217,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T22:50+0000"
    },
    {
      "description": "The Swissduino is a set of tools on an Arduino Yun that allow for the upload of binaries to target systems remotely via USB HID Keyboard, and then provide TCP connectivity between the remote attacker system and the target purely through USB HID. The demonstration shows a Metasploit Meterpreter stub being uploaded, and then actively used without triggering anti-virus (Win 7 host…).\nNew for 2018: (In development) Expanded toolset that allows for password extraction from login and automated installation of toolkit in Windows 10 with anti-malware/local firewall, also targeting of Linux.",
      "speakers": [
        26311
      ],
      "title": "Swissduino – Stealthy USB HID Networking & Attack",
      "id": 26218,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-12T00:50+0000"
    },
    {
      "description": "trackerjacker is a new wifi tool that allows you to (a) see all wifi devices and which wifi networks they're connected to, along with how much data they've sent, how close by they are, etc, and (b) look for interesting traffic patterns and trigger arbitrary actions based on those patterns. The \"mapping\" functionality is sort of like nmap for wifi - it lists all wifi networks nearby, and under each network it lists all the clients connected to that network. The \"trigger\" functionality allows users to do things like \"if this device sends more than 10000 bytes in 30 seconds, do something\". It also includes a powerful Python plugin system that makes it simple to write plugins to do things like \"if I see an Apple device with a power level greater than -40dBm, deauth it\". If you want to do any sort of wifi recon/monitoring/hacking, trackerjacker will almost certainly make the job easier!",
      "speakers": [
        26312
      ],
      "title": "trackerjacker",
      "id": 26219,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "Walrus is an open-source Android app for contactless card cloning devices such as the Proxmark3 and Chameleon Mini. Using a simple interface in the style of Google Pay, access control cards can be read into a wallet to be written or emulated later.\n\n\nDesigned for physical security assessors during red team engagements, Walrus supports basic tasks such as card reading, writing and emulation, as well as device-specific functionality such as antenna tuning and device configuration. More advanced functionality such as location tagging makes handling multiple targets easy, while bulk reading allows the stealthy capture of multiple cards while “war-walking” a target.\n\n\nWe’ll be demoing Walrus live with multiple short- and long-range card cloning devices, as well as giving a sneak peek of future plans for the app.",
      "speakers": [
        26313,
        26314
      ],
      "title": "Walrus",
      "id": 26220,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T21:00+0000",
      "end_date": "2018-08-11T22:50+0000"
    },
    {
      "description": "Nowadays, security threats and cyber-attacks against ICS assets, became a topic of public interest worldwide. Within this demo, will be presented how HID attacks can still be used by threat actors to compromise industrial air-gapped environments.\nWHID Injector was born from the need for a cheap and dedicated hardware that could be remotely controlled in order to conduct HID attacks. WHID's core is mainly an Atmega 32u4 (commonly used in many Arduino boards) and an ESP-12s (which provides the WiFi capabilities and is commonly used in IoT projects).\nNontheless, during the last months, a new hardware was under R&D (i.e. WHID-Elite). It replaces the Wi-Fi capabilities with a 2G baseband, which gives unlimited operational range.\n\nThis cute piece of hardware is perfect to be concealed into USB gadgets and used during engagements to get remote shell over an air-gapped environment. In practice, is the \"wet dream\" of any ICS Red Teamer out there.\n\nDuring the demo we will see in depth how WHID and WHID-Elite were designed and their functionalities. We will also look at which tools and techniques Blue Teams can use to detect and mitigate this kind of attacks.",
      "speakers": [
        26315
      ],
      "title": "WHID Injector: Hot To Bring HID Attacks to the Next Level",
      "id": 26221,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T19:00+0000",
      "end_date": "2018-08-11T20:50+0000"
    },
    {
      "description": "WiPi Hunter is developed for detecting illegal wireless network activities. But, it shouldn't be seen only as a piece of code. Instead, actually, it is a philosophy. You can infere from this project new wireless network illegal activity detection methods. New methods new ideas and different point of views can be obtained from this project.\n\n\nExample: WiFi Pineapple attacks, Fruitywifi, mana-toolkit\n\n\nWiPi-Hunter Modules\n\nPiSavar: Detects activities of PineAP module and starts deauthentication attack (for fake access points - WiFi Pineapple Activities Detection)\n\nPiFinger: Searches for illegal wireless activities in networks you are connected and calculate wireless network security score (detect wifi pineapple and other fakeAPs)\n\nPiDense: Monitor illegal wireless network activities. (Fake Access Points)\n\nPiKarma: Detects wireless network attacks performed by KARMA module (fake AP). Starts deauthentication attack (for fake access points)\n\nPiNokyo: If threats like wifi pineapple attacks or karma attacks are active around, users will be informed about these threats.Like proxy (New)",
      "speakers": [
        26316,
        26317,
        26318
      ],
      "title": "WiPi-Hunter - It Strikes against Illegal Wireless Network Activities (Detect and active response)",
      "id": 26222,
      "link": "",
      "updated_at": "2018-07-02T23:54+0000",
      "conference": "DC26",
      "event_type": 4,
      "includes": "",
      "location": 26012,
      "start_date": "2018-08-11T23:00+0000",
      "end_date": "2018-08-12T00:50+0000"
    }
  ],
  "updated_at": "2018-07-02T23:54+0000"
}
