{
  "updated_at": "2018-08-01T02:55+0000",
  "speakers": [
    {
      "link": "",
      "description": "I'm just a Security researcher who's always using tools in unintended ways. I'm a defender by trade, I work on understating the adversary then designing the mitigations based on what I've learned. Currently I work at the intersection of healthcare and the cloud, designing systems that make it harder for the adversary to operate.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "0x200b",
      "id": 26001,
      "updated_at": "2018-08-01T02:55+0000"
    },
    {
      "link": "",
      "description": "Thiago Alves received his B.S. degree in electrical engineering from the\"Pontifícia Universidade Católica\" (PUC) in 2013. In 2014 he created OpenPLC, the world's first open source industrial controller. OpenPLC is being used as a valuable tool for control system research and education. The OpenPLC project has contributions from several universities and private companies, such as Johns Hopkins and FreeWave Technologies. In 2017 Thiago won first place in CSAW, the world's largest student-run cybersecurity competition, with his innovative embedded security solution for OpenPLC. Currently Thiago is a Ph.D. student at the University of Alabama in Huntsville. His research interests include cybersecurity for SCADA systems, industrial controllers and embedded systems.",
      "twitter": "",
      "conference": "DC26",
      "title": "Ph.D. Student and Graduate Research Assistant at the University of Alabama in Huntsville",
      "name": "Thiago Alves",
      "id": 26002,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ruo Ando is associate professor of NII (National Institute of Informatics) by special appointment in Japan. He has Ph.D of computer science. Before joining NII, he was engaged in research project supported by US AFOSR in 2003 (Grant Number AOARD 03-4049). He has presented his researches in PacSec2011 (BitTorrent crawler) and GreHack2013 (DNS security). He was co-presenter of SysCan2009 and FrHack2009 (Virtual machine instrospection). His current research interest is network security.",
      "twitter": "",
      "conference": "DC26",
      "title": "Center for Cybersecurity Research and Development, National Institute of Informatics, Japan",
      "name": "Ruo Ando",
      "id": 26003,
      "updated_at": "2018-07-23T15:16+0000"
    },
    {
      "link": "",
      "description": "Xiaolong Bai (twitter@bxl1989, github@bxl1989) is a security engineer in Alibaba Orion Security Lab. Before joining Alibaba, he received his Ph.D. degree in Tsinghua University. He has published several research papers on top conferences including IEEE S&P, Usenix Security, CCS, NDSS, and presented his research in Black Hat USA and Hack In The Box. He has been acknowledged by famous vendors, including Apple, Google, Facebook, Evernote, and Tencent for his contribution in discovering the vulnerabilities in their systems and improving the security of their products. He is a member of the OverSky team for private jailbreaking development.\n@bxl1989",
      "twitter": "@bxl1989",
      "conference": "DC26",
      "title": "Security Engineer, Alibaba Inc. ",
      "name": "Xiaolong Bai",
      "id": 26004,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Min (Spark) Zheng (twitter@SparkZheng, github@zhengmin1989) is a security expert in Alibaba Orion Security Lab. He received his Ph.D. degree in the CSE department of the CUHK. His research focuses on malware analysis, smartphone (Android & iOS) security, system design and implementation. Before receiving Alibaba A-Star offer award in 2015, he worked in FireEye, Baidu and Tencent. He was the champion of GeekPwn 2014 and AliCTF 2015. He won the\"best security researcher\" award in FIT 2016 for detecting the iOS/macOS vulnerabilities, XcodeGhost virus and WormHole RCE vulnerability. He is a member of the OverSky team for private jailbreaking development. He presented his research in DEF CON, HITB, BlackHat, RUXCON, etc.\n@SparkZheng",
      "twitter": "@SparkZheng",
      "conference": "DC26",
      "title": "Security Expert, Alibaba Inc.",
      "name": "Min (Spark) Zheng",
      "id": 26005,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Zhenxuan Bai is a freelance Security Researcher interests in smart contract and blockchain, consultant of UnicornTeam. He is a co-researcher of the decryption blackberry project, which manage to decrypt Blackberry BBM, PIN message and  BIS secure mail without keys.",
      "twitter": "",
      "conference": "DC26",
      "title": "Freelance Security Researcher",
      "name": "Zhenxuan Bai",
      "id": 26006,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Yuwei Zheng is a senior security researcher at Radio Security Department of 360 Technology, core member of UnicornTeam. He cracked the protocols of Blackberry BBM, PIN message, BIS secure mail, and successfully decrypted the messages without keys. He is currently focusing on the security research of cellular network, IoT system, and mobile baseband. He had presented his research works at top level security conferences like BlackHat, DEF CON, HITB etc.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Researcher, Unicorn Team, 360 Technology",
      "name": "Yuwei Zheng",
      "id": 26007,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Senhua Wang is a freelance Security Researcher interested in smart contract and blockchain, consultant of UnicornTeam",
      "twitter": "",
      "conference": "DC26",
      "title": "Freelance Security Researcher",
      "name": "Senhua Wang",
      "id": 26008,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Leader of PegasusTeam at 360 Radio Security Research Department in 360 Technology. He focuses on wireless security, including attack-defense research. He is the person in charge of the attack and defense technology of Skyscan Wireless Intrusion and Prevention System, One of the authors of the well-known wireless security tool MDK4. He leads his team to share the research results at HITB, HITCON, Blackhat, China ISC etc.\ntwitter@swe3per",
      "twitter": "@swe3per",
      "conference": "DC26",
      "title": "Leader of PegasusTeam at 360 Radio Security Research Department, 360 Technology",
      "name": "Kunzhe Chai",
      "id": 26009,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Yaniv Balmas is a software engineer and a seasoned professional in the security field. He wrote his very first piece of code in BASIC on the new Commodore-64 he got for his 8th birthday. As a teenager, he spent his time looking for ways to hack computer games and break BBS software. This soon led to diving into more serious programming, and ultimately, the security field where he has been ever since. Yaniv is currently leading the security research group at Check Point Software Technologies where he deals mainly with analyzing malware and vulnerability research.\n@ynvb",
      "twitter": "@ynvb",
      "conference": "DC26",
      "title": "Security Researcher, Check Point Software Technologies",
      "name": "Yaniv Balmas",
      "id": 26010,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Eyal Itkin is a vulnerability researcher in the Malware and Vulnerability Research group at Check Point Software Technologies. Eyal has an extensive background in security research, that includes years of experience in embedded network devices and protocols, bug bounties from all popular interpreter languages, and an award by Microsoft for his CFG enhancement white paper. When not breaking PTP or I2P, he loves bouldering, swimming, and thinking about the next target for his research.\n@EyalItkin",
      "twitter": "@EyalItkin",
      "conference": "DC26",
      "title": "Security Researcher, Check Point Software Technologies",
      "name": "Eyal Itkin",
      "id": 26011,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sheila Ayelen Berta is an Information Security Specialist and Developer, who started at 12 years-old by herself. At the age of 15, she wrote her first book about Web Hacking, published by RedUSERS Editorial in several countries. Over the years, she has discovered lots of vulnerabilities in popular web applications, softwares and given courses of Hacking Techniques in universities and private institutes. Sheila currently works at Eleven Paths as Security Researcher who specializes in offensive techniques, reverse engineering and exploit writing. She is also a developer in ASM (microcontrollers, x32/x64), C/C++ and Python. Sheila is an international speaker who has spoken at important security conferences such as Black Hat EU 2017, DEF CON 25 CHV, HITBSecConf, Ekoparty Security Conference, IEEE ArgenCon, Hack.Lu, OWASP Latam Tour and others.\n@UnaPibaGeek",
      "twitter": "@UnaPibaGeek",
      "conference": "DC26",
      "title": "Security Researcher at Eleven Paths",
      "name": "Sheila A. Berta",
      "id": 26012,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sergio De Los Santos is currently head of innovation and labs in Eleven Paths, responsible for researching, creating new projects, tools and prototypes. In the past (2005-2013), he was a Technical consultant in Hispasec (where VirusTotal was developed for 10 years), responsible for antifraud, vulnerabilities alert and other services mostly bank industry oriented. Sergio is responsible for the most veteran security newsletter in spanish. Since 2000 he has worked as an auditor and technical coordinator, written three technical security books and one about the history of security. He has an informatics degree, a master in software engineering and artificial intelligence and has been awarded with Microsoft MVP Consumer Security title in 2013-2017. He is a teacher and director of different courses, masters and lectures in universities and private companies.\n@ssantosv",
      "twitter": "@ssantosv",
      "conference": "DC26",
      "title": "Head of Innovation and Lab at Eleven Paths",
      "name": "Sergio De Los Santos",
      "id": 26013,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alexandre has been working as Malware and Security researcher at Blackstorm Security, where he is daily involved with malware analysis cases, forensic and fraud investigations,  reverse engineering and exploit development projects. In the past, Alexandre worked as instructor at Sun Microsystems for ten years and Symantec for six years. \nNowadays, he is reviewer of\"The Journal of Digital Forensics, Security and Law\", referee on \"Digital Investigation—The International Journal of Digital Forensics & Incident Response\" and member of the Digital Law and Compliance Committee at OAB/SP. \nSlides and articles written by Alexandre are available on: http://www.blackstormsecurity.com/bs/en/en_articles.html\n@ale_sp_brazil, http://www.linkedin.com/in/aleborges, http://www.blackstormsecurity.com",
      "twitter": "@ale_sp_brazil",
      "conference": "DC26",
      "title": "Malware and Security Researcher at Blackstorm Security",
      "name": "Alexandre Borges",
      "id": 26014,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Lane Broadbent is a Security Engineer performing threat hunting and full stack security engineering for Vivint, a tech company focused on IoT and home security. With over a decade of experience in research, pen testing, and jack of all trades systems administration, Lane now works to secure IoT devices and the systems that interact with them. In his free time, Lane tries to best the corporate NTP pool with parts salvaged from thrift stores.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Engineer, Vivint",
      "name": "Lane Broadbent",
      "id": 26015,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Thanh Bui is a doctoral candidate in the\"Secure systems\" group of Aalto University, Finland. His research focuses on analyzing and designing secure network protocols and distributed systems. He is a past Erasmus Mundus fellow and holds double master's degrees from Aalto University, Finland and KTH Royal Institute of Technology, Sweden.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher,  Aalto University, Finland",
      "name": "Thanh Bui",
      "id": 26016,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Siddharth (Sid) Rao is a doctoral candidate in the\"Secure systems\" group of Aalto University, Finland. He specializes in the security analysis of communication protocols, and his current interest lies in pedagogical study of the 'lack of authentication' in different systems. He is a past Erasmus Mundus fellow and holds double master's degrees from Aalto University, Finland and University of Tartu, Estonia. He has been Ford-Mozilla Open Web Fellow at European Digital Rights (EDRi), where helped to define policies related to data protection, surveillance, copyright, and network neutrality. He has previous spoken at security conferences such as Blackhat and Troopers.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher,  Aalto University, Finland",
      "name": "Siddharth Rao",
      "id": 26017,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alexei Bulazel (@0xAlexei) is a security researcher at ForAllSecure. He also provides expertise on reverse engineering and cyber policy at River Loop Security. Alexei has previously presented his research at venues such as Black Hat, REcon, and ShmooCon, among many others, and has published scholarly work at USENIX WOOT and ROOTS. Alexei is a proud alumnus of RPISEC.\n@0xAlexei",
      "twitter": "@0xAlexei",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Alexei Bulazel",
      "id": 26018,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Seamus Burke is an undergraduate student at UMBC pursing a degree in CS, he has been working in the security field field since he was 16 and has held a variety of positions from SOC analyst to malware analyst, to vulnerability researcher. Currently his research focus is on cellular baseband and kernel rootkits. When he's not staring at IDA, he likes to spend his time wrenching on cars and racing. \n@AlternateAdmin",
      "twitter": "@AlternateAdmin",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Seamus Burke",
      "id": 26019,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nick is a self-taught software engineer, hacker, and an avid CTFer. He started coding when he was 11 and planted his roots in video game hacking by 14. His game hacking endeavors lead to a profitable business which became the foothold for his career. Nick is the author of\"Game Hacking: Developing Autonomous Bots for Online Games,\" and has spoken about topics such as malware analysis, Windows internals, game hacking, and memory forensics at DEF CON, DerbyCon, HOPE, and other prestigious conferences. Previously a Senior Engineer at Bromium and currently a Senior Architect at Cylance, he's using his Windows internals experience to help make advances with endpoint protection, detection, and response.\n    https://twitter.com/nickcano93,     https://nickcano.com/,     https://github.com/nickcano",
      "twitter": "",
      "conference": "DC26",
      "title": " Senior Security Architect @ Cylance",
      "name": "Nick Cano",
      "id": 26020,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "David Melendez Cano, Spain, works as R&D software engineer for TV Studio manufacturer company, Albalá Ingenieros S.A. in Madrid. He has won several prices in robotic contests and he has been a speaker at Nuit Du Hack, RootedCON, NoConName,  Codemotion, HKOSCON, etc. Author of the book \"Hacking con Drones\" and robot builder. \n@taiksontexas",
      "twitter": "@taiksontexas",
      "conference": "DC26",
      "title": "R&D Embedded Systems Engineer. Albalá Ingenieros S.A.",
      "name": "David Melendez Cano",
      "id": 26021,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Damien is a senior security researcher who joined Digital Security in 2015 as the head of research and development. He discovered how wireless protocols can be fun to hack and quickly developed BtleJuice, one of the first Bluetooth Low Energy MitM framework. \nDamien presented at various security conferences including DEF CON, Hack In Paris, Chaos Communication Camp, Chaos Communication Congress, and a dozen times at Nuit du Hack, one of the oldest security conference.",
      "twitter": "",
      "conference": "DC26",
      "title": "Head of Research & Development, Digital Security",
      "name": "Damien \"virtualabs\" Cauquil",
      "id": 26022,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Whitney is a systems architect in South Carolina. She has held several roles throughout her career- security engineer, systems engineer, mobile developer, cloud architect, consulting architect, to name a few. In the last 15 years, she has worked on operations teams, support teams, development teams, and consulting teams, in both the private and public sector, supporting anywhere from a handful of users to hundreds of thousands. No matter the role, security has always been an area of passion and focus. \n@shortxstack",
      "twitter": "@shortxstack",
      "conference": "DC26",
      "title": "Senior Systems Engineer",
      "name": "Whitney Champion",
      "id": 26023,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Seth is an independent security consultant with Redpoint Security in Salt Lake City, where he performs security research and consulting for a various clients. He spends the majority of his time thinking up ways to exploit and secure applications, but has been known to pull out an IDE as the need arises. Over the course of his career, Seth has honed application security skills using offensive and defensive techniques, including tool development and research. He has an (un)healthy obsession with all things security related and regularly heads down the rabbit hole to research the latest vulnerability or possible exposures. Seth can regularly be found at developer meetups and security get-togethers, whether speaking or learning.\n@sethlaw",
      "twitter": "@sethlaw",
      "conference": "DC26",
      "title": "Application Security Consultant, Redpoint Security",
      "name": "Seth Law",
      "id": 26024,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "TheDarkTangent",
      "id": 26025,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Daniel has been working in infosec since 2004, is TIME's 2006 Person of the Year, and brews his own beer. Daniel is the primary author of both the Magical Code Injection Rainbow, a configurable vulnerability testbed, and FeatherDuster, an automated cryptanalysis tool.\n@dan_crowley",
      "twitter": "@dan_crowley",
      "conference": "DC26",
      "title": "Research Baron, IBM X-Force Red",
      "name": "Daniel \"unicornFurnace\" Crowley",
      "id": 26026,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mauro has many years of experience performing penetration testing and security assessments for clients in Canada, USA, Germany, Mexico and Venezuela. Mauro has experience across several industries, including finance, telecommunication, e-commerce, technology providers, retail, energy, healthcare, logistics and transportation, government; and education.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Mauro Paredes",
      "id": 26027,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jennifer Savage has over a decade of experience in tech including penetration testing, vulnerability assessment, vulnerability management, software development, technical management, and consulting services for companies ranging from startups to the Fortune 100.\n@savagejen",
      "twitter": "@savagejen",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Jen \"savagejen\" Savage",
      "id": 26028,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wiseacre\n Wiseacre was introduced to DEF CON by Roamer.  Though he appeared at his first DEF CON because of the Capture the Flag contest, Roamer and  showed him how to make DEF CON so much more than simply attending the talks.  From then on he made a point to participate in as much as he could.  Of course, this was all within the limits of social anxiety so, if it allowed participation as a wallflower, he was in!  Now, he wants to make sure everyone else gets to know as much as possible about this year's conference.  In his private life, Mike hacks managers and is happy anyone listens to him at all.\nwiseacre_mike",
      "twitter": "@highwiz",
      "conference": "DC26",
      "title": "Founder, DC 101",
      "name": "HighWiz",
      "id": 26029,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "For over 15 years, Nikita has worked to ensure DEF CON runs as smoothly as one can expect from a hacker conference. In addition to planning a vast array of details prior to DEF CON and thwarting issues while onsite, she also serves as the Director of Content for the CFP Review Board. \n@niki7a",
      "twitter": "@niki7a",
      "conference": "DC26",
      "title": "Director of Content & Coordination, DEF CON",
      "name": "Nikita",
      "id": 26030,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wiseacre\n Wiseacre was introduced to DEF CON by .  Though he appeared at his first DEF CON because of the Capture the Flag contest, Roamer and HighWiz showed him how to make DEF CON so much more than simply attending the talks.  From then on he made a point to participate in as much as he could.  Of course, this was all within the limits of social anxiety so, if it allowed participation as a wallflower, he was in!  Now, he wants to make sure everyone else gets to know as much as possible about this year's conference.  In his private life, Mike hacks managers and is happy anyone listens to him at all.\nwiseacre_mike",
      "twitter": "@highwiz",
      "conference": "DC26",
      "title": "CFP Vocal Antagonizer",
      "name": "Roamer",
      "id": 26031,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Chris \"Suggy\" Sumner is the polite one. He is a co-founder of the not-for-profit Online Privacy Foundation, who contribute to the field of online behavioural research. Suggy is also the CFP review board's undisputed fence sitting champion.\n@5uggy",
      "twitter": "@5uggy",
      "conference": "DC26",
      "title": "Co-Founder, Online Privacy Foundation",
      "name": "Chris \"Suggy\" Sumner",
      "id": 26032,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Since 1992, Jericho has been poking about the hacker/security scene.  His experience has allowed him to develop (and deliver—often in the form of rants) a great perspective on many topics, mostly security related.  He has been a speaker at security conferences worldwide, primarily for the free travel to exotic locales. A founding member of Attrition.org, he was also the content manager for the Open Source Vulnerability Database (OSVDB) and an officer in the Open Security Foundation (OSF).  He is a champion of security industry integrity and small misunderstood creatures.  He epitomizes the saying, \"Why be a pessimist?  It won't work, anyway.\"\n@attritionorg",
      "twitter": "@attritionorg",
      "conference": "DC26",
      "title": "\"Squirrel\"",
      "name": "Jericho",
      "id": 26033,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wiseacre was introduced to DEF CON by Roamer.  Though he appeared at his first DEF CON because of the Capture the Flag contest, Roamer and HighWiz showed him how to make DEF CON so much more than simply attending the talks.  From then on he made a point to participate in as much as he could.  Of course, this was all within the limits of social anxiety so, if it allowed participation as a wallflower, he was in!  Now, he wants to make sure everyone else gets to know as much as possible about this year's conference.  In his private life, Mike hacks managers and is happy anyone listens to him at all.\nwiseacre_mike",
      "twitter": "@highwiz",
      "conference": "DC26",
      "title": "Former Doer Of Things",
      "name": "Wiseacre",
      "id": 26034,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Shaggy has the Voice of Barry White, the brains of Albert Einstein and the soul of Bea Arthur. He has a few philosophies on life: He believes that while the righteous keep moving forward, those with clean hands become stronger and stronger . That the field of battle between God and Satan is the human soul. It is in the soul that the battle rages every moment of life. He also believes that one should Start by doing what's necessary; then do what's possible; and suddenly you are doing the impossible. Because You learn to speak by speaking, to study by studying, to run by running, to work by working, and just so, you learn to love by loving. All those who think to learn in any other way deceive themselves.",
      "twitter": "@highwiz",
      "conference": "DC26",
      "title": "The Mountain",
      "name": "Shaggy",
      "id": 26035,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "Emergency physician, Clinical Informatics fellow at The University of California San Diego.",
      "name": "Christian\"quaddi\" Dameff MD",
      "id": 26036,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jeff (r3plicant) Tully MD is an anesthesiologist, pediatrician, and researcher with an interest in understanding the ever-growing intersections between healthcare and technology. Prior to medical school he worked on\"hacking\" the genetic code of Salmonella bacteria to create anti-cancer tools, and throughout medical training has remained involved in the conversations and projects that will secure healthcare and protect our patients as we face a brave new world of remote care, implantable medical devices, and biohacking.\n@jefftullymd",
      "twitter": "@jefftullymd",
      "conference": "DC26",
      "title": "Pediatrician, Anesthesiologist, University of California Davis  ",
      "name": "Jeff \"r3plicant\" Tully MD",
      "id": 26037,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "Associate Professor of Computer Science, University of California San Diego",
      "name": "Kirill Levchenko PhD",
      "id": 26038,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Beau Woods is a leader with the I Am The Cavalry grassroots initiative, an Entrepreneur in Residence at the US Food and Drug Administration, a Cyber Safety Innovation Fellow with the Atlantic Council, and Founder/CEO of Stratigos Security. Beau has consulted with Global 100 corporations, the White House, members of Congress, foreign governments, and NGOs on some of the most critical cybersecurity issues of our time. Beau's focus is on Internet of Things (IoT) technologies where cybersecurity intersects public safety and human life issues, including healthcare, automotive, energy, oil and gas, aviation, transportation, and other sectors. Beau is a published author, frequent public speaker, often quoted in media, and is often engaged for public or private speaking venues.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Beau Woods",
      "id": 26039,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Roberto Suarez is a product security and privacy professional in the medical device and healthcare IT industry. At BD, Roberto is responsible for developing a Product Security Center of Excellence that drives process, capability and maturity to build products that are secure by design with transparency and control in mind. Giving product teams exposure to cyber security training and events, building their in-house expertise and promoting a company-wide community for product security is what Roberto is passionate about.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Roberto Suarez",
      "id": 26040,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jay Radcliffe is a Senior Security Consultant and Researcher. He is an offensive penetration tester with a knack for hardware hacking and embedded device security. He has given dozens of presentations at conferences around the world including DEF CON and Blackhat including several on the security of insulin pumps.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Jay Radcliffe",
      "id": 26041,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joshua Corman is a Founder of I am The Cavalry (dot org) and CSO for PTC. Corman previously served as Director of the Cyber Statecraft Initiative for the Atlantic Council, CTO for Sonatype, Director of Security Intelligence for Akamai, and in senior research & strategy roles for The 451 Group and IBM Internet Security Systems. He co-founded RuggedSoftware and IamTheCavalry to encourage new security approaches in response to the world's increasing dependence on digital infrastructure. Josh's unique approach to security in the context of human factors, adversary motivations and social impact has helped position him as one of the most trusted names in security. He also serves as an adjunct faculty for Carnegie Mellon's Heinz College and on the 2016 HHS Cybersecurity Task Force.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Joshua Corman",
      "id": 26042,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "David Nathans",
      "id": 26043,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Steven Danneman is a Security Engineer at Security Innovation in Seattle, WA, making software more secure through targeted penetration testing. Previously, he lead the development team responsible for all authentication and identity management within the OneFS operating system. Steven is also a finance geek, who opens bank accounts as a hobby and loves a debate about the efficient-market hypothesis.\n@sdanndev, https://www.linkedin.com/in/sdanneman/, sdann-dev.blogspot.com",
      "twitter": "@sdanndev",
      "conference": "DC26",
      "title": "Security Engineer, Security Innovation",
      "name": "Steven Danneman",
      "id": 26044,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "DEF CON Groups Global Coordinator",
      "name": "Brent White (B1TK1LL3R)",
      "id": 26045,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "Founder, DEF CON",
      "name": "Jeff Moss (The Dark Tangent)",
      "id": 26046,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "DEF CON Groups Global Ambassador",
      "name": "Jayson E. Street",
      "id": 26047,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "S0ups",
      "id": 26048,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Tim Roberts (byt3boy)",
      "id": 26049,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Casey Bourbonnais",
      "id": 26050,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio Coming Soon",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "April Wright",
      "id": 26051,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "_delta_zero performs machine learning on log data by day, and writes his dissertation on malware datasets by night. He was voted\"most likely to create Skynet\" by @alexcpsec, and he toys with offensive uses for machine learning in his free time. He has spoken at BlackHat USA, DEF CON, SecTor, BSidesLV/Charm, and the NIPS workshop on Machine Deception.\n@_delta_zero",
      "twitter": "@alexcpsec",
      "conference": "DC26",
      "title": "Senior Data Scientist, Salesforce",
      "name": "_delta_zero",
      "id": 26052,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Azeem Aqil is a security engineer at Salesforce. He works on building and maintaining the detection and response infrastructure that powers Salesforce security. Azeem is an academic turned hacker who has published and spoken at various academic security conferences.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Software Engineer, Salesforce",
      "name": "Azeem Aqil",
      "id": 26053,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Christopher Domas is a security researcher and embedded systems engineer, currently investigating scalable IoT security.  He is best known for releasing impractical solutions to non-existent problems, including the world's first single instruction C compiler (M/o/Vfuscator), toolchains for generating images in program control flow graphs (REpsych), showing that all programs can be reduced to the same instruction stream (reductio), and the branchless DOOM meltdown mitigations.  His more relevant work includes the sandsifter processor fuzzer, the binary visualization tool ..cantor.dust.., and the memory sinkhole x86 privilege escalation exploit.\n@xoreaxeaxeax",
      "twitter": "@xoreaxeaxeax",
      "conference": "DC26",
      "title": "Director of Research, Finite State",
      "name": "Christopher Domas",
      "id": 26054,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "egypt is a penetration tester for Black Hills Information Security and a contributor to the Metasploit Project. He is not a country.\n@egyp7",
      "twitter": "@egyp7",
      "conference": "DC26",
      "title": "Security Analyst, Black Hills Information Security",
      "name": "egypt",
      "id": 26055,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "William Vu is a security researcher at Rapid7 who works on the Metasploit Project.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher, Rapid7",
      "name": "William Vu",
      "id": 26056,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ian enjoys researching systems and networking problems and solutions in an effort to make the world more secure. He has published research papers analyzing the new gTLD land rush and crawling and parsing most WHOIS records. From demonstrating how insecure aftermarket OBD \"dongles\" can be used to compromise and take over automobiles; to measuring the paths an email traverses online with encryption in an effort to increase integrity, authenticity, and confidentiality; and more. During the day Ian is a Security Engineer fighting for the users.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Ian Foster",
      "id": 26057,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dylan is a security engineer, who in his free time authors lots of open source projects, such as truffleHog. He graduated college in 2015 and has been working in security ever since.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Dylan Ayrey",
      "id": 26058,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joshua Franklin has over a decade of experience working with election technology, and is a security engineer at the National Institute of Standards and Technology (NIST) focusing on cellular and electronic voting security. Prior to NIST, Joshua worked at the U.S. Election Assistance Commission gathering hands-on experience with a variety of voting technologies. Joshua managed federal certification efforts and alongside election officials, labs, and manufacturers across the United States. Joshua recently co-chaired the Election Cybersecurity Working Group, and was the principal author for the security portions of the next generation of federal voting system standards.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Joshua M Franklin ",
      "id": 26059,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Kevin Franklin has several decades of technology experience in big data. He possesses an undergraduate degree in Engineering from Mississippi State University and a masters degree in Computer Science from Southern Polytechnic University.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Kevin Franklin",
      "id": 26060,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Leigh-Anne Galloway is a Security Researcher who specializes in the areas of application and payment security. Leigh-Anne started her career in incident response, leading investigations into payment card data breaches. This is where she discovered her passion for security advisory and payment technologies. She has presented and authored research on ATM security, application security and payment technology vulnerabilities, and has previously spoken at DevSecCon, BSides, Hacktivity, 8dot8, OWASP, and Troopers.\n@L_AGalloway",
      "twitter": "@L_AGalloway",
      "conference": "DC26",
      "title": "Cyber Security Resilience Lead, Positive Technologies",
      "name": "Leigh-Anne Galloway",
      "id": 26061,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Tim Yunusov is a Senior Expert in the area of banking security and application security. He has authored multiple research in these areas including \"Apple Pay replay attacks\" (Black Hat USA 2017), \"7 sins of ATM protection against logical attacks\" (PacSec, POC), \"Bruteforce of PHPSESSID\", \"XML Out-Of-Band\" (Black Hat EU), and is rated in the Top Ten Web Hacking Techniques by WhiteHat Security. He regularly speaks at conferences and has previously spoken at CanSecWest, Black Hat USA, Black Hat EU, HackInTheBox, Nullcon, NoSuchCon, Hack In Paris, ZeroNights and Positive Hack Days.\n@a66at",
      "twitter": "@a66at",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Tim Yunusov",
      "id": 26062,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Morgan is a student at the University of New Mexico where he studies an unrelated topic entirely, but does network security because it's interesting. Previously, he's spoken on subjects such as web proxies, community engagement, and typesetting. He started working with computers when he was a young child and hasn't given them up since, even if his wrists seem to disagree.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Morgan ``indrora'' Gangwere",
      "id": 26063,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alfonso Garcia Alguacil is a penetration tester and security consultant with 7 years of experience. Words like exploit, code or binary would quickly catch his attention. He currently works at Cisco as a senior security consultant.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Penetration Tester, Cisco",
      "name": "Alfonso García Alguacil",
      "id": 26064,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alejo Murillo Moya has been always passionate about security with 10+ years of experience as a penetration tester and security consultant, achieving during that journey important technical certifications like CREST and GIAC GSE. He is currently working at Cisco as a red teaming lead and managing security consultant.",
      "twitter": "",
      "conference": "DC26",
      "title": "Red Team Lead EMEAR, Cisco",
      "name": "Alejo Murillo Moya",
      "id": 26065,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dennis is a grad student at TU Darmstadt and a researcher at Northeastern University. He was a member of one european ISP's CERT for several years.\n\n\nWhile being interested in physical security and lockpicking, he enjoys applied research and reverse engineering malware and all kind of devices.\n\n\nHis latest victim is the Xiaomi IoT cloud. Hehas presented at the Chaos Communication Congress and the REcon BRX.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Dennis Giese",
      "id": 26066,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Matt Goerzen studies trolling techniques and cultures as part of the Media Manipulation team at Data & Society. He's also applied many of the techniques in the art world, for example by once developing an absurdist AdSense campaign ostensibly designed to sell a hideous sculpture to art collector Shaquille O'Neal, but more accurately designed to piggyback off of free clickbait media attention to inform readers about psychometric ad tech practices. He has written an academic study of contemporary artists who function as what he calls\"critical trolls,\" arguing that trolling can be seen as an extension of the politicized attentional strategies used by the 20th-century avant-garde. His current work at Data & Society focuses on mapping the way white supremacists and state actors have appropriated trolling techniques for use in influence operations as a form of\"bottom-up agenda setting.\"",
      "twitter": "",
      "conference": "DC26",
      "title": "Researcher, Data & Society",
      "name": "Matt Goerzen",
      "id": 26067,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jeanna Matthews is an associate professor of Computer Science at Clarkson University and a 2017-18 fellow at Data and Society where she has been collaborating with the Media Manipulation team. She was a speaker and DEF CON 23 and 24, both times on the topic of vulnerabilities in virtual networks. Her broader research interests include virtualization, cloud computing, computer security, computer networks, operating systems and algorithmic accountability and transparency. Jeanna received her Ph.D. in Computer Science from the University of California at Berkeley and is an ACM Distinguished Speaker.\n@jeanna_matthews",
      "twitter": "@jeanna_matthews",
      "conference": "DC26",
      "title": "Fellow at Data & Society, Associate Professor of Computer Science at Clarkson University",
      "name": "Dr. Jeanna Matthews",
      "id": 26068,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joan Donovan is the Media Manipulation/Platform Accountability Research Lead at Data and Society in Manhattan. After completing her PhD in Sociology  and Science Studies at the University of California San Diego, she was a postdoctoral fellow at the UCLA Institute for Society and Genetics, where she researched white supremacists' use of DNA ancestry tests, social movements, and technology. For several years, Joan has conducted action research with different networked social movements in order to map and improve the communication infrastructures built by protesters. In her role as a participant, she identifies information bottlenecks, decodes algorithmic behavior, and connects organizations with other like-minded networks.",
      "twitter": "",
      "conference": "DC26",
      "title": "Media Manipulation/Platform Accountability Research Lead, Data and Society in Manhattan",
      "name": "Joan Donovan",
      "id": 26069,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Guang Gong (@oldfresher) is a senior security researcher of Qihoo360 and the team leader of 360 Alpha Team. His research interests included Windows rootkits, virtualization and cloud computing. He currently focuses on mobile security, especially on hunting and exploiting Android's vulnerabilities. He has spoken at several security conferences such as Black Hat, CanSecWest, PHDays, SyScan360, MOSEC, PacSec and so on. He is the winner of Mobile Pwn2Own 2015(the target: Nexus 6), Pwn0Rama 2016 (the category of mobile devices), Pwn2Own 2016 (the target: Chrome), PwnFest 2016(the target: Pixel XL), Mobile Pwn2Own 2017(the target: Galaxy S8).\n@oldfresher",
      "twitter": "@oldfresher",
      "conference": "DC26",
      "title": "Alpha Team at Qihoo 360",
      "name": "Guang Gong",
      "id": 26070,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wenlin Yang is a junior researcher of Qihoo 360 and the team member of 360 Alpha Team. He currently focuses on Android's vulnerabilities. He has submitted multiple bugs to Google and several other vendors in China and received some acknowledgments.",
      "twitter": "",
      "conference": "DC26",
      "title": "Alpha Team at Qihoo 360",
      "name": "Wenlin Yang",
      "id": 26071,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jianjun Dai (@Jioun_dai) is a security researcher of Qihoo360 Alpha Team, he focus on Android system security research, vulnerability hunting and exploiting development. Previously, he is a security developer, major work include network protocol analysis, vulnerability detection, botnet and backdoor detection, sandbox technology research and development, etc. He have been in Android vulnerability research for more than two years, he found lots of vulnerabilities in AOSP, and won the Bug Bounty. He is a speaker at the CanSecWest conference.",
      "twitter": "@Jioun_dai",
      "conference": "DC26",
      "title": "Security researcher of Qihoo360 Alpha Team",
      "name": "Jianjun Dai",
      "id": 26072,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dr. Rachel Greenstadt (PI) is an Associate Professor of Computer Science at Drexel University where she teaches graduate-level courses in computer security, privacy, and machine learning. She founded the Privacy, Security, and Automation Laboratory at Drexel University in 2008. Dr. Greenstadt was among the first to explore the effect of adversarial attacks on stylometric methods, and the first to demonstrate empirically how stylometric methods can fail in adversarial settings while succeeding in non-adversarial settings. \nShe has a history of speaking at hacker conferences including DEF CON 14, ShmooCon 2009, 31C3, and 32C3. \nDr. Greenstadt's scholarship has been recognized by the privacy research community. She is an alum of the DARPA Computer Science Study Group and a recipient of the NSF CAREER Award. Her work has received the PET Award for Outstanding Research in Privacy Enhancing Technologies and the Andreas Pfitzmann Best Student Paper Award. She currently serves as co-editor-in-chief of the journal Proceedings on Privacy Enhancing Technologies (PoPETs).  Her research has been featured in the New York Times, the New Republic, Der Spiegel, and other local and international media outlets.\n@ragreens",
      "twitter": "@ragreens",
      "conference": "DC26",
      "title": "Associate Professor, Drexel University",
      "name": "Rachel Greenstadt",
      "id": 26073,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Aylin Caliskan is an assistant professor of computer science at George Washington University. Her research interests include the emerging science of bias in machine learning, fairness in artificial intelligence, data privacy, and security. Her work aims to characterize and quantify aspects of natural and artificial intelligence using a multitude of machine learning and language processing techniques. In her recent publication in Science, she demonstrated how semantics derived from language corpora contain human-like biases. In addition, she developed novel privacy attacks to de-anonymize programmers using code stylometry. Her presentations on both de-anonymization and bias in machine learning are the recipients of best talk awards. Her work on semi-automated anonymization of writing style furthermore received the Privacy Enhancing Technologies Symposium Best Paper Award. Her research has received extensive press coverage across the globe. Aylin holds a PhD in Computer Science from Drexel University and a Master of Science in Robotics from the University of Pennsylvania. She has previously spoken at 29C3, 31C3, 32C3, and 33C3.\n@aylin_cim",
      "twitter": "@aylin_cim",
      "conference": "DC26",
      "title": "Assistant professor of Computer Science, George Washington University",
      "name": "Dr. Aylin Caliskan",
      "id": 26074,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ian Haken is a senior security software engineer at Netflix where he works on the platform security team to develop tools and services that defend the Netflix platform. Before working at Netflix, he spent two years as security researcher at Coverity where he developed defensive application security tools and helped to develop automated discovery of security vulnerabilities through static software analysis. He received his Ph.D. in mathematics from the University of California, Berkeley in 2014 with a focus in computability theory and algorithmic information theory.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Software Engineer, Netflix",
      "name": "Ian Haken",
      "id": 26075,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Silke is a security expert at Nokia Bell Labs (Research branch of Nokia). She holds a PhD in Mathematics and has 18 years of experience in mobile security research and standardization. In her current research she investigates new and existing mobile network security attacks using SS7, Diameter and GTP protocols via the interconnection network and how to counter those attacks in 4G/5G networks. She found many 4G related IPX attacks and countermeasures e.g. Location Tracking (NATO CyCon), DoS (Black Hat EU 2016), cellular data interception (34C3 Chaos Computer Congress). She drives in the operator association GSMA the security of cellular network and being responsible there for the Diameter Signaling Security Specification. She served as a special matter expert on cellular security to the US Federal Communication Commission and to the European Union Agency for Network and Information Security. She is rapporteur of ten 3GPP security specifications and has a long track record of security publications. \nCurrently, she is actively supporting the 5G Roaming security developments. For her the interesting part is fixing problems in world wide network without breaking it, not finding an issue.\n@SHoltmanns",
      "twitter": "@SHoltmanns",
      "conference": "DC26",
      "title": "Distinguished Member of Technical Staff, Security Expert, Nokia Bell Labs",
      "name": "Dr. Silke Holtmanns",
      "id": 26076,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Isha is a master student at Aalto University in Helsinki (Finland) and doing her Thesis research work at Nokia Bell Labs under supervision of Professor Raimo Kantola. She is completing her Master's in Wireless Communication as major subject and Machine Learning as minor. Her research covers smart city environmental perception from ambient cellular signals and 5G Ubiquitous sensing. She is passionate about IoT devices and their security in 5G scenario. She has experiences on embedded devices (Arduino, Raspberry Pi) for multiple projects like Analog to Digital converter used in optical communication. Presently she is exploring Cybersecurity, starting from the mobile communication core network security. Testing for vulnerabilities and loopholes and providing solutions using Machine Learning.",
      "twitter": "",
      "conference": "DC26",
      "title": "Master student, Aalto University in Helsinki (Finland",
      "name": "Isha Singh",
      "id": 26077,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wu HuiYu is a security researcher at Tencent Blade Team of Tencent Security Platform Department. Now his job is mainly focus on IoT security research and mobile security research. He is also a bug hunter, winner of GeekPwn 2015, and speaker of HITB 2018 AMS & POC2017.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher At Tencent Blade Team",
      "name": "Wu HuiYu",
      "id": 26078,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Qian Wenxiang is a security researcher at the Tencent Blade Team of Tencent Security Platform Department. His is focusing on security research of IoT devices. He also performed security audits for web browsers. He was on the top 100 of annual MSRC list (2016 & 2017 ).  He published a book called \"Whitehat Talk About Web Browser Security \".",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher At Tencent Blade Team",
      "name": "Qian Wenxiang",
      "id": 26079,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Louis is a Security Analyst working at GoSecure in Montreal where he specializes in offensive appsec and pentest on medium to large scale organizations. Seasoned CTF participant and sometimes finalist with the DCIETS team, he has also written challenges for various competitions. Having recently obtained his Software Engineering degree, he dabbles in various research engagements between pentests.\n@ldionmarcil",
      "twitter": "@ldionmarcil",
      "conference": "DC26",
      "title": "Pentester at GoSecure",
      "name": "ldionmarcil",
      "id": 26080,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Eduardo Izycki and Rodrigo Colli are both independent researchers with experience on information security and incident response. They worked in private-public task force for threat and risk assessment to major events in Brazil during the Confederations Cup 2013, World Cup 2014 and Olympic Games 2016.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Eduardo Izycki",
      "id": 26081,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Rodrigo Colli",
      "id": 26082,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ryan Johnson is a PhD student at George Mason University in Fairfax, VA. His research interests are static and dynamic analysis of Android apps and reverse engineering. He is a co-founder of Kryptowire LLC.",
      "twitter": "",
      "conference": "DC26",
      "title": "Director of Research at Kryptowire",
      "name": "Ryan Johnson",
      "id": 26083,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dr. Angelos Stavrou founded Kryptowire LLC, and he is an Associate Professor at George Mason University (GMU) and the Director of the Center for Assurance Research and Engineering (CARE) at GMU.",
      "twitter": "",
      "conference": "DC26",
      "title": "CEO at Kryptowire",
      "name": "Angelos Stavrou",
      "id": 26084,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "RobJoyce",
      "id": 26085,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Truman Kain has taken everything he has learned as a web designer, internet marketer and mobile developer, and applied these insights directly into the development and experience of Dragnet. Why shouldn't your go-to social-engineering tool be as smooth and intuitive as your favorite mobile app?",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Associate, Tevora",
      "name": "Truman Kain",
      "id": 26086,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dongsung Kim is a graduate student at Sungkyunkwan University, South Korea. After developing software as a profession for several years, his interests have shifted to Internet security. He participated in bug bounty programs like Jet, The New York Times, United Airlines, and at his own university. His research interests span from reverse engineering to web security.\n@kid1ng",
      "twitter": "@kid1ng",
      "conference": "DC26",
      "title": "Graduate Student, Sungkyunkwan University",
      "name": "Dongsung Kim",
      "id": 26087,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Prof. Hyoung-Kee Choi received his Ph.D. in electrical and computer engineering from Georgia Institute of Technology in 2001. He is a professor at Sungkyunkwan University, South Korea. He joined Lancope in 2001 until his leave in 2004, where he guided and contributed to research in Internet security. His research interests span network security and vulnerability assessment.",
      "twitter": "",
      "conference": "DC26",
      "title": "Professor, Sungkyunkwan University",
      "name": "Hyoung-Kee Choi",
      "id": 26088,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Matt is a security geek responsible for ensuring platform and firmware trust at a cloud service provider, and dedicates an inordinate amount of time to updating firmware as a result. He has pen tested a broad range of systems as a product security validation lead at a prominent processor vendor, and has a history of rendering all manner of computing devices inoperable.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Matt King",
      "id": 26089,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joe Grand (@joegrand), also known as Kingpin, is a computer engineer, hardware hacker, former DEF CON badge designer, teacher, advisor, runner, daddy, honorary doctor, TV host, member of legendary hacker group L0pht Heavy Industries, and the proprietor of Grand Idea Studio (grandideastudio.com). He has been creating, exploring, and manipulating electronic systems since the 1980s.\n@joegrand",
      "twitter": "@joegrand",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Joe Grand",
      "id": 26090,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Matt Knight (@embeddedsec) is a Senior Security Engineer with Cruise Automation, where he works on securing autonomous cars and the infrastructure that supports them. Matt also leads the RF practice at River Loop Security, an embedded systems security and design consultancy. With specific interests in RF networks and physical layers, he notably reverse engineered the LoRa PHY based on blind signal analysis, and has run several trainings on RF reverse engineering fundamentals. Matt holds a BE in Electrical Engineering from Dartmouth College.\n@embeddedsec",
      "twitter": "@embeddedsec",
      "conference": "DC26",
      "title": "Senior Security Engineer, Cruise Automation",
      "name": "Matt Knight",
      "id": 26091,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ryan Speers (@rmspeers) is a security researcher and developer who enjoys embedded systems, low-power radio protocols, and reversing proprietary systems. He has worked in offensive and defensive roles on networks, Windows, micro controllers, and many things in-between. As co-founder at River Loop Security, he tests embedded systems for security issues, and helps clients build more secure systems. He is also Director of Research for Ionic Security where he leads system and cryptographic research. He has previously spoken at a number of security conferences and written some articles for journals ranging from peer-reviewed academic publications to PoC||GTFO.\n@rmspeers",
      "twitter": "@rmspeers",
      "conference": "DC26",
      "title": "Director of Research, Ionic Security",
      "name": "Ryan Speers",
      "id": 26092,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Marina Krotofil is a Principal Analyst in Cyber-Physical group at FireEye (USA). Previously she worked as a Lead Cyber Security Researcher at Honeywell (USA) and as a Senior Security Consultant at the European Network for Cyber Security (Netherlands). She spent seven years researching on offensive Industrial Control Systems (ICS)security: discovering and weaponizing unique attack vectors, engineering damage scenarios and understanding attacker techniques when exploiting ICS. Marina offensive security skills serves her well during Incident Responses, ICS malware analysis and when engineering defenses. She authored more than 20 academic and white papers on ICS security and is a frequent speaker at the leading security events around the world. She holds MBA in Technology Management, MSc in Telecommunication and MSc in Information and Communication Systems.\n@marmusha",
      "twitter": "@marmusha",
      "conference": "DC26",
      "title": "Principal Analyst, FireEye",
      "name": "Marina Krotofil",
      "id": 26093,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ali Abbasi is a Ph.D. candidate in Distributed and Embedded System Security group at the University of Twente, The Netherlands and visiting Ph.D. researcher at the Chair of Systems Security of Ruhr-University Bochum, Germany. His research interest involves embedded systems security mostly related to Industrial Control Systems, Critical Infrastructures security, and Real-Time Operating Systems security. He received his master degree in Computer Science from Tsinghua University, Beijing, China in 2013. He was working there on Programmable Logic Controller (PLC) security in Network Security Lab, Microprocessor and SoC Technology R&D center with the National 863 High-tech Program grant from Ministry of Industry and Information Technology of China. He is currently designing system-level protection mechanisms to battle against the sophisticated memory corruption and code-reuse attacks against PLCs and other critical real-time embedded systems as well designing intelligent methods for embedded systems fuzzing. Before that, Ali was working as Head of Vulnerability Analysis and Penetration Testing Group at National Computer Security Incident Response Team (CSIRT) at the Sharif University of Technology in Tehran, Iran.\n@bl4ckic3",
      "twitter": "@bl4ckic3",
      "conference": "DC26",
      "title": "Postdoctoral researcher, Ruhr University Bochum",
      "name": "Ali Abbasi",
      "id": 26094,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Thorsten Holz is a full professor in the Faculty of Electrical Engineering and Information Technology at Ruhr-University Bochum, Germany. His re_se_arch in_te_rests in_clu_de sys_tems-ori_en_ted as_pects of se_cu_re sys_tems, with a spe_ci_fic focus on ap_p_lied com_pu_ter se_cu_ri_ty. Cur_rent_ly, his work con_cen_tra_tes on automated analysis of malicious software, vulnerability analysis, security aspects of embedded systems, bots/bot_nets and stu_dy_ing la_test at_tack vec_tors. In 2014 he received an ERC Starting Grant to develop binary analysis techniques for embedded systems. Thorsten has published more than 80 peer-reviewed papers and served on the PC of the leading security conferences. He re_cei_ved the Dipl.-In_form. de_gree in Com_pu_ter Sci_ence from RWTH Aa_chen, Ger_ma_ny (2005), and the Ph.D. de_gree from Uni_ver_si_ty of Mann_heim (2009). Prior to joi_ning Ruhr-Uni_ver_si_ty Bo_chum in April 2010, he was a post_doc_to_ral re_se_ar_cher in the Au_to_ma_ti_on Sys_tems Group at the Tech_ni_cal Uni_ver_si_ty of Vi_en_na, Aus_tria. In 2011, Thors_ten re_cei_ved the Heinz Mai_er-Leib_nitz Prize from the Ger_man Re_se_arch Fo_un_da_ti_on (DFG).\n@thorstenholz",
      "twitter": "@thorstenholz",
      "conference": "DC26",
      "title": "Professor, Ruhr University Bochum",
      "name": "Thorsten Holz",
      "id": 26095,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "L0pht Heavy Industries was a hacker collective active between 1992 and 2000 and located in the Boston, Massachusetts area. The L0pht was one of the first viable hackerspaces in the US, and a pioneer of coordinated disclosure. In May, 1998, the group testified in front of a US Senate committee on weak computer security in government where they famously exclaimed they could take down the Internet in 30 minutes.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker Collective",
      "name": "L0pht Heavy Industries",
      "id": 26096,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Elinor Mills has been intrigued by hackers since she covered DEF CON III as a journalist in 1995. Following four years reporting for the Associated Press, she joined IDG News Service and for an early travel assignment headed off to the Las Vegas desert for the annual hacker pilgrimage (a trek she's taken more than a dozen times since). There she learned about the nuances of hacking, delighted in the Spot-the-Fed contests and met youth who would one day be leaders in securing the internet today. She went on to reporting jobs at The Industry Standard, Reuters and CNET over the next two decades covering a variety of tech topics, but her main interest remained security and the passion and intellectual drive of the people looking for the flaws that threaten our digital lives. Today, she helps hackers and security entrepreneurs spread the gospel as Senior Vice President of Content and Media Strategy at Bateman Group. Software may be eating the world, but hackers are keeping it safe.\n@elinormills",
      "twitter": "@elinormills",
      "conference": "DC26",
      "title": "Senior Vice President of Content and Media Strategy at Bateman Group",
      "name": "Elinor Mills",
      "id": 26097,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "DilDog joined the L0pht shortly after graduating from MIT, leaving his job at a major bank to work on a password cracker in a warehouse with a bunch of hacker misfits. Thankfully, that wasn't as ridiculous as it sounded, and it turned out that L0phtCrack would be kind of a big deal. He's still the primary maintainer of the codebase today, 20 years later. Also at L0pht and @stake, he developed AntiSniff, a promiscuous-mode device detection system, wrote a bunch of security advisories, and developed a fine cDc-brand remote administration tool named Back Orifice 2000. Also at L0pht and throughout the @stake acquisition, he developed an automated software decompilation system that would become the core of the static analysis technology for the startup he and Chris Wysopal would found in 2006, Veracode.",
      "twitter": "@stake",
      "conference": "DC26",
      "title": "Hacker, Co-Founder, Veracode",
      "name": "DilDog",
      "id": 26098,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joe Grand, also known as Kingpin, is a computer engineer, hardware hacker, former DEF CON badge designer, and proprietor of Grand Idea Studio (grandideastudio.com). He joined the L0pht as a 16-year-old in 1992. The youngest member and technological juvenile delinquent, the L0pht kept him out of trouble and helped redirect his passion towards good. Kingpin worked on the POCSAG Pager Decoder Kit, AMPS-based cellular phone hacking, and Palm OS application development, among other things. He was also a t-shirt shipper, food picker-upper, MIT Flea Market hawker, and terrified speaker at the US Senate Testimony in 1998. Kingpin was responsible for getting everyone sick in his attempt at making the infamous L0pht R00t B33r. He still hasn't apologized.\n@joegrand",
      "twitter": "@joegrand",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Joe Grand, Kingpin",
      "id": 26099,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Space Rogue (Cris Thomas) joined the L0pht in 1992. While there he created one of the first Macintosh hacking sites, The Whacked Mac Archives and released an early MacOS exploit for FWB Hard Disk ToolKit. Later, while still at the L0pht he created and ran the Hacker News Network. He was part of the L0pht's US Senate Testimony in 1998. After the L0pht Space Rogue went on to work at security companies such as @Stake, Guardent, Trustwave and Tenable. He currently works as the Global Strategy Lead for X-Force Red at IBM.\n@spacerog",
      "twitter": "@Stake",
      "conference": "DC26",
      "title": "Global Strategy Lead for X-Force Red, IBM",
      "name": "Space Rogue",
      "id": 26100,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Silicosis \n Silicosis (Paul Nash) joined the l0pht in 1998 and contributed to vulnerability research, with a focus on network protocols. In 1999, along with , he consulted with Marcus Ranum's new startup—Network Flight Recorder. Paul wrote a series of hybrid protocol analysis & anomaly detectors for the common protocols of the time.  They successfully identified both known and unknown attacks. He continued on as a founder of @stake and continued research on network protocols—including fiber channel and 3G cellular networking.  Paul was the last member of the L0pht to remain at Symantec after the acquisition.",
      "twitter": "@stake",
      "conference": "DC26",
      "title": "Head of Security, Stripe.",
      "name": "Mudge",
      "id": 26101,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Silicosis (Paul Nash) joined the l0pht in 1998 and contributed to vulnerability research, with a focus on network protocols. In 1999, along with Mudge, he consulted with Marcus Ranum's new startup—Network Flight Recorder. Paul wrote a series of hybrid protocol analysis & anomaly detectors for the common protocols of the time.  They successfully identified both known and unknown attacks. He continued on as a founder of @stake and continued research on network protocols—including fiber channel and 3G cellular networking.  Paul was the last member of the L0pht to remain at Symantec after the acquisition.",
      "twitter": "@stake",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Silicosis",
      "id": 26102,
      "updated_at": "2018-07-26T00:44+0000"
    },
    {
      "link": "",
      "description": "John Tan joined the L0pht in 1996 contributing to the Full Disclosure movement with an advisory on Novell Netware 3.x.  He was part of the L0pht's 1998 US Senate Testimony and published a widely cited essay called CyberUL which pointed out the conflict of interest that exists with the still current model of security certifications for people and products.  He has over 20 years experience within the Financial industry and most recently shifted his focus to Health Insurance.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "John Tan",
      "id": 26103,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "When Weld Pond (Chris Wysopal)  joined the L0pht in 1993 there was no internet connection. He then built the l0pht.com gateway machine using Slackware 1.0 on 24 floppies. Weld was the webmaster of the l0pht.com website where all those hacker t-files from the BBS era could be found. Weld worked on the software side of L0pht researching vulnerabilities, writing advisories, building Netcat for Windows, and making L0phtCrack the first password cracker with a GUI. Weld was part of the 7 person group that testified at the US Senate in 1998 where he spoke about software transparency and liability. He joined @stake with the L0pht acquisition and worked there managing the research team and consulting at top customers like Microsoft until @stake was purchased by Symantec. Weld and Dildog then spun out the @stake static binary analysis technology to create Veracode, where he is co-founder and CTO.\n@weldpond",
      "twitter": "@stake",
      "conference": "DC26",
      "title": "Hacker, Co-Founder, Veracode",
      "name": "Weld Pond",
      "id": 26104,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ricky \"HeadlessZeke\" Lawshae is an offensive security researcher for the Advanced Security Research team at Trend Micro. He spends his days breaking interesting things in interesting ways with his focus mainly centered on IoT research. His work has been featured in Forbes, Wired, Ars Technica, Hackaday, and more. He tries his best to be responsible with the vulnerabilities he finds, but despite that his work has also been featured in the likes of Satori, BrickerBot, and JenX. This will be his fourth time speaking at DEF CON, and he has also spoken at Recon, Ruxcon, Insomnihack, and many more. He spends his off-hours reading (mostly comics), drinking (mostly dark beers), and gaming (mostly PS4).\n@HeadlessZeke",
      "twitter": "@HeadlessZeke",
      "conference": "DC26",
      "title": "Security Researcher, Trend Micro",
      "name": "Ricky \"HeadlessZeke\" Lawshae",
      "id": 26105,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Michael has done hard-time in real-time. An old-school computer engineer by education, he spends his days hacking the mothership for a large semiconductor company. Previously, he developed and tested embedded hardware and software, dicked around with strap-on boot roms, mobile apps, office suites, and written some secure software. On nights and weekends he hacks on electronics, writes DEF CON CFPs, and contributes to the NSA Playset.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Trouble Maker; Intel",
      "name": "Michael Leibowitz",
      "id": 26106,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alex Levinson is a Senior Security Engineer at Uber with experience in red teaming, software engineering, and incident response. Outside of Uber, he is a core member of the red team for the National Collegiate Cyber Defense Competition (CCDC), as well as the Competition Director for the Collegiate Penetration Testing Competition (CPTC). Previously, Alex worked as a Senior Consultant and Development Manager at Lares Consulting.\n@alexlevinson, github.com/gen0cide, alexlevinson.wordpress.com",
      "twitter": "@alexlevinson",
      "conference": "DC26",
      "title": "Senior Security Engineer",
      "name": "Alex Levinson",
      "id": 26107,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dan Borges is an information security professional with over 15 years in computer science. Dan participates in a number of cyber security competitions each year, from being on the National CCDC Red Team, to leading a Blue Team in Pros Versus Joes, and helping run the Collegiate Penetration Testing Competition (CPTC). He has been publishing a blog on infosec education for more than 10 years.\n@1jection",
      "twitter": "@1jection",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Dan Borges",
      "id": 26108,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Vyrus may or may not have begun his offensive security training in early childhood through a series of allegedly criminal acts for a hacker collective still active on the internet today. Over the last approximately 2 decades these experiences have expressed themselves through participation within a variety of both independent, as well as corporate; technically legal information security professions. While the specific nature of many of these professions has yet to be disclosed, the professional skills Vyrus has been known to utilize throughout employment include but are not limited to: reverse engineering, penetration testing,\"red teaming\", security controls analysis, proof of concept malware development, incident response, implant development, exploit development, long term electronic surveillance, traffic analysis, complex systems risk analysis, many forms of wireless security, hardware security assessment, and general IT solution development & support.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Vyrus",
      "id": 26109,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ladar Levison serves as the founder, president, and chief executive of Lavabit, where he has worked the past 14 years. Founded in 2004 (and originally called Nerdshack), Lavabit was created because Mr. Levison believes that privacy is a fundamental, necessary right for a functioning, free and fair democratic society. Presently, Mr. Levison is focused on Lavabit's Dark Mail Initiative, which aims to make end-to-end email encryption automatic and ubiquitous, while continuing to vigorously advocate for the privacy and free speech rights of all. Mr. Levison’s involvement in the internet can be traced to the early days of the world wide web, when he built his first website, in the early nineties for the fledgling Mosiac web browser (from the National Center for Supercomputing Applications).\n\n\nPrior, Mr. Levison operated a dialup bulletin board service, and worked as a computer technician assembling custom computer systems. With more than 10 years of experience as an independent consultant, Mr. Levison has brought to bear his skills as a project manager, business analyst, systems engineer, software developer, database administrator, systems administrator, and information security specialist.\n\n\nMr. Levison’s career has involved working with several dozen multinational companies in the financial, consumer electronics, and retail sectors. The websites Mr. Levison built have drawn millions of visitors, and the software he's written has touched, albeit behind the scenes, the lives of millions more. Over the years, Mr. Levison has written and published numerous technical specifications and authored several editorial pieces. Mr. Levison frequently speaks at a variety of conferences, has appeared as an expert on numerous network television shows, and appeared in several documentaries; including the Oscar winning film, /Citizenfour/.\n\n\nMr. Levison has also been involved with several popular free open source software projects. Mr. Levison holds fifteen certifications, with the vast majority from Microsoft and International Business Machines. Mr. Levison received his Bachelor of Arts and Bachelor of Science degrees from Southern Methodist University, where he studied finance, English, political science and computer science. Additionally, Mr. Levison spent a year studying international relations at Georgetown University. A native of San Francisco, California, he currently resides in Dallas, Texas where he lives with his best friend, and principal cheerleader,\nPrincess, the Italian Greyhound he rescued in 2010.\nTwitter: @kingladar\n\nFacebook: kingladar\n\nWebsite: https://lavabit.com ",
      "twitter": "@kingladar",
      "conference": "DC26",
      "title": "Founder, Lavabit LLC",
      "name": "Ladar Levison",
      "id": 26110,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Hon1nbo is a hacker who tinkers for fun and to satisfy the basic human need to light things on fire. Hon1nbo allegedly has a job, where they get paid to take selfies in other people’s secure vaults in the middle of the night. We don’t know if this job is real, or merely a cover story. This possible delusion has taken them around the world entering into some of the largest organizations in both people size and technical expanse, using every possible entry method at their disposal. No domain left without an admin, no email left without a phish, and every office a wolf tail hiding in the air vents.\n\n\nIn addition to their night job, Hon1nbo runs Hacking & Coffee, a small hosting firm in Texas, where excess network capacity abounds, to perform security research and mirror F/OSS repositories. They also provide infrastructure support to a variety community projects, small businesses, and student groups.\n\n\nA wild Hon1nbo can be spotted at DEF CON, its natural habitat, and identified via their purple tail, ears, and getting into shenanigans.\nTwitter: @hon1nbo\n\nFacebook: hon1nbo\n\nWebsite: https://hackingand.coffee\n\nSpecies: Wolf-Dog\n\nPronouns: them/their/schlee/generalisimo whatever be consistent",
      "twitter": "@hon1nbo",
      "conference": "DC26",
      "title": "Proprietor, Hacking & Coffee LLC",
      "name": "hon1nbo",
      "id": 26111,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "m010ch_ is a physical security enthusiast and computer science student who spends most of his free time doing terrible things to locks. He enjoys participating in locksport competitions, and can often be found hunched over his desk, poking at small pieces of metal until he gets frustrated.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "m010ch_",
      "id": 26112,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sheng-Hao Ma (aaaddress1) is a core member of CHROOT Security Group and TDOHacker security community in Taiwan, he has over ten years of experience in reverse engineering and machine language, and mastered the intel 8086. He expert in Windows vulnerability, reverse engineering.\nMoreover, Sheng-Hao Ma has many papers presented in security conferences such as BlackHat Asia Arsenal, BSidesLV, ICNC, MC2015 and CISC, he was also a speaker at HITCON (Hackers In Taiwan Conference), SITCON (Students In Taiwan Conference), iThome#Chatbot.\n@aaaddress1",
      "twitter": "@aaaddress1",
      "conference": "DC26",
      "title": "CSIE, NTUST",
      "name": "Sheng-Hao Ma",
      "id": 26113,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Slava Makkaveev is a Security Researcher at Check Point. Holds a PhD in Computer Science. Slava has found himself in the security field more than seven years ago and since then gained a vast experience in reverse engineering and malware analysis. Recently Slava has taken a particularly strong interest in mobile platforms and firmware security.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher, Check Point",
      "name": "Slava Makkaveev",
      "id": 26114,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jeanette Manfra serves as the National Protection and Programs Directorate (NPPD) Assistant Secretary for the Office of Cybersecurity and Communications (CS&C). She is the chief cybersecurity official for the Department of Homeland Security (DHS) and supports its mission of strengthening the security and resilience of the nation's critical infrastructure. Prior to this position, Ms. Manfra served as Acting Deputy Under Secretary for Cybersecurity and Director for Strategy, Policy, and Plans for the NPPD. \nPreviously, Ms. Manfra served as Senior Counselor for Cybersecurity to the Secretary of Homeland Security and Director for Critical Infrastructure Cybersecurity on the National Security Council staff at the White House. \nAt DHS, she held multiple positions in the Office of Cybersecurity and Communications, including advisor for the Assistant Secretary for Cybersecurity and Communications and Deputy Director, Office of Emergency Communications, during which time she led the Department's efforts in establishing the Nationwide Public Safety Broadband Network. Before joining DHS, Jeanette served in the U.S. Army as a communications specialist and a Military Intelligence Officer.",
      "twitter": "",
      "conference": "DC26",
      "title": "Assistant Secretary, Office of Cybersecurity and Communications, Department of Homeland Security",
      "name": "Jeanette Manfra",
      "id": 26115,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Andrea Marcelli is a PhD Student and Security Researcher at Hispasec Sistemas. He received his M.Sc. degree in Computer Engineering from Politecnico of Torino, Italy, in 2015 and he is currently a third year doctoral student in Computer and Control Engineering at the same institute. His research interests include malware analysis, semi-supervised modeling, machine learning and optimization problems, with main applications in computer security. Since the end of 2016 he has been part of the security research team at Hispasec Sistemas, working on the Koodous project, where he develops new AI-based tools to automate large scale Android malware analysis, including malware clustering, network graph analytics and automatic YARA signatures generation.\n@_S0nn1_, https://jimmy-sonny.github.io/",
      "twitter": "@_S0nn1_",
      "conference": "DC26",
      "title": "PhD Student and Security Researcher. Politecnico di Torino ",
      "name": "Andrea Marcelli",
      "id": 26116,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "William Martin is a penetration tester & information security researcher with more than five years of experience in the Information Security Industry. William became an Offensive Security Certified Professional(OSCP) in November of 2015 and is currently a senior associate at RSM US LLP in the Security and Privacy practice with a focus on penetration testing and social engineering. www.linkedin.com/in/william-martin-OSCP\n@quickbreach\n\nwww.linkedin.com/in/william-martin-OSCP",
      "twitter": "@quickbreach",
      "conference": "DC26",
      "title": "Security & Privacy Senior Associate",
      "name": "William Martin",
      "id": 26117,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dr. Matthews is an associate professor of Computer Science at Clarkson University and a 2017-18  fellow at Data and Society. She is member of the Executive Committee of US-ACM, the U.S. Public Policy Committee of ACM and a founding co-chair of their subcommittee on algorithmic transparency and accountability. She was a speaker and DEF CON 23 and 24, both times on the topic of vulnerabilities in virtual networks.  Her broader research interests include virtualization, cloud computing, computer security, computer networks and operating systems. Jeanna received her Ph.D. in Computer Science from the University of California at Berkeley and is an ACM Distinguished Speaker.\n@jeanna_matthews",
      "twitter": "@jeanna_matthews",
      "conference": "DC26",
      "title": "Associate Professor, Clarkson University and Fellow, Data and Society",
      "name": "Dr. Jeanna N. Matthews:",
      "id": 26118,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nathan Adams works as a Systems Engineer in Ohio at the forensic DNA consulting firm Forensic Bioinformatic Services. He reviews DNA analyses performed in criminal cases in the US, the UK, and Australia. His focus includes DNA mixture interpretation, statistical weightings of evidence, probabilistic genotyping, and software development. When its disclosure was ordered by a federal judge in 2016, Nathan was part of the first team to independently examine FST, NYC's DNA mixture interpretation program. He helped identify and evaluate previously undisclosed behaviors of the software. Following the team's review and a motion filed by Yale's Media Freedom center and ProPublica, the judge recently ordered the release of the FST source code, which allowed open discourse for the first time since FST was brought online in 2011. He has a BS in Computer Science and is working on an MS in the same, both at Wright State University in Dayton, Ohio.",
      "twitter": "",
      "conference": "DC26",
      "title": "Systems Engineer, Forensic Bioinformatic Services",
      "name": "Nathan Adams",
      "id": 26119,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jerome Greco is a public defender in the Digital Forensics Unit of the Legal Aid Society in New York City. Along with four analysts, he works with attorneys and investigators in all five boroughs on issues involving historical cell-site location information, cell phone extraction, electronic surveillance technology, social media, and hard drive analysis, among other fields. He is currently engaged in challenging the NYPD's use of cell-site simulators, facial recognition, and the execution of overbroad search warrants for electronic devices. Prior to his work with the Digital Forensics Unit, he was a trial attorney in the Legal Aid Society's Manhattan and Staten Island criminal defense offices. He graduated magna cum laude from New York Law School in 2011 and received his B.A. from Columbia University in 2008.\n@JeromeDGreco",
      "twitter": "@JeromeDGreco",
      "conference": "DC26",
      "title": "Digital Forensics Staff Attorney, Legal Aid Society",
      "name": "Jerome Greco",
      "id": 26120,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Maggie Mayhem is a sex worker, birth worker, and death worker from San Francisco, CA. She has served on the Board of Directors for the Sex Worker Outreach Project-USA and founded the health, hygiene, and harm reduction project HarmReduxSF. She has been involved in public health since 2003 and is an international advocate for sex worker rights and reproductive justice. She has spoken about sexual biometrics at SxSW; debated pornography at Yale with Gail Dines; shared the history of pre-WWII porn at the University of Toronto; was artist-in-residence at the Museumsquartier in Vienna; talked about developing sex worker centered policy at DymaxiCon in Helsinki; presented her crack pipe distribution project at the Harm Reduction Coalition conference; shared statistics and research on sex workers and violence at the University of Winchester; and examined public mourning in human rights activism at the University of Southampton. Her independent adult website MeetTheMayhems was the recipient of a feminist porn award. \n@MsMaggieMayhem // Insta @MaggieMayhem // Web MaggieMayhem.Com //",
      "twitter": "@MsMaggieMayhem",
      "conference": "DC26",
      "title": "MaggieMayhem.Com",
      "name": "Maggie Mayhem",
      "id": 26121,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wesley currently oversees and participates in offense-oriented operations as Director of Cyber Operations for HORNE Cyber. He has presented on topics of penetration testing and and malware analysis at DEF CON and Black Hat USA. He teaches a self-designed course on reverse engineering to students at Mississippi State University, using real-world, high-profile malware samples. Wesley has a Ph.D. in Computer Science from  Mississippi State University for his research in vulnerability analysis of SCADA HMI systens.",
      "twitter": "",
      "conference": "DC26",
      "title": "Director of Cyber Operations, HORNE Cyber",
      "name": "Wesley McGrew",
      "id": 26122,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Douglas McKee is a Senior Security Researcher for the McAfee Advanced Threat Research team, focused on finding new vulnerabilities in both software and hardware. Douglas has an extensive background in penetration testing, reverse engineering, malware analysis and forensics and throughout his career has provided software exploitation training to many audiences, including law enforcement.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Researcher for the McAfee Advanced Threat Research team",
      "name": "Douglas McKee",
      "id": 26123,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sean Metcalf is founder and principal consultant at Trimarc (www.TrimarcSecurity.com) a consulting company which focuses on improving enterprise Active Directory security. He is one of about 100 people in the world who holds the Microsoft Certified Master Directory Services (MCM) certification, is a former Microsoft MVP, and has presented on Active Directory attack and defense at Black Hat, BSides, DEF CON, DerbyCon, BlueHat, & Shakacon security conferences. He currently provides security consulting services to customers and regularly posts interesting Active Directory security information on his blog, ADSecurity.org.",
      "twitter": "",
      "conference": "DC26",
      "title": "CTO, Trimarc",
      "name": "Sean Metcalf",
      "id": 26124,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Josh Mitchell (Twitter: @bx_lr) has more than a decade's experience as an information security researcher. He has authored numerous technical documents and presented his findings at conferences, academic discussions, and in the classroom. Josh is an expert at discovering and exploiting vulnerabilities and writing code to protect operating systems and programs. Josh has served in the United States Air Force and held numerous defense contracting roles covering electronic signals intelligence exploitation, electronic warfare, malware analysis, exploit development, and reverse engineering\n@bx_lr",
      "twitter": "@bx_lr",
      "conference": "DC26",
      "title": "Principal cybersecurity Consultant, Nuix",
      "name": "Josh Mitchell",
      "id": 26125,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ahamed Nafeez has a varied offensive security background with some emphasis on browsers, web services, and cryptography. He believes defending is much harder than attacking most of the time and appreciates the variables and challenges defenders have. These days he is interested in writing secure frameworks, automating attacks and more or less trying to learn to write good code. \nHe has spoken at a few security conferences in the past around web apps, browsers and security analysis of javascript. He tweets at @skeptic_fx and builds his side project assetwatch.io in free time, an automated asset discovery/monitoring service.",
      "twitter": "@skeptic_fx",
      "conference": "DC26",
      "title": "Security Researcher",
      "name": "Nafeez",
      "id": 26126,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nevermoe (@n3v3rm03) is a security engineer in DeNA Co., Ltd. His main focuses are web security, game hacking and reverse engineering. He loves writing tools for game hacking / analyzing and publishing them on https://github.com/nevermoe.",
      "twitter": "@n3v3rm03",
      "conference": "DC26",
      "title": "Security Engineer, DeNA Co., Ltd.",
      "name": "Nevermoe (@n3v3rm03)",
      "id": 26127,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Michael Lee Nirenberg—documentary director (Back Issues: The Hustler Magazine Story), writer, blogger, commercial artist for movies and TV",
      "twitter": "",
      "conference": "DC26",
      "title": "Director, Restraining Order, Ltd",
      "name": "Michael Lee Nirenberg",
      "id": 26128,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dave Buchwald—former hacker in the mid-80s (\"Bill\nfrom RNOC\"), film editor (Love Simple, Urchin), film consultant (Hackers) and 2600 Magazine cover artist",
      "twitter": "",
      "conference": "DC26",
      "title": "Producer",
      "name": "Dave Buchwald",
      "id": 26129,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Kurt Opsahl is the Deputy Executive Director and General Counsel of the Electronic Frontier Foundation. In addition to representing clients on civil liberties, free speech and privacy law, Opsahl counsels on EFF projects and initiatives.  Opsahl is the lead attorney on the Coders' Rights Project.  Before joining EFF, Opsahl worked at Perkins Coie, where he represented technology clients with respect to intellectual property, privacy, defamation, and other online liability matters, including working on Kelly v. Arribasoft, MGM v. Grokster and CoStar v. LoopNet. For his work responding to government subpoenas, Opsahl is proud to have been called a \"rabid dog\" by the Department of Justice. Prior to Perkins, Opsahl was a research fellow to Professor Pamela Samuelson at the U.C. Berkeley School of Information Management & Systems. Opsahl received his law degree from Boalt Hall, and undergraduate degree from U.C. Santa Cruz. Opsahl co-authored \"Electronic Media and Privacy Law Handbook.\" In 2007, Opsahl was named as one of the \"Attorneys of the Year\" by California Lawyer magazine for his work on the O'Grady v. Superior Court appeal. In 2014, Opsahl was elected to the USENIX Board of Directors.\n@kurtopsahl",
      "twitter": "@kurtopsahl",
      "conference": "DC26",
      "title": "Deputy Executive Director & General Counsel, Electronic Frontier Foundation",
      "name": "Kurt Opsahl",
      "id": 26130,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nate Cardozo is a Senior Staff Attorney on the Electronic Frontier Foundation's digital civil liberties team. In addition to his focus on free speech and privacy litigation, Nate works on EFF's Who Has Your Back? report and Coders' Rights Project. Nate has projects involving cryptography and the law, automotive privacy, government transparency, hardware hacking rights, anonymous speech, electronic privacy law reform, Freedom of Information Act litigation, and resisting the expansion of the surveillance state. A 2009-2010 EFF Open Government Legal Fellow, Nate spent two years in private practice before returning to his senses and to EFF in 2012.  Nate has a B.A. in Anthropology and Politics from U.C. Santa Cruz and a J.D. from U.C. Hastings where he has taught first-year legal writing and moot court. He brews his own beer, has been to India four times, and watches too much Bollywood.",
      "twitter": "",
      "conference": "DC26",
      "title": "EFF Senior Staff Attorney",
      "name": "Nate Cardozo",
      "id": 26131,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jamie Williams is a staff attorney at the Electronic Frontier Foundation, where she is part of EFF's civil liberties team. Jamie focuses on the First and Fourth Amendment implications of new technologies, and is part of EFF's Coder's Rights Project, which protects programmers and developers engaged in cutting-edge exploration of technology. Jamie joined EFF in 2014. Prior to joining EFF, Jamie clerked for Judge Saundra Brown Armstrong in the Northern District of California, and practiced at Paul Hastings LLP, as an associate in the firms' litigation department. Jamie was also a law clerk at the Alameda County Public Defender. Jamie has a J.D. from the University of California, Berkeley School of Law (Boalt Hall) and a B.A. in journalism from the University of Wisconsin, Madison.",
      "twitter": "",
      "conference": "DC26",
      "title": "EFF Staff Attorney",
      "name": "Jamie Lee Williams",
      "id": 26132,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Andrés Arrieta is the Technology Projects Manager for the Electronic Frontier Foundation. A Telecom and Electronics Engineer, he previously worked for Mobile Operators managing and developing projects from the Radio and Core networks to IT systems like Spotify Premium for Movistar. Seeing the state of privacy in the digital world from previous experiences, he joins the EFF to help develop tools that address these issues.",
      "twitter": "",
      "conference": "DC26",
      "title": "Technology Products Manager",
      "name": "Andrés Arrieta",
      "id": 26133,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Katitza Rodriguez is EFF's international rights director. She concentrates on comparative policy of international privacy issues, with special emphasis on law enforcement, government surveillance, and cross border data flows. Her work in EFF's International Program also focuses on cybersecurity at the intersection of human rights. Katitza also manages EFF's growing Latin American programs. She was an advisor to the UN Internet Governance Forum (2009-2010). Before joining EFF, Katitza was director of the international privacy program at the Electronic Privacy Information Center in Washington D.C., where amongst other things, she worked on The Privacy and Human Rights Report,an international survey of privacy law and developments. Katitza is well known to many in global civil society and in international policy venues for her work at the U.N. Internet Governance Forum and her pivotal role in the creation and ongoing success of the Civil Society Information Society Advisory Council at the Organisation for Economic Co-operation and Development, for which she served as the civil society liaison while at EPIC from 2008 to March 2010. Katitza holds a Bachelor of Law degree from the University of Lima, Peru. Katitza's twitter handle is @txitua.",
      "twitter": "@txitua",
      "conference": "DC26",
      "title": "International Rights Director",
      "name": "Katiza Rodriguez",
      "id": 26134,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nathan 'nash' Sheard is EFF's Grassroots Advocacy Organizer. nash works directly with community members and organizations to take advantage of the full range of tools provided by access to tech, while engaging in empowering action toward the maintenance of digital privacy and information security.",
      "twitter": "",
      "conference": "DC26",
      "title": "Grassroots Advocacy Organizer",
      "name": "Nathan 'nash' Sheard",
      "id": 26135,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Michael is a wireless security researcher who makes hardware for hackers. Best known for the open source HackRF, Ubertooth, and GreatFET projects, he founded Great Scott Gadgets in an effort to put open source hardware into the hands of innovative people.\n@michaelossmann",
      "twitter": "@michaelossmann",
      "conference": "DC26",
      "title": "Great Scott Gadgets",
      "name": "Michael Ossmann",
      "id": 26136,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Michael is a wireless security researcher who makes hardware for hackers. Best known for the open source HackRF, Ubertooth, and GreatFET projects, he founded Great Scott Gadgets in an effort to put open source hardware into the hands of innovative people.\n@dominicgs",
      "twitter": "@dominicgs",
      "conference": "DC26",
      "title": "Great Scott Gadgets",
      "name": "Dominic Spill",
      "id": 26137,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Erwin works as a lead security consultant at Nixu Benelux. He has 15 years experience conducting penetration tests and security assessments on a wide variety of systems and technology. In the recent years his focus is shifting towards more advanced tests like red teaming, embedded systems, ICS/SCADA, and telco systems. Within Nixu he is also the practice lead for penetration and security testing.",
      "twitter": "",
      "conference": "DC26",
      "title": "Lead security consultant at Nixu",
      "name": "Erwin Paternotte",
      "id": 26138,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mattijs leads the Red Teaming and Hardware Testing team at Nixu Benelux. He has spent most of his career as an information security consultant, both on the offensive as well as the defensive side. Mattijs has a special interest in process automation and industrial systems. Over the years he has discovered numerous vulnerabilities in RTUs, process controllers, industrial firewalls and other equipment. Industrial sensor networks currently have most of his focus, as this is still mainly unexplored terrain.",
      "twitter": "",
      "conference": "DC26",
      "title": "principal security consultant at Nixu",
      "name": "Mattijs van Ommeren",
      "id": 26139,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Rowan is an undergraduate at the University of Washington where he studies Computer Science.  He's a member of Batman's Kitchen and has participated in CTF and CCDC competitions. Last summer he worked in the Digital Financial Services Research Group looking into the security of mobile money.  In his spare time he likes to dabble with hardware design.\n@RowanPhipps",
      "twitter": "@RowanPhipps",
      "conference": "DC26",
      "title": "Undergraduate researcher, University of Washington",
      "name": "Rowan Phipps",
      "id": 26140,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bruce Potter is the founder of The Shmoo Group, CISO at Expel, and helps run ShmooCon each year in Washington DC. Bruce has over 20 years (yikes!) of experience in hacking and cyber security including working with DoD an Intelligence Community clients as well as numerous finance, healthcare, and transportation companies. Bruce used to do a lot of wireless and network attack and defense work but lately focuses on risk management, threat categorization, and building more secure systems. Bruce has never played D&D but has a son who plays extensively. \n@gdead",
      "twitter": "@gdead",
      "conference": "DC26",
      "title": "Founder, The Shmoo Group",
      "name": "Bruce Potter",
      "id": 26141,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Robert Potter is a 16 year old 10th grader who wears Invisalign. He is the son of Mr.Bow-To-My-Firewall and Mrs.Heidi\"clever name\" Potter. He likes things that begin with M, including but not limited to Math, Music, and his Mother (my mom told me to put that there).\n@TauManiac",
      "twitter": "@TauManiac",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Robert Potter",
      "id": 26142,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Siegfried is the head of department Secure Software Engineering at Fraunhofer SIT (Germany) and his main research focus is on \napplied software security. He has received a PhD, master's degree and bachelor's degree in computer science and IT-security. He is the founder of the CodeInspect reverse engineering tool and founded TeamSIK. \nDuring his research, he develops tools that combine static and dynamic code analysis for security purposes. Most of his research is published at top tier academic conferences and industry conferences \nlike DEF CON, BlackHat, AVAR or VirusBulletin.",
      "twitter": "",
      "conference": "DC26",
      "title": "Fraunhofer SIT",
      "name": "Dr. Siegfried Rasthofer",
      "id": 26143,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Stephan is a security researcher at the Testlab mobile security group at the Fraunhofer Institute for Secure Information Technology (SIT). \nHis main focus is Android application security testing and developing new static and dynamic analysis techniques for app security evaluation. \nHe found different vulnerabilities in well-known Android applications and the AOSP. He gave talks on conferences like DEF CON, HITB, AppSec or VirusBulletin. In his spare time he enjoys teaching students in Android hacking.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Stephan Huber",
      "id": 26144,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Steven is currently a researcher at the Fraunhofer Institute for Secure Information Technology (SIT) in Darmstadt. \nHe has received a PhD, a master's degree in computer science, and a master's degree in IT Security from Technische Universität Darmstadt. \nSteven is one of the core maintainers of the Soot open-source compiler framework that is now used for static analysis and program instrumentation by various research groups around the world. He is also actively maintaining the FLOWDROID open-source static data flow tracker. \nHis main research interests center on (mobile) security and static and dynamic program analysis applied to real-world security problems, an area in which he has published various research papers over the last years.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Dr. Steven Arzt",
      "id": 26145,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Stark Riedesel is a senior consultant at Synopsys with six years of security industry experience. He has filled a variety of roles, including penetration tester, researcher, lecturer, and security architect. Stark’s active areas of research are public and private blockchain platforms, NoSQL-based exploitation techniques, and container orchestration. Outside work,Stark speaks and hosts CTF events at the Dallas, Texas, OWASP chapter and local universities.",
      "twitter": "",
      "conference": "DC26",
      "title": "Synopsys, Senior Consultant",
      "name": "Stark Riedesel",
      "id": 26146,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Parsia Hakimian is a senior consultant at Synopsys with seven years of security industry experience. He has worked on enterprise blockchains, online multiplayer games, stock exchange platforms, mobile device management suites, and IoT devices. On a different continent, he was a C developer, university instructor, and single-player game cheater. Parsia is currently evangelizing Golang to the security community and practicing in-memory fuzzing.",
      "twitter": "",
      "conference": "DC26",
      "title": "Synopsys, Senior Consultant",
      "name": "Parsia Hakimian",
      "id": 26147,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Josep Pi Rodriguez is experienced in network penetration and web application testing, reverse engineering, industrial control systems, transportation, RF, embedded systems, vulnerability research, exploit development, and malware analysis. As a senior consultant at IOActive, Mr. Rodriguez performs penetration testing, identifies system vulnerabilities and researches cutting-edge technologies. Mr. Rodriguez has performed security services and penetration tests for numerous global organizations and a wide range of financial, technical, and educational institutions. He has presented at international conferences including Immunity infiltrate, Hack in paris and Japan CCDS iot conference.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior security consultant, IOActive",
      "name": "Josep Pi Rodriguez",
      "id": 26148,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Yolan Romailler is a Security Researcher at Kudelski Security, where he delves into (and dwells on) cryptography, crypto code, blockchains and other fun things. He has spoken at Black Hat USA, BSidesLV and DEF CON's Cryptovillage on automation in cryptography, vulnerability research, and presented at FDTC 2017 the first known practical fault attack against EdDSA. Yolan tweets as @anomalroil.",
      "twitter": "@anomalroil",
      "conference": "DC26",
      "title": "Security Researcher at Kudelski Security",
      "name": "Yolan Romailler",
      "id": 26149,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nils Amiet is a Security Engineer at Kudelski Security, where he performs big data analytics, leveraging Spark, Hadoop and Chapel clusters to analyze large datasets. He designed a data pipeline to snapshot the whole IPv4 address space for selected network protocols, allowing automated and reproducible offline data analysis. He also built an automated country security ranking. Nils likes open source software, data analytics, distributed systems and data processing.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Engineer at Kudelski Security",
      "name": "Nils Amiet",
      "id": 26150,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Amanda Rousseau absolutely loves malware. She works as a Senior Malware Researcher at Endgame who focuses on dynamic behavior detection both on Windows and OSX platforms. She worked as a malware researcher at FireEye before joining Endgame. She previously worked a reverse engineer and computer forensic examiner working for DoD forensic investigations and commercial incident response engagements. She received her MS in Information Systems Engineering from Johns Hopkins University. Research interests include malware evasion techniques, dynamic behavior classification, and developing runtime detections.\n@malwareunicorn",
      "twitter": "@malwareunicorn",
      "conference": "DC26",
      "title": "Senior Malware Researcher at Endgame Inc.",
      "name": "Amanda Rousseau",
      "id": 26151,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Rich Seymour is a senior data scientist at Endgame, where he works on integrating R&D successes into the company's platform and experimenting with new techniques to make security sensible. He's currently working on improving natural language understanding in the Artemis chatbot in the Endgame platform and understanding how to catch adversary tradecraft.  He holds a PhD in materials science and an MS in computer science, both from the University of Southern California, where he worked on high-performance computing simulations of nanoscale materials under stress. He has spoken at USENIX SOUPS, Shmoocon and O'Reilly Security.\n@rseymour",
      "twitter": "@rseymour",
      "conference": "DC26",
      "title": "Senior Data Scientist at Endgame Inc",
      "name": "Rich Seymour",
      "id": 26152,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joe (@jrozner) is a software engineer at Prevoty where he has built semantic analysis tools, language runtimes, generalized solutions to common vulnerability classes, and designed novel integration technology leveraging runtime memory patching. He has a passion for reverse engineering, exploitation, teaching, and sharing research with others. He is the undisputed champion of the Brawndo and Booze competition from DEF CONs past with his Irish Car Mutilator winning in both the drink and dip categories.\n @jrozner",
      "twitter": "@jrozner",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Joe Rozner",
      "id": 26153,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Gabriel Ryan is a penetration tester and researcher with a passion for wireless and infrastructure testing. He currently serves a co-founder and principal security consultant for Digital Silence, a Denver based consulting firm that specializes in impact driven penetration testing and red team engagements. \nPrior to joining Digital Silence, Gabriel worked as a penetration tester and researcher for Gotham Digital Silence, contributing heavily to their wireless security practice and regularly performing large scale infrastructure assessments and red teams for Fortune 500 companies. Some of Gabriel's most recent work includes the development of EAPHammer, an 802.11ac focused tool for breaching WPA2-EAP networks. On the side, he serves as a member of the BSides Las Vegas senior staff, coordinating wireless security for the event. In his spare time, he enjoys producing music, exploring the outdoors, and riding motorcycles.\n@s0lst1c3, https://digitalsilence.com, solstice.sh",
      "twitter": "@s0lst1c3",
      "conference": "DC26",
      "title": "Co-Founder / Principal Security Consultant @ Digital Silence",
      "name": "Gabriel Ryan",
      "id": 26154,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Eric Sesterhenn is working as an IT Security consultant for more than 15 years, working mostly in the areas of source code auditing and penetration testing. His experience in the field includes:",
      "twitter": "",
      "conference": "DC26",
      "title": "Principal Security Consultant at X41, D-Sec GmbH",
      "name": "Eric Sesterhenn",
      "id": 26155,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Toma is the lead IT security researcher at PR-Audit Ltd., a company focusing mainly on penetration testing and SIEM software development. Previously he participated in a cooperation between ELTE Department of Meteorology and the Paks Nuclear Power Plant Ltd., the goal of which was to develop TREX, a toxic waste emission simulator using CUDA. \nThe scene from RoboCop where Nikko defeats the ED-209 with just a laptop and a serial cable made a huge impression on him, and after seeing the movie, his path was set: he was bound to be a hacker. His first experiences in this field involved poking around various copy protection schemes, and to this day his favorite areas of expertise are the ones that require some mangling of binary files. Besides computer security he also loves mountain biking, flight simulators, and builds and flies acro quadcopters.",
      "twitter": "",
      "conference": "DC26",
      "title": "Lead security researcher @ PR-Audit Ltd., Hungary",
      "name": "sghctoma",
      "id": 26156,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sanat (@romanking98) is a 19 y o Junior Security Engineer at GoRoot GmbH in Berlin, Germany. He regularly plays CTFs with \"dcua\" , globally ranked in the world top 10 teams on ctftime.org , qualified for multiple prestigious onsite finals, including an invitation for DEF CON China offline CTF.\n@romanking98",
      "twitter": "@romanking98",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Sanat Sharma",
      "id": 26157,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mickey Shkatov, a principal researcher at Eclypsium, has been performing security research and product security validation since 2010, He has also presented multiple times at DEF CON A and BlackHat, PacSec, CanSecWest, BruCon, Hackito Ergo Sum, and BSides Portland.\n@HackingThings",
      "twitter": "@HackingThings",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Mickey Shkatov  ",
      "id": 26158,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jesse Michael is an experienced security researcher focused on vulnerability detection and mitigation who has worked at all layers of modern computing environments from exploiting worldwide corporate network infrastructure down to hunting vulnerabilities inside processors at the hardware design level.  His primary areas of expertise include reverse engineering embedded firmware and exploit development.  He has also presented multiple times at DEF CON, PacSec, Hackito Ergo Sum, and BSides Portland.\n@JesseMichael",
      "twitter": "@JesseMichael",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Jesse Michael",
      "id": 26159,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Maksim is a security researcher, hacker who loves vulnerabilities hunting, fuzzing acrobatics and complex malicious samples reversing. Maksim had a change to work on binary instrumentation, Windows operating system emulators and malware analysis at large cyber security companies around the world.\nhttps://github.com/mxmssh, https://www.linkedin.com/in/mshudrak",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Offensive Security Researcher, Salesforce",
      "name": "Maksim Shudrak",
      "id": 26160,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Si previously served 22 years in the British Army and is now an independent security consultant with over 25 years of combined experience in various security fields.  He always tries to follow the mantra \"security must make sense\".\n@SecuritySense",
      "twitter": "@SecuritySense",
      "conference": "DC26",
      "title": "Independent Security Consultant",
      "name": "Si",
      "id": 26161,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Agent X is a hacker, interested in offensive security, espionage, and operational security. He's been a DEF CON goon for the last twenty years and spent a majority of that time as head of speaker operations. A loud-mouth, he's spoken at DEF CON, Notacon, Shmoocon, Hackcon, Pumpcon, and Hushcon. He travels internationally more than most but not as much as he'd like. He lives in a van down by the river.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Agent X",
      "id": 26162,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "singe has been hacking for 14 years, the last 8 of them at SensePost. He is the primary author of mana-toolkit and has developed wifi hacking training for places like BlackHat.\n@singe",
      "twitter": "@singe",
      "conference": "DC26",
      "title": "CTO @ SensePost",
      "name": "singe",
      "id": 26163,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "smea got his start making video games for closed consoles like the Nintendo DS using whatever hacks were available at the time. At some point consoles started getting actual security features and he transitioned from simply making homebrew software to making the jailbreaks that let people run it. He's best known for his work on the Nintendo 3DS and Wii U but has also done exploitation work against high profile web browsers and virtualization stacks.\n@smealum, https://github.com/smealum",
      "twitter": "@smealum",
      "conference": "DC26",
      "title": "Hacker",
      "name": "smea",
      "id": 26164,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sarah St. Vincent is a researcher and advocate on national security, surveillance, and domestic law enforcement for the US Program at Human Rights Watch. She has investigated and documented the deliberate concealment of surveillance-based and other evidence from US criminal defendants, the Defense Department's monitoring of \"homegrown violent extremists,\" and the potential use of US intelligence surveillance for anti-drug purposes. Before joining Human Rights Watch, she was a legal fellow on international human rights and surveillance at the Center for Democracy & Technology. She writes regularly about surveillance, privacy, and related issues under US and European Union law and is a member of the New York bar.\n@SarahStV_HRW",
      "twitter": "@SarahStV_HRW",
      "conference": "DC26",
      "title": "Researcher/Advocate on National Security, Surveillance, and Domestic Law Enforcement, Human Rights Watch",
      "name": "Sarah St. Vincent",
      "id": 26165,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Dr Cindy Poppins - Computer Scientist (AKA Svea Eckert)",
      "id": 26166,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Dr Dade Murphy - Reformed Hacker (AKA Suggy)",
      "id": 26167,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Professor Dr Edgar Munchhausen – Struwwelpeter Fellow (AKA Till Krause)",
      "id": 26168,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Vincent is a Senior Security Consultant at MWR Labs (the forefront of innovation and research in cyber security). He has a passion for all things\"mobile\" and anything\"wireless\". Vincent spends most of his free time focused on reverse engineering esoteric protocols, mobile devices and all things IOT to make the real(cyber)world a better and (where possible) a safer place to be for all. (All this while trying to survive by getting free rides.) Singaporean by birth, Vincent defies the local stereotype of accepting \"cannot\" for an answer and lives in a world of only pure possibility.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Consultant, MWR InfoSecurity",
      "name": "Vincent Tan Kwang Yue",
      "id": 26169,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "George Tarnovsky has been working a Design Engineer since the 80's.  His designs for industries such as:  Industrial process control instrumentation, Visible light spectroscopy, Semiconductor FAB instrumentation, Smart card security & countermeasures, Automotive systems vulnerability.  George holds several patents, has given papers at many internal conferences, and currently continues to expand FPGA designs vulnerability and hardening.",
      "twitter": "",
      "conference": "DC26",
      "title": "Engineer, Cisco Systems",
      "name": "George Tarnovsky",
      "id": 26170,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "The Tarquin is a security engineer at Amazon.com. His security background is in browser development and application security. His hacking background is mainly in attempting to maximize the absurdity content of systems. He also studied philosophy, specializing in the Phenomenology of Technology and seeks to understand the ways in which our systems help the human brain lie to itself. His years as a dev have given him a bad habit of needling red teamers. His years in philosophy have given him a bad habit of switching sides in an argument seemingly at random.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Engineer, Amazon.com",
      "name": "The Tarquin",
      "id": 26171,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "Author and professional speaker, ThiemeWorks",
      "name": "Richard Thieme, a.k.a. neural cowboy",
      "id": 26172,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Cheng-Da Tsai, also as known as Orange Tsai, is member of DEVCORE and CHROOT from Taiwan. He has spoken at conferences such as Black Hat USA, Black Hat ASIA, DEF CON, HITCON, HITB, CODEBLUE and WooYun. He participates in numerous Capture-the-Flags (CTF), and won 2nd place in DEF CON 22/25 as team member of HITCON. \nCurrently, he is focusing on vulnerability research and web application security. Orange enjoys finding vulnerabilities and participating in Bug Bounty Programs. He is enthusiastic about Remote Code Execution (RCE), and uncovered RCEs in several vendors, such as Facebook, Uber, Apple, GitHub, Amazon, Yahoo and Imgur.\n@orange_8361, Blog: http://blog.orange.tw/",
      "twitter": "@orange_8361",
      "conference": "DC26",
      "title": "Security Researcher from DEVCORE",
      "name": "Orange Tsai",
      "id": 26173,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Martin Vigo is a Lead Product Security Engineer and Researcher responsible for Mobile security, Identity and Authentication. He helps design secure systems and applications, conducts security reviews, penetration testing and generally helps keep \"the cloud\" secure. Martin is also involved in educating developers on security essentials and best practices. \nMartin has presented several topics including breaking password managers, exploiting Apple's Facetime to create a spy program and mobile app development best practices. These were given at conferences such as Blackhat EU, Ekoparty, Kaspersky Security Analyst Summit and Shakacon. \nOutside the office, Martin enjoys research, bug bounties, gin tonics and scuba diving.\n@martin_vigo",
      "twitter": "@martin_vigo",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Martin Vigo",
      "id": 26174,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Yu Wang is a senior staff engineer at Didi Research America. He has previously presented on Syscan360 2012/2013, Hitcon 2013, Black Hat USA 2014, Black Hat ASIA 2016, Black Hat USA Arsenal 2018 and other conferences.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Staff Engineer at Didi Research America",
      "name": "Yu Wang",
      "id": 26175,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Patrick Wardle is the Chief Research Officer at Digita Security and founder of Objective-See. Having worked at NASA and the NSA, as well as presented at countless security conferences, he is intimately familiar with aliens, spies, and talking nerdy. Patrick is passionate about all things related to macOS security and thus spends his days finding Apple 0days, analyzing macOS malware and writing free open-source security tools to protect Mac users.\n@patrickwardle",
      "twitter": "@patrickwardle",
      "conference": "DC26",
      "title": "Chief Research Officer, Digita Security",
      "name": "Patrick Wardle",
      "id": 26176,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Michael West, aka T3h Ub3r K1tten, is a National Technical Advisor at CyberArk who likes cats. His homelab has over 640 kilobytes of RAM. Michael presents regularly at Dallas Hackers Association and enjoys combining his software dev background with infosec to build tools for others. His interests include OSINT, amateur radio, and scanning long barcodes on the beach.\n@t3hub3rk1tten, https://mwe.st, https://barcowned.com",
      "twitter": "@t3hub3rk1tten",
      "conference": "DC26",
      "title": "Technical Advisor at CyberArk",
      "name": "Michael West",
      "id": 26177,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "magicspacekiwi, aka Colin Campbell, is a Web Developer with a focus on user experience and considers security an important (but often neglected) part of that experience. They've managed to log over 1500 hours in Overwatch while being stuck in plat. Ask them about their nginx configs.",
      "twitter": "",
      "conference": "DC26",
      "title": "Web Developer",
      "name": "magicspacekiwi (Colin Campbell)",
      "id": 26178,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nathan White spent five years working for the U.S. congress before starting a political consulting firm as a registered lobbyist. He now serves as the Senior Legislative Manager for Access Now, where he works to defend our digital rights. He has run political and issue campaigns from Maui to Maryland to Melbourne. He helped advocacy campaigns including the fight to save Net Neutrality at the FCC (2015) and the USA FREEDOM Act in Congress. At Access Now he co-organized the Crypto Summit and Crypto Summit 2.0. He worked to build the SaveCrypto.org campaign and helped create the international coalition to Secure The Internet (securetheinternet.org). He works everyday to educate Washington D.C. beltway types about our community. \n@NathanielDWhite",
      "twitter": "@NathanielDWhite",
      "conference": "DC26",
      "title": "Senior Legislative Manager, Access Now",
      "name": "Nathan White",
      "id": 26179,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Matt leads technical research for the PwC Cyber Security practice in the UK, works on its Ethical Hacking team, and is a PhD candidate at University College London. Prior to joining PwC, Matt led a technical R&D team for a law enforcement agency in the UK. His research interests include antivirus and sandboxing technologies, unconventional attack vectors, side-channels, and radio security. \n@darkartlab",
      "twitter": "@darkartlab",
      "conference": "DC26",
      "title": "Vulnerability R&D Lead, PwC",
      "name": "Matt Wixey",
      "id": 26180,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Feng Xiao will be a Ph.D. student at The Pennsylvania State University soon. He enjoys hacking all kinds of systems as well as finding vulnerabilities. He received his B.S. in Computer Science from Wuhan University in 2018. He was the recipient of the first prize in the National Undergraduate Information Security Contest, China in 2016, and Third Prize of 2015 0CTF. \nhttps://xiaofen9.github.io",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Feng Xiao",
      "id": 26181,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jianwei Huang is a researcher at Wuhan University. He is interested in finding and solving security related problems.",
      "twitter": "",
      "conference": "DC26",
      "title": "Hacker",
      "name": "Jianwei Huang",
      "id": 26182,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dr. Liu is a professor at The Pennsylvania State University. His research interests are in computer security.  He has published a monograph and over 270 refereed technical papers.",
      "twitter": "",
      "conference": "DC26",
      "title": "Raymond G. Tronzo, M.D. Professor of Cybersecurity",
      "name": "Peng Liu",
      "id": 26183,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "yawnbox is the co-founder and executive director for Emerald Onion and has a background in network administration, datacenter operations, and security engineering. He has been running Tor guard and middle relays since 2010 and exit relays since 2012. Being a victim of domestic violence at a young age, yawnbox has been acutely aware of physical location metadata since the age of 8 and has been researching, publishing, and training at-risk communities about threat modeling and operational security since becoming a part of the Tor community. In 2013, yawnbox got involved with political activism through the Seattle Privacy Coalition, and in 2015 performed an internship with the ACLU of Washington where he helped roll out the first instance of SecureDrop in a non-journalist organization. In 2016, yawnbox was brought on as Tor Project's first full time Grant Writer but left shortly after.",
      "twitter": "",
      "conference": "DC26",
      "title": "Executive Director, Emerald Onion",
      "name": "yawnbox",
      "id": 26184,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Zach is a security researcher with Somerset Recon, a security consulting firm in San Diego. In this role he focuses on reverse engineering and web application penetration testing. In his free time Zach loves reading and long walks through the PE file format. Prior to working at Somerset Recon, Zach was a goat farmer in Maryland.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher at Somerset Recon",
      "name": "Zach",
      "id": 26185,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alex is a security researcher with Somerset Recon, a security consulting firm in San Diego. In this role he focuses on hardware security and reverse engineering.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher at Somerset Recon",
      "name": "Alex",
      "id": 26186,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Yingtao Zeng is a security researcher at UnicornTeam in the Radio Security Research Department of 360 Technology. He mainly focus on the security of Internet of things, car remote control systems and automotive radar safety research. He has found vulnerabilities in a variety of automobile manufacturers including Tesla, Buick, Volvo, Chevrolet, Toyota, Nissan, BYD and more. He has presented his researches at conferences like HITB, DEF CON Car Hacking Village, Black Hat Arsenal etc.",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher at UnicornTeam, Radio Security Research Department of 360 Security Technology",
      "name": "Yingtao Zeng",
      "id": 26187,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Lin HUANG is a senior wireless security researcher and the manager of UnicornTeam in 360 Technology. She is also the 360 Technology's 3GPP standard SA3 delegate and a research supervisor for master students in BUPT. Her interests include security issues in wireless communication, especially cellular network security. She was a speaker at BlackHat, DEF CON, and HITB security conferences.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Wireless Security Researcher and SDR technology expert, 360 Security Technology",
      "name": "Lin Huang",
      "id": 26188,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jun Li is a senior security researcher at the UnicornTeam, Qihoo 360. He is the POC of DEF CON Group 010, and member of the DEF CON Group Global Advisory Board. His researches have been presented at conferences such as Blackhat, DEF CON, HITB, KCon, SyScan360, ISC, etc. His is interested in IoT security and connected car security. Along with his colleagues, has previously found several automobile vulnerabilities in Tesla, GM cars, Volvo, BMW, Audi, Mercedes Benz and BYD. He is the author of <\n> (\"Connected Car Security Demystified\"). He is also the co-author of \"Inside Radio: An Attack & Defense Guide\".",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Researcher, Radio Security Department of 360 Security Technology",
      "name": "Jun Li",
      "id": 26189,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Zenofex (@zenofex) is a senior research scientist at Cylance. Zenofex founded the Exploitee.rs which is a public research group that has released exploits for over 65 devices including the Amazon FireTV, Roku Media Player and the Google Chromecast. Zenofex is also a member of Austin Hackers (AHA) and has spoken at a number of security conferences including BlackHat and DEF CON.\n@zenofex",
      "twitter": "@zenofex",
      "conference": "DC26",
      "title": "Hacker",
      "name": "zenofex",
      "id": 26190,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "zerosum0x0 is the author of all MS17-010 ETERNAL Metasploit exploit modules and was the first to reverse engineer the DOUBLEPULSAR backdoor. He has taught workshops on Windows internals at DEF CON and to government agencies.\n@zerosum0x0",
      "twitter": "@zerosum0x0",
      "conference": "DC26",
      "title": "Hacker",
      "name": "zerosum0x0",
      "id": 26191,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Shaokun Cao is a freelance Security researcher, a consultant of UnicornTeam. He is currently focusing on the chip-level security issues, such as microcode, ROM, bootloader, and firmware.",
      "twitter": "",
      "conference": "DC26",
      "title": "Freelance Security Researcher",
      "name": "Shaokun Cao",
      "id": 26192,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Yunding Jian is the co-founder of UnicornTeam. He is the leader of RocTeam in the Radio Security Research Department of 360 Technology. He is the designer of all pervious SyScan360 Conference badges. He also made serial presentations on Blackhat USA, Blackhat Europe & Asia (Arsenal) ,HITB about his hardware security research and design experience.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Researcher, Unicorn Team, 360 Technology",
      "name": "Yunding Jian",
      "id": 26193,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mingchuang Qin is a senior security researcher at the Radio Security Research Department of 360 Technology,the core developer of Skyscan Wireless Intrusion and Prevention System,specializing in IoT and wireless device security. With rich experience in embedded system development, he is proficient in with WiFi and Bluetooth protocol analysis and vulnerability discovery.",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior security researcher at the Radio Security Research Department of 360 Technology,",
      "name": "Mingchuang Qun",
      "id": 26194,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Daniel Zolnikov is a third term liberty-minded State Representative serving in the Montana Legislature. He is a been a strong advocate for civil rights concerning our freedoms and liberties, and limited government, and is working to make Montana the Last Best Place for future generations. As a 31-year-old representative who first served in his mid-20's, Daniel has specialized in 21st Century policy areas addressing the opportunities and risks associated with new technologies. Zolnikov has also lead on energy policy as the Chairman of the House Energy, Technology and Federal Relations Committee. \nDaniel is the nation's leading legislator regarding laws protecting digital information and devices. In 2017, he passed leading legislation requiring a warrant for digital communication devices, warrant requirements for digital communications, limits on license plate readers that prevent the DEA from using Montana's information in their national vehicle tracking program and reformed and created strict limits on vehicle spot checks. \nHe has also successfully passed laws requiring government to get a warrant to access cellphone location information, passing the strongest Freedom of the Press legislation in the nation, protecting reporters' electronic communications from government intrusion, and give immunity from MIP laws to minors who seek emergency medical attention. He also helped lead the effort to revise Montana's outdated transportation laws to allow ride-sharing services like Uber to operate in Montana, which is expected to reduce the drunk driving epidemic in many communities. \nForbes ranked Daniel among the top\"30 Under 30\" policymakers in the nation, and Red Alert Politics recognized him as one of the country's Top 30 Conservatives under the age of 30. He has also received the Montana Library Association's\"Intellectual Freedom Award\", along with Responsibility.org's\"Advancing Alcohol Responsibility\" leadership award. \nDaniel is a strong advocate of transparency in government, and has posted his votes on his public Facebook page. He regularly interacts with constituents on his Twitter profile, @DanielZolnikov. \nDaniel received his undergraduate degree from the University of Montana where he earned three business majors in Information Systems, Marketing, and Management, along with a minor in Political Science. Outside of the Legislature, Daniel has worked as a small business consultant and is currently obtaining his MBA. Daniel enjoys fishing, swimming, and the freedom that only Big Sky Country can offer.\n@DanielZolnikov, www.facebook.com/danielzolnikov, www.linkedin.com/ind/zolnikov, www.danielzolnikov.com",
      "twitter": "@DanielZolnikov",
      "conference": "DC26",
      "title": "Montana State Representative",
      "name": "Daniel Zolnikov",
      "id": 26195,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dylan James Smith\n Dylan James Smith has assisted  with classes as a tutor and TA and at hands-on workshops at DEF CON, RSA, B-Sides LV and other conferences. He has worked in and around the computer support and network administration industries since adolescence. Now he's old(er.) Currently tearing things apart and putting them back together and seeking opportunities to practice and teach \"the cybers\".\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Instructor, City College San Francisco",
      "name": "Sam Bowne",
      "id": 26200,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "DylanJamesSmith",
      "id": 26201,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Elizabeth Biddlecome is a consultant and instructor, delivering technical training and mentorship to students and professionals. She leverages her enthusiasm for architecture, security, and code to design and implement comprehensive information security solutions for business needs. Elizabeth enjoys wielding everything from soldering irons to scripting languages in cybersecurity competitions, hackathons, and CTFs.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Consultant",
      "name": "Elizabeth Biddlecome",
      "id": 26202,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Louis Nyffenegger is a security engineer and entrepreneur based in Melbourne, Australia. He performs pentest, architecture and code review on a daily basis. Louis is the founder of PentesterLab, a learning platform for web penetration testing.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Engineer, Pentester Lab",
      "name": "Louis Nyffenegger",
      "id": 26203,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Luke Jahnke is a Security Researcher at Elttam. He has extensive experience performing security assessments and running training. He enjoys working on interest vulnerabilities and runs the biennial BitcoinCTF competition.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher, Elttam",
      "name": "Luke Jahnke",
      "id": 26204,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "NickTait",
      "id": 26205,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sneha works as Senior Security Consultant with Payatu Software Labs LLP. Her interests lies in web, mobile application security and fuzzing. She has discovered various security flaws within various open source applications such as PDFLite, Jobberbase, Lucidchart and more. She has spoken and provided trainings at various conferences such as DEFCON, BSides LV, BSidesVienna, OWASP AppSec USA, DeepSec, DefCamp, FUDCon, and Nullcon. Sneha is passionate about promoting and encouraging Women in Security and has founded an initiative called WINJA-CTF through which she hosts women-only CTFs and Workshops at conferences and other events. Sneha is also active in the local security community and hosts local security meet-ups in Pune. She leads the Pune chapter of null community.\n \n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Consultant, Payatu Software Labs LLP",
      "name": "Sneha Rajguru",
      "id": 26206,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Arun Magesh works as IoT Security Researcher at Payatu Software labs and has worked on numerous smart devices pentest in the past couple of years. With an electrical engineering academic background, he serves as a core committee member for several IoT local chapters and hackerspaces in India, where he regularly delivers talks and hands-on workshops. He has 5+ years hands-on experience in both building and breaking IoT devices and has been previously awarded for India's Top 25 under 25 technologists and Intel Software Innovator. He has delivered training to numerous governmental and private organizations around the world. He is also a speaker and trainer at several conferences like nullcon18, zer0con18, RISC17, Intel Devfest and EFY17 and His main focus area in IoT is embedded device and SDR security. He has also built and contributed to a number of projects such as Brain-Computer interfacing and Augment Reality solutions.\n \n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "IoT Security Researcher, Payatu Software Labs, LLP",
      "name": "Arun Magesh",
      "id": 26207,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Adam Steed prides himself in not just being an Information Security professional, but has been part of the culture that has defined Defcon for the last two decades. He has over 20 years of experience in working for Financial, Websites and Healthcare organizations. Currently Adam is a Associate Director at Protiviti as part of the Security and Privacy practice, leading Active Directory assessments and remediation work for Protiviti's clients. He has also spoken at Defcon, Bsides and other events across the United States.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Consultant, Protiviti",
      "name": "Adam Steed",
      "id": 26208,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "James is a Senior Consultant in the Security and Privacy practice at Protiviti. He received a B.S. in Security and Risk Analysis with a specialization in Cyber Security from Penn State University. He currently provides information security services for a wide range of clients in various industries to identify and communicate business risks.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Consultant, Protiviti",
      "name": "James Albany",
      "id": 26209,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wesley McGrew oversees and participates in penetration testing in his role as Director of Cyber Operations for HORNE Cyber Solutions. He has presented on topics of penetration testing, vulnerabilities, and malware analysis at DEF CON and Black Hat USA. He teaches a self-designed course on reverse engineering to students at Mississippi State University, using real-world, high-profile malware samples. Wesley graduated from Mississippi State University's Department of Computer Science and Engineering and previously worked at the Distributed Analytics and Security Institute. He holds a Ph.D. in computer science for his research in vulnerability analysis of SCADA HMI systems.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Director of Cyber Operations, HORNE Cyber Solutions",
      "name": "Wesley McGrew",
      "id": 26210,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Kendall serves as Director of Cyber Intelligence for HORNE Cyber, where his specialty is digital forensics and incident response. Prior to his role at HORNE Cyber, Kendall co-founded the National Forensics Training Center where he served as lead instructor providing training to law enforcement and U.S. military veterans in a wide range of digital forensic skills.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Director of Cyber Intelligence, HORNE Cyber",
      "name": "Kendall Blaylock",
      "id": 26211,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "BenHughes",
      "id": 26212,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "FredMastrippolito",
      "id": 26213,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "JeffMagloire",
      "id": 26214,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Madhu is a security ninja and published author, security and devops researcher with extensive experience in the industry ranging from client facing assignments building scalable and secure infrastructure, to publishing industry leading research to running training sessions for companies and governments alike.\nMadhu's research papers are frequently selected for major security industry conferences including Defcon 24, Blackhat USA 2018, All Day DevOps (2016, 2017), DevSecCon (London, Singapore, Boston), DevOpsDays India, c0c0n, Serverless Summit, ToorCon, DefCamp, SkydogCon, NolaCon and null, etc. Madhu was a keynote speaker for the National Cyber Security conference at Dayananda Sagar College in Feb 2016.\nWhen he's not working with Appsecco's clients or speaking at events he's actively involved in researching vulnerabilities in open source products/platforms such as WordPress, Ntop, Opendocman etc. and is also a contributing bug hunter with Code Vigilant (a project to Secure Open Source Software). His research has identified many vulnerabilities in over 200 organisations including US Department of Homeland Security, Google, Microsoft, Yahoo, Adobe, LinkedIn, Ebay, At&t, Blackberry, Cisco, Barracuda etc. He is also an active member with Bugcrowd, Hackerone, Synack etc.\nMadhu has trained over 5000 people in information security for companies and organisations including the Indian Navy and the Ministry of e-services in a leading Gulf state. He is co-author of Security Automation with Ansible2 book published by Packt Publishing in December 2017, which is listed as a resource by the RedHat Ansible itself.\n \n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security & DevOps Researcher, Appsecco",
      "name": "Madhu Akula",
      "id": 26215,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Consultant, Protiviti",
      "name": "Jon Medina\n\t\t\t\t\tMegha Kelsi ",
      "id": 26216,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joe Grand (@joegrand), also known as Kingpin, is a computer engineer, hardware hacker, former DEFCON badge designer, teacher, advisor, runner, daddy, honorary doctor, TV host, member of legendary hacker group L0pht Heavy Industries, and the proprietor of Grand Idea Studio (grandideastudio.com). He has been creating, exploring, and manipulating electronic systems since the 1980s.\n \n \n",
      "twitter": "@joegrand",
      "conference": "DC26",
      "title": "Grand Idea Studio",
      "name": "Joe Grand",
      "id": 26217,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Vaibhav is working as a Security Researcher with Adobe Systems. His expertise lies in infusing design and architecture level security in applications hosted in-house and on cloud environments. With ~9 years of diverse InfoSec exposure, he has strong experience in attacking and defending applications including the ones hosted on the cloud. He is co-leading the OWASP and Null community in Delhi region and has delivered multiple sessions at the local and global stage. Vaibhav is also co-organizer for BSides Delhi.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher, Adobe Systems",
      "name": "Vaibhav Gupta",
      "id": 26218,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sandeep is a Security Managing Consultant with NotSoSecure. He has over 5 years of experience in delivering high end security consulting services to clients across the globe. Sandeep has also worked in Detection and Response teams in the past. He is the co-lead of OWASP Delhi chapter and Community Manager of null community and actively contributes to the local security community. He has conducted and delivered many talks and workshops for the local community in the past. Sandeep is also one of the organizers of BSides Delhi.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Managing Consultant, NotSoSecure",
      "name": "Sandeep Singh",
      "id": 26219,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "MiguelGuirao",
      "id": 26220,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "CsabaFitzl",
      "id": 26221,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sergei is a co-founder of Open Analysis, and volunteers as a malware researcher. When he is not reverse engineering malware Sergei is focused on building automation tools for malware analysis. Sergei is a strong believer in taking an open, community approach to combating cyber crime. He actively contributes to open source tools and tries to publish as much analysis as possible. With over a decade of experience Sergei has held roles both as the manager of an incident response team, and as a malware researcher.\nYouTube: https://www.youtube.com/oalabs ",
      "twitter": "",
      "conference": "DC26",
      "title": "Co-Founder, Open Analysis",
      "name": "Sergei Frankoff",
      "id": 26222,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sean is a co-founder of Open Analysis, and volunteers as a malware researcher. He splits his time between reverse engineering malware and building automation tools for incident response. He is an active contributor to open source security tools focused on incident response and analysis. Sean brings over a decade of experience working in a number of incident response and application security roles with a focus on security testing and threat modeling. In his free time Sean loves fly fishing.\nYouTube: https://www.youtube.com/oalabs ",
      "twitter": "",
      "conference": "DC26",
      "title": "Co-Founder, Open Analysis",
      "name": "Sean Wilson",
      "id": 26223,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joshua is a software engineer specializing in information and network security. He has worked in the critical infrastructure and cloud computing industries with employers heavily invested in software and hardware security. Among his passions are hacking, teaching kids to program, listening to upper-crust orchestral performances with his wife, and figuring out how he can get paid to do it all... legally.\n\nJoshua is the maintainer of the boofuzz network protocol fuzzing framework. He has written fuzzers for fun, and profit (literally).\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Software Engineer",
      "name": "Joshua Pereyda",
      "id": 26224,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Tim is a software engineer working in information security. He has worked for a startup and data analytics companies. He currently works in critical infrastructure with a focus on security and fuzzing. He cringes at the thought of insecure systems and so he seeks to improve the security of anyone who will listen. He enjoys a good hike, ice cream, and long walks on the beach.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Software Engineer",
      "name": "Timothy Clemans",
      "id": 26225,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Vyrus may or may not have begun his offensive security training in early childhood through a series of allegedly criminal acts for a hacker collective still active on the internet today. Over the last approximately 2 decades these experiences have expressed themselves through participation within a variety of both independent, as well as corporate; technically legal information security professions. While the specific nature of many of these professions has yet to be disSOON, the professional skills Vyrus has been known to utilize throughout employment include but are not limited to: reverse engineering, penetration testing, \"red teaming\", security controls analysis, proof of concept malware development, incident response, implant development, exploit development, long term electronic surveillance, traffic analysis, complex systems risk analysis, many forms of wireless security, hardware security assessment, and general IT solution development & support.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Vyrus",
      "id": 26226,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "DanBorges",
      "id": 26227,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alex Levinson is a Senior Security Engineer at Uber with experience in red teaming, software engineering, and incident response. Outside of Uber, he is a core member of the red team for the National Collegiate Cyber Defense Competition (CCDC), as well as the Competition Director for the Collegiate Penetration Testing Competition (CPTC). Previously, Alex worked as a Senior Consultant and Development Manager at Lares Consulting.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Engineer, Uber",
      "name": "Alex Levinson",
      "id": 26228,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jakub works as Primary Security Engineer in Samsung Poland R&D Center leading a team of security researchers.\n  He has more than 15 years of experience in information security and previously worked e.g. in: one of world leading payment card service providers, Big4 consulting company and vendor of network encryption devices. Jakub holds PhD degree of Warsaw University of Technology and security community certificates including: GWAPT, CISSP, ECSA.\n  Currently he works providing security assessments (static and dynamic analysis) of different mobile and IoT components. afl helped him find numerous vulnerabilities, also in open source components.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Primary Security Engineer, Samsun Poland R&D Center",
      "name": "Jakub Botwicz",
      "id": 26229,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Wojciech has background as a full-stack developer, currently works as a Security Engineer for Samsung Research Poland. His current area of research is IoT and mobile devices. Likes to talk about cryptography and higher level languages. Loves to take things apart, build new things (because old ones got irreversibly broken in the process) and make stuff work (again). Plays in CTF Samsung R&D PL team (crypto/net/programming).\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Engineer, Samsung Research",
      "name": "Wojciech Rauner",
      "id": 26230,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Walter (@wcu35745) leads the team of pentesters at Open-Sec (Peruvian company dedicated solely to provide pentesting services) since 2006. His work is based on developing attack vectors and his main interest is in the development of scripts for pentesting.\nHe has participated as speaker in events such as LimaHack, Campus Party Quito, CSI Pereira, events of OWASP Latam and as trainer at Ekoparty.\nHe has also published articles in trade magazines such as Hakin9, PenTest Magazine and Hack-in-Sight.\nDuring 2016, he was part of the team of instructors approved by the US Northern Command (US Army) for training in cybersecurity (hacking techniques and breach of security controls).\nCurrently holds OSCP certification.\n",
      "twitter": "@wcu35745",
      "conference": "DC26",
      "title": "Team Lead, Open-Sec",
      "name": "Walter Cuestas",
      "id": 26231,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mauricio (@mvelazco) is a security geek and python scripter with more than 9 years of experience in computer security developing offensive evaluations and implementing solutions in Latin America and North America. He currently leads the Threat Management team at a financial services organization in New York performing tasks such as Penetration  Testing, Incident Response, Vulnerability Management, Application Security, Threat Intelligence, etc.\nHe holds certifications like OSCP and OSCE.\nMauricio has presented at conferences like Derbycon and BSides.\n \n",
      "twitter": "@mvelazco",
      "conference": "DC26",
      "title": "Threat Management Team Lead",
      "name": "Mauricio Velazco",
      "id": 26232,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "JeremyJohnson",
      "id": 26233,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Eijah is the founder of Promether and has 20+ years of software development and security experience. He is also the creator of Demonsaw, an encrypted communications platform that allows you to chat, message, and transfer files without fear of data collection or surveillance. Before that Eijah was a Lead Programmer at Rockstar Games where he created games like Grand Theft Auto V. He has been a faculty member at multiple colleges, has spoken about security and development at DEFCON and other security conferences, and holds a master's degree in Computer Science. Eijah is an active member of the hacking community and is an avid proponent of Internet freedom.\n \n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Founder, Promether",
      "name": "Eijah",
      "id": 26234,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Clarence Chio has shared his research on ML and security at hacking events around the world. He has taught dozens of training classes and workshops to conference attendees and security teams at large tech companies. He wrote the new O'Reilly Book \"Machine Learning & Security: Protecting Systems with Data and Algorithms\", and organizes the AI Village at DEF CON. Clarence has a B.S. and M.S. in Computer Science from Stanford, specializing in data mining and artificial intelligence.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Researcher",
      "name": "Clarence Chio",
      "id": 26235,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Anto Joseph is a Security Engineer for Tinder. He is involved in developing and advocating security in Machine Learning Systems & Application Security Research. Previously, he has worked at Intel, Citrix, and E&Y in multiple information security roles. He is very passionate about exploring new ideas in these areas and has been a presenter and trainer at various security conferences including BH USA, Defcon, BruCon, HackInParis, HITB Amsterdam, HackLu, Hacktivity, PHdays, X33fCon, NullCon, c0c0n and more. He is an active contributor to many open-source projects and some of his work is available at https://github.com/antojoseph.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Engineer, Tindr",
      "name": "Anto Joseph",
      "id": 26236,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "RichardHenderson",
      "id": 26237,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "BryanPassifiume",
      "id": 26238,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Arun: is a Hardware, IOT and ICS Security Researcher. His areas of interest are Hardware Security, SCADA, Fault Injection, RF protocols and Firmware Reverse Engineering. He also has experience in performing Security Audits for both Government and private clients. He has presented a talk at the nullcon 2016,2017,2018 Goa, GNUnify 2017, Defcamp 2017,BsidesDelhi 2017, c0c0n x 2017,EFY 2018,X33fcon2018 Also Trainer for Practical Industrial Control Systems (ICS) hacking training, delivered in X33fcon2018 and was co-Trainer for Practical IoT hacking which was delivered in HITB 2017, HIP 2017, BlackHat Asia 2018 and private clients in London, Australia, Sweden, Netherlands etc. He is an active member of null - The open Security community and G4H community.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Principle Researcher, SecureLayer7",
      "name": "Arun Mane",
      "id": 26239,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Rushikesh: is a security analyst. Having more than six years of experience under his belt, his assignments have always been pointed towards reducing the state of insecurity for information. His research papers were accepted at NCACNS 2013, nullcon 2014, HITCON 2014, Defcamp 2014, BruCON 2015, DEFCON 24, BruCON 2016, x33fcon 2017, c0c0n-x 2017, BruCON 2017, BSides Delhi 2017, nullcon 2018, HITB Amsterdam 2018 and x33fcon 2018, as well he is a co-author of an intelligent evil twin tool \"DECEPTICON\". Being an avid CTF player, for him solace is messing up with packets, frames and shell codes.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Analyst",
      "name": "Rushikesh D. Nandedkar",
      "id": 26240,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Gary works as the Technology Director for a medium size city in Texas.  This job requires him to wear many hats to include performing forensic analysis on enterprise systems.  In addition, he has helped the City's police department with several criminal cases that involved the collection of network and stored data from systems under investigation.  Additionally, he teaches information security classes at the local junior college to include a forensic investigation course for IT security students.  Besides 15 years of experience in the IT field, he has a BS in Network Administration and a Masters in Information Security Assurance.  He, also, holds several industry certifications to include a Certified Ethical Forensic Investigator Certification.  Since he is easily distracted and always curious, he has a wide-range of interest and off-hour projects that run the gambit from in-depth study about  cyber security to data analysis programming to electronic projects that use the Raspberry Pi and Arduino chips.\n \n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Technology Director",
      "name": "Gary Bates",
      "id": 26241,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Alexandrine Torrents is a cybersecurity consultant at Wavestone, a French consulting company. She is specialized in penetration testing, and performed several security assessment on ICS. She worked on a few ICS models to demonstrate attacks on PLCs and she developed a particular tool to request Siemens PLCs. Moreover, she is also working at securing ICS, in the scope of the French military law, enforcing companies offering a vital service to the nation to comply to security rules.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Security Consultant, Wavestone",
      "name": "Alexandrine Torrents",
      "id": 26242,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Arnaud Soullié is a manager at Wavestone, performing security audits and leading R&D projects. He has a specific interest in Active Directory security as well as ICS, two subjects that tend to collide nowadays. He teaches ICS security and pentests workshops at security conferences (BlackHat Europe 2014, BSides Las Vegas 2015/2016, Brucon 2015/2017, DEFCON 24) as well as full trainings (Hack In Paris 2015).\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Manager, Wavestone",
      "name": "Arnaud SOULLIÉ",
      "id": 26243,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "David (endless) works as a Senior Security Consultant at Context Information Security. He started his professional career as a Linux administrator and then moved to information security about 5 years ago. He has a wide skill set but has developed a specific interest in web and mobile technologies. In the past he provided training on a variety of topics, including advanced web application training to developers and pentesters. Recently he's done some research work on XSLT injection attacks. He also developed BHFS, a write-only filesystem based on PGP.\nPersonal site:\n https://www.authenticationfailure.com/\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Security Consultant, Context Information Security",
      "name": "David Turco",
      "id": 26244,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jon is a Principal Security Consultant at Context Information Security. After working as an enterprise dev for a few years he moved into security, spending the last 7 years breaking code instead of writing it. Mobile security has been a key topic for him since back when there was still something called the Windows Phone and he has delivered training on this topic, and others like web app hacking and scripting attacks, over the last 5 years. Most of his time these days are spent on random red teams or reverse engineer mobile applications, but other interests do include the writing of rootkits and remote access tools... just for fun... as well as the occasional dabble in game design!\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Principal Security Consultant, Context Information Security",
      "name": "Jon Overgaard Christiansen",
      "id": 26245,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "MattCheung",
      "id": 26246,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Gabriel Ryan is a penetration tester and researcher with a passion for wireless and infrastructure testing. He currently serves a co-founder and principle security consultant for Digital Silence, a Denver based consulting firm that specializes in impact driven penetration testing and red team engagements. \nPrior to joining Digital Silence, Gabriel worked as a penetration tester and researcher for Gotham Digital Silence, contributing heavily to their wireless security practice and regularly performing large scale infrastructure assessments and red teams for Fortune 500 companies. Some of Gabriel's most recent work includes the development of EAPHammer, an 802.11ac focused tool for breaching WPA2-EAP networks. On the side, he serves as a member of the BSides Las Vegas senior staff, coordinating wireless security for the event. In his spare time, he enjoys producing music, exploring the outdoors, and riding motorcycles.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Co-Founder & Principle Security Consultant, Digital Silence",
      "name": "Gabriel Ryan",
      "id": 26247,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Justin is an Army infantry veteran with over a decade of service. After retiring from the military, he went on to have a successful 7 year career in computer forensics and incident response. In 2015, he became a penetration tester at One World Labs, working under renowned security researcher Chris Roberts. He now serves as CEO and Co-Founder of Digital Silence, bringing a unique attention to detail and blend of blue and red team experience to the company. When he's not focused on his role as a security professional, Justin happily pursues his hobby of synchronized figure skating.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "CEO & Co-Founder, Digital Silence",
      "name": "Justin Whitehead",
      "id": 26248,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bryce Kunz (@TweekFawkes) craves righteous red team hacks. Currently, the President of Stage 2 Security. Previously he supported the NSA (network exploitation & vulnerability research), Adobe (built red teaming program for cloud services), and DHS (incident response). Bryce holds numerous certifications (e.g. OSCP, etc...), and has spoken at various security conferences (i.e. BlackHat, DerbyCon, etc...).\n",
      "twitter": "@TweekFawkes",
      "conference": "DC26",
      "title": "President, Stage 2 Security",
      "name": "Bryce Kunz",
      "id": 26249,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Kevin Lustic is an InfoSec researcher located just outside Salt Lake City, Utah. He is currently a red-teamer for Adobe in Lehi, performing offensive security testing against the various Adobe Digital Experience solutions. Prior to joining Adobe, Kevin spent five years in the Intelligence Community as a global network vulnerability analyst, cryptanalyst, and developer in various positions. He earned his Bachelor's degree in Mathematics from Ohio University, then his Master's degree in Cyberspace Operations from the Air Force Institute of Technology under a full NSF-funded CyberCorps scholarship.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Information Security Researcher",
      "name": "Kevin Lustic",
      "id": 26250,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Vinnie is a penetration tester of web application & mobile application working for EY. During college he wrote a thesis about RFID and now he using his experience to provide a RFID workshop and make people aware of the vulnerabilities within RFID. In his spare time he strengthen his IT security skills by playing CTF's, reading blogs, going to conferences and develop a variety of side projects.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Penetration Tester, Ernst & Young Belgium",
      "name": "Vinnie Vanhoecke",
      "id": 26251,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Lorenzo is a cyber security consultant at EY. He mainly focusses on penetration testing and red team exercises. Because of the different physical intrusion he had to perform in the scope of the red teaming activities, he extended his wireless knowledge to the RFID field, where he gained experience over the years. In his spare time Lorenzo likes to learn new topics related to cyber security. He has basic knowledge of wireless signal hacking, in addition of RFID.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Cyber Security Consultant, Ernst & Young Belgium",
      "name": "Lorenzo Bernardi",
      "id": 26252,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Dave Porcello is the Founder of Pwnie Express and creator of the original Pwn Plug, Power Pwn, and other covert pentesting gadgets featured on NPR, Wired, Ars Technica, Slashdot, and \"Mr. Robot\". Dave is currently a freelance pentester, packet hunter, researcher, & adjunct professor at Norwich University.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "Founder, Pwnie Express",
      "name": "Dave Porcello",
      "id": 26253,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sean Gallagher is Ars Technica's IT and National Security Editor. He evaluates security tools and conducts privacy and security testing for Ars' Technology Lab.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "IT & National Security Editor, Ars Technica",
      "name": "Sean Gallagher",
      "id": 26254,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Having used Wireshark ever since it was Ethereal, David has been analyzing network traffic for well over a decade. He has spent the majority of his professional career understanding how networks and applications work, currently as Principal Threat Researcher for Awake Security. David holds computer security degrees from the Rochester Institute of Technology (BS) and Carnegie Mellon University (MS).\n \n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Principal Threat Researcher, Awake Security",
      "name": "David Pearson",
      "id": 26255,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Abhay Bhargav is the CTO of we45, a focused Application Security company. Abhay is the author of two international publications. \"Secure Java for Web Application Development\" and \"PCI Compliance: A Definitive Guide\". Abhay is a builder and breaker of applications, and has authored multiple applications in Django and NodeJS. He is the Chief Architect of \"Orchestron\", a leading Application Vulnerability Correlation and Orchestration Framework. He is a passionate Pythonista and loves the idea of automation in security. This passion prompted him to author the world's first hands-on Security in DevOps training that has been delivered in multiple locations, and recently as a highly successful training programs at the OWASP AppSecUSA 2016, OWASP AppSec EU and USA 2017. Abhay recently delivered a workshop on SecDevOps at DEFCON 25. In addition , Abhay speaks regularly at industry events including OWASP, ISACA, Oracle OpenWorld, JavaOne, and others.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "CTO, we45",
      "name": "Abhay Bhargav",
      "id": 26256,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sharath is a Senior Solutions Engineer at we45. As part of his role, Sharath has architected and developed multiple solutions around security engineering, including an Application Vulnerability Correlation tool called Orchestron. As part of his experience with Application Security, Sharath has developed integrations for multiple security products including DAST, SAST, SCA and Cloud environments, In addition, Sharath has extensive experience with Cloud Deployments and Container Native Deployments. As part of his role in a security organization, Sharath has led teams that have created intentionally vulnerable apps for CTF competitions both inside and outside the organization.\n \n",
      "twitter": "",
      "conference": "DC26",
      "title": "Senior Solutions Engineer, we45",
      "name": "Sharath Kumar Ramadas",
      "id": 26257,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "d4rkm4tter is a mad scientist who likes to hack hardware and software. He is particularly obsessed with wireless. He has a degree in computer science which he has put to use building and breaking a wide variety of systems.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Mike Spicer",
      "id": 26275,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Prashant Mahajan is a Security Consultant at Sense of Security Pty Ltd. He has experience with various aspects of Information Security including penetration testing, vulnerability analysis, digital forensics and incident response. Prashant is a founding member of Null - The Open Security Community and frequent speaker at industry events.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Prashant Mahajan",
      "id": 26276,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bio: Ankur Tyagi is a Sr. Malware Research Engineer at Qualys Inc., where he analyzes malicious code and applies statistical modelling to identify suspicious patterns and evolving trends. His research interests include structural visualization techniques for classifying large collections of uncategorized samples. He has completed MS in Software Systems with focus on Applied Security.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Ankur Tyagi",
      "id": 26277,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Anand Tiwari is an information security professional with nearly 5 years of experience in offensive security, with expertise in Mobile and Web Application Security. Currently working with Philips Healthcare on securing medical devices. He has authored Archery - open source tool and has presented at Black Hat Asia 2018. In his free time, he enjoys coding and experimenting with various open source security tools. Twitter handle: @anandtiwarics\n",
      "twitter": "@anandtiwarics",
      "conference": "DC26",
      "title": "",
      "name": "Anand Tiwari",
      "id": 26278,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nishant Sharma is a Technical Manager at Pentester Academy and Hacker Arsenal where he leads the development of multiple gadgets for WiFi pentesting such as WiMonitor, WiNX, WiMini and course/training content. He has presented/published his work at Blackhat Arsenal, Wireless Village, IoT village and Demo labs (DEFCON). Prior to joining Pentester Academy, he worked as a firmware developer at Mojo Networks where he contributed in developing new features for the enterprise-grade WiFi APs and maintaining the WIPS solution. He has a Master degree in Information Security from IIIT Delhi. He has also published peer-reviewed academic research on HMAC security. His areas of interest include WiFi and IoT security, AD security, forensics and cryptography.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Nishant Sharma",
      "id": 26279,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jeswin Mathai is a Researcher at Pentester Academy. He has a Bachelor degree from IIIT Bhubaneswar. He was the team lead at InfoSec Society IIIT Bhubaneswar in association with CDAC and ISEA, which performed security auditing of government portals and conducted awareness workshops for government institutions. He was also the part of team Pied Piper who won Smart India Hackathon 2017, a national level competition organized by GoI. His area of interest includes Malware Analysis and Reverse Engineering, Cryptography, WiFi security and Web Application Security.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Jeswin Mathai",
      "id": 26280,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joshua is a software engineer specializing in information and network security. He has worked in the critical infrastructure and cloud computing industries with employers heavily invested in software and hardware security. He currently hunts vulnerabilities full time. Among his passions are hacking, teaching kids to program, listening to upper-crust orchestral performances with his wife, and figuring out how he can get paid to do it all... legally.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Joshua Pereyda",
      "id": 26281,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Rod Soto. Director of Security Research at JASK.AI\nFounder Pacific Hackers Conference, Co-founder Hack The Valley\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Rod Soto",
      "id": 26282,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Joseph Zadeh. Director of Data science at JASK.AI\nCo-founder Hack the Valley\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Joseph Zadeh",
      "id": 26283,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Jayesh Singh Chauhan is a security professional with 7 years of experience in the security space. In past, he has been part of security teams of PayPal, PwC and currently works as the senior security engineer for Sprinklr. He has authored CS-Suite, OWASP Skanda, RFID_Cloner and CSRF PoC generator and has presented in BlackHat Asia, BlackHat EU, hackmiami, c0c0n, GES and Ground Zero Summit. He is the project leader for OWASP Skanda and leads the NULL Bangalore chapter.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Jayesh Singh Chauhan",
      "id": 26284,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mikhail Burshteyn is a security consultant at CDW, performing Penetration Tests. Mikhail currently performs External, Internal, Wireless, and Social Engineering assessments, testing the capabilities for wide range of clients and industries. He is interested in research in various security topics, including Networking, Web Apps, and Active Directory.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Mikhail Burshteyn",
      "id": 26285,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Bhadreshkumar Patel is a Reverse Engineer by nature and Security Specialist/Pentester by profession with 10 years of experience in offensive and defensive side of security. Likes to code, break stuff, play with controllers. Got lucky in finding zero days in Facebook, NGFW, wireless routers, HMS etc. Dejavu is Bhadresh's first conference submission, but not his first contribution to the security community.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Bhadreshkumar Patel",
      "id": 26286,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Harish Ramadoss has over seven years of experience in offensive security space focusing on application and infrastructure security assessments. Led large scale penetration testing engagements for various clients across Finance, Government and Defense.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Harish Ramadoss",
      "id": 26287,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Gabriel Ryan is a penetration tester and researcher with a passion for wireless and infrastructure testing. He currently serves a co-founder and managing security consultant for Digital Silence, a Denver-based consulting firm that specializes in impact driven testing and red team engagements. Prior to joining Digital Silence, Gabriel worked in penetration tester for security services firm Gotham Digital Science as well as OGSystems, a Virginia-based geospatial intelligence contractor. On the side, he serves as a member of the BSides Las Vegas senior staff, coordinating wireless security for the event. In his spare time, he enjoys writing music and riding motorcycles.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Gabriel Ryan",
      "id": 26288,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Aseem Jakhar is the Director, research at Payatu Software Labs http://payatu.com a boutique security testing company specializing in IoT, Embedded, cloud, mobile security testing. He is the founder of null-The open security community, registered not-for-profit organization http://null.co.in and also the founder of nullcon security conference http://nullcon.net and hardwear.io security conference. He has worked on various security software including UTM appliances, messaging/security appliances, anti-spam engine, anti-virus software, bayesian engine to name a few. He currently spends his time researching on IoT security and hacking things. He is an active speaker and trainer at security conferences like AusCERT, Black Hat, Brucon, Defcon, Hack.lu, Hack in Paris, Hack In The Box, PHDays and many more. He has authored various open source security software including - ExplIoT - IoT Exploitation Framework - DIVA Android (Damn Insecure and Vulnerable App)- Jugaad/Indroid - Linux Thread injection kit for x86 and ARM - Dexfuzzer - Dex file format fuzzer\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Aseem Jakhar",
      "id": 26289,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Utku Sen is a security researcher who is mostly focused on following areas: application security, network security, tool development. He presented his tool, Leviathan Framework in Black Hat USA Arsenal and DEF CON Demo Labs in 2017. He also nominated for Pwnie Awards on \"Best Backdoor\" category in 2016.\". He currently works in Tear Security.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Utku Sen",
      "id": 26290,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Gozde Sinturk is Security Researcher and Python Developer who involved in projects related to machine learning, natural language processing, and big data. She is developing security tools in her current position. She currently works in Tear Security.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Gozde Sinturk",
      "id": 26291,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Andrew Morris is the founder of GreyNoise Intelligence, a DC-based cyber security company, and likely holds the world record for amount of time spent staring at Internet-wide scan traffic. Prior to founding GreyNoise, Andrew worked as a researcher, red team operator, and consultant for several large cyber security firms including Endgame, NCC group, and KCG. Outside of work, Andrew enjoys playing fingerstyle acoustic guitar and tries to figure out what his dreams mean.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Andrew Morris",
      "id": 26292,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "We are working in Mitsui Bussan Secure Directions, Inc. as security engineer and researcher. In the past, we found out numerous vulnerabilities in server of client and we proposed countermeasures to client. We think that there's more and want to efficiently find out vulnerabilities. Therefore, we are focusing on artificial intelligence technology and developing fully automated penetration testing tool using machine learning.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Isao Takaesu",
      "id": 26293,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Masuya Masafumi",
      "id": 26294,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Toshitsugu Yoneyama,",
      "id": 26295,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Sanoop Thomas (@s4n7h0) is a seasoned security professional with diverse background in consulting, teaching, research and product-based industries with a passion to solve complex security problems. Today, Sanoop works as information security specialist focusing on application security and secure coding. His field of interest includes reverse engineering, malware analysis, application security and automating security pentest/analysis methodologies. He is moderating null open community chapter in Singapore and organised over 60 events & workshops to spread security awareness across country. Sanoop is also the author of Halcyon IDE (https://halcyon-ide.org) an IDE that is focused to develop Nmap scripts. He has spoken at security conferences like Nullcon, OWASP India, HITBGSEC, Rootcon, and Blackhat Arsenal.\n",
      "twitter": "@s4n7h0",
      "conference": "DC26",
      "title": "",
      "name": "Sanoop Thomas",
      "id": 26296,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ashwin K Whitchurch is the CEO of ProtoCentral (Circuitects Electronics Solutions Pvt Ltd) based out of Bangalore in India. The company makes, sells and supprts open source hardware products, most of them for healthcare and medical applications. Ashwin has published research papers, book chapters and reviews in well-known international journals and conferences. ProtoCentral (and Ashwin) has been present in many hardware gatherings including Maker Faire ( New York & Rome), Hackaday Superconference, OSHWA Summit and has given talks on his projects with open source hardware.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Ashwin K Whitchurch",
      "id": 26297,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Omer Cohen - As an experienced Incident Response investigator and team leader, Omer has a wealth of knowledge and experience in the areas of cyber security, security research, software development and system administration, as well as network architecture and design. Omer has delivered and implemented numerous projects involving cutting edge technologies for multiple security related applications in addition to providing accurate and appropriate information security consulting and incident response services to Fortune 500 companies and other leading organization. Omer currently manages Customer Success in EMEA and APAC at Demisto, the leading Security Orchestration, Automation and Response (SOAR) solution provider.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Omer Cohen",
      "id": 26298,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Imri Goldberg - An experienced technical entrepreneur, Imri has significant experience in development, architecture and security. Before joining Cymmetria as VP R&D, Imri was the founder & CTO of Desti, a travel startup that was acquired by Nokia-HERE in 2014. Today Imri serves as the CTO of Cymmetria, heading innovation and research and working on product and architecture. Cymmetria is the leading Cyber Deception vendor with its main product  MazeRunner® used by Fortune 500 companies in multiple verticals including finance, insurance, health, government, retail, etc.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Imri Goldberg",
      "id": 26299,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Vadim Pavlov is passionate about traveling, learning foreign and programming languages, writing scripts/software, integrating solutions, interacting with colleagues and customers to solve complex problems. As a truly lazy person Vadim wants to automate all routine.\n\nVadim has 15+ years of IT experience and last 5 years Vadim spent at Infoblox and became an expert in DNS and DNS Security: did researches, wrote articles, created custom DNS servers, Infoblox's DNS Data Exfiltration(Infiltration) Demo and Security Assessments portals, created integrations with security solutions.\nHe achieved a masters degree with honors in Computer Science (Software Development) from Russia.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Vadim Pavlov",
      "id": 26300,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Steve specializes in crypto and password research. Steve was one of the panelists for the Password Hash Completion. \"I do stuff... sometimes.\" Like PAKE to HSM or finding bugs in Signal Protocol, CryptoCat, Adobe ColdFusion 9's password encryption key generator, and password hashing functions (MySQL323 meet in the middle attack, XSHA1 [Blizzard's old hash function], etc).\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Steve Thomas",
      "id": 26301,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Konark works as a Tech lead with Cliqz GmbH – developing privacy-focused search engine and browser. He works on projects ranging across Privacy by design, Anonymous Data collection like Human Web, Anti-Tracking etc.\n\n\nPrior to Cliqz, Konark was working with one of the largest e-commerce website in India(Makemytrip.com) in data platform and security team, solving interesting challenges related to DWH, BI and data security.\n\n\nHis recent personal projects, in an endeavor to help organizations fix vulnerabilities have spanned across browsers, health trackers, Government services, travel mobile apps etc.\n\n\nKonark has been a speaker and presenter at numerous international conferences.\n\n\n\tBlog: https://medium.com/@konarkmodi",
      "twitter": "@konarkmodi",
      "conference": "DC26",
      "title": "",
      "name": "Konark Modi",
      "id": 26302,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Born and raised in Germany, Lennart founded the Open Source log\nmanagement project Graylog in 2009 and has since then worked with many\norganizations on log management and security-related projects. He has\nan extensive background in software development and architecture.\nThere is a high chance that you will meet Lennart at a LobbyCon\nsomewhere in the country. Once he ran a marathon but was not very\nFast.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Lennart Koopmann",
      "id": 26303,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Efrain is a Director in the Office of the CTO at Symantec Corporation. \nPrior to his Director role, he worked 15 years as a field pre-sales systems engineer. \nEfrain started his digital life on a TRS-80 Color Computer II in the 1980s. Previous to his 15 years at Symantec, he worked in various roles, from pen testing to network and systems administration. His current favorite project is working on the OpenC2 language specification.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Efrain Ortiz",
      "id": 26304,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Nick Sayer has been a software developer for most of his life and has spent the last ten years specializing in his day job on security and cryptography. He recently rediscovered the hardware hobby he abandoned in his teens and has a store on Tindie full of his creations, all of which are open.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Nick Sayer",
      "id": 26305,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "AntFinancial\nZhi Zhou is a security engineer at AntFinancial LightYear Lab, who mainly focus on applied software security, including both mobile and desktop platforms. He’s been working on blackbox assessment, vulnerability exploit and new attack surface discovery. He was a speaker at BlackHat USA 2017.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Zhi Zhou",
      "id": 26306,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Chaitin Tech\nYifeng Zhang is a penetration tester at Chaitin Tech, working in mobile security and financial malware. He has been dedicated to developing security tools to make pen-testing more efficient and effective.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Yifeng Zhang",
      "id": 26307,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ulf Frisk is a hacker/penetration tester working in the Swedish financial sector. Ulf focuses on penetration testing and it-security audits during daytime and low-level security research during nighttime. Ulf takes a special interest in DMA - direct memory access, and has a dark past as a developer.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Ulf Frisk",
      "id": 26308,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Ian Vitek has a background as a pentester but now works with information security in the Swedish financial sector. Ian has held presentations at Defcon 8, 10, 12, BSidesLV and over the last years attended as a Defcon DJ (VJ Q.Alba). Interested in web, layer 2, DMA and pin bypass attacks.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Ian Vitek",
      "id": 26309,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Pavan aka pavanw3b is a Senior Security Engineer at ServiceNow. He is one of the core members of Null security community - Hyderabad chapter. He participates in bug bounty programs in his free time and made it to hall of fames of some companies.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Pavan Mohan",
      "id": 26310,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mike works at the technical end of the cyber security practice and operates broadly on the same basis as an attacker. He has conducted over one hundred penetration tests and audits against a wide variety of systems and targets, combined with activities such as secure code review, reverse engineering and wireless assessment. Mike has worked as a CREST Certified Network Intrusion Analyst and has performed breach assessments in a number of different industry sectors including finance, engineering and government. He has managed and delivered a CVI (Cyber Vulnerability Investigation) for the UK MOD in the first of series of industry-delivered assessments.\n\nHe has provided incident response training at board level in the form of desktop scenarios with red and blue teams engaged in a fictitious cyber-attack. This has proven to be an excellent tool for extracting tactics, forming future strategies, and educating participants.\n\nMike founded a volunteer group in BCS (The Chartered Institute for IT) to introduce IT practitioners to the information security industry and has presented at a government select committee and taken part in numerous senior panels at industry and government events. He has also written articles for well-known industry publications included ITnow, Computer Weekly, InfoSecurity Magazine.\n                           \nPrior to working in information security Mike worked as an application support analyst on a financial trading platform and later an enterprise succession planning system. Before this Mike gained his PhD in Computer Vision at the University of Southampton.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Mike Westmacott",
      "id": 26311,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Caleb is a programmer who enjoys hacking and mathing. He is a member of the Mandiant/FireEye applied research team, where he researches and builds sweet incident response software. Recently, he's mostly been hacking with Python, Jupyter, C, and Machine Learning. Though only recently getting into the security space professionally, Caleb has been into security for a while - in high school, he wrote his own (bad) cryptography and steganography software. In college, he did a good bit of \"informal pen testing\". These days, he has fun doing a lot of Radio/Wireless hacking, and using Machine Learning/Math to do cool security-related things.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Caleb Madrigal",
      "id": 26312,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Daniel Underhay is a Security Consultant working at Aura Information Security. He has presented at Troopers, Black Hat Asia Arsenal, ChCon, OzSecCon, and BSides Wellington. He enjoys all aspects of penetration testing, red teaming and phishing engagements.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Daniel Underhay",
      "id": 26313,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Matthew Daley is a Senior Security Consultant at Aura Information Security. He has presented at Black Hat Asia Arsenal, BSides Wellington, OzSecCon, and OWASP New Zealand. He enjoys vulnerability discovery and exploitation, developing tools to help pentesters in their work, and writing long mailing list disclosures.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Matthew Daley",
      "id": 26314,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Luca is working as Principal Offensive Security Specialist and also actively involved in InfoSec where the main fields of research are: Radio Networks, Reverse Engineering, Hardware Hacking, Antani, Internet of Things and Physical Security. Since 2012 is keeping a closer eye on FSB operations in Baltics, while trying to avoid being poisoned with Polonium or Nervin GAS. His favorite hobbies are Pasta, Grappa and ARP-Spoofing.\n",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Luca Bongiorni",
      "id": 26315,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Besim ALTINOK (@AltnokBesim) is a security enginner at BARIKAT Internet Security. He performs penetration tests on a wide area like web, network and mobile pentesting. His main interests are IoT Pentest and WiFi Security. He wrote a book about WiFi networks: \"Wireless Network Security\". Besim also member of Octosec and Canyoupwnme teams and he supports community thru that teams. Besim was speaker at Blackhat Europe 2017 Arsenal and Blackhat Asia 2018 Arsenal.\n",
      "twitter": "@AltnokBesim",
      "conference": "DC26",
      "title": "",
      "name": "Besim Altinok",
      "id": 26316,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Mehmet Kutlay KOCER (@kutlaykocer) was graduated from TOBB University of Economics and Technology B.S. Computer Engineering in 2016. His Senior Design Project was about VOIP systems in the name \"SIP DDoS Attacks Detection and Prevention\" with the cooperation of TOBB University and NETAS. Currently, he is working as a Penetration Tester in BARIKAT Internet Security for 2 years. He played a major role in conducting Barikat SOC in 2016. Finally Mehmet Kutlay KOCER spoke at Blackhat ASIA 2018 Arsenal\n",
      "twitter": "@kutlaykocer",
      "conference": "DC26",
      "title": "",
      "name": "Mehmet Kutlay Kocer",
      "id": 26317,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "M. Can Kurnaz (@0x43414e) is a penetration tester and currently works at European Network for Cyber Security in Netherlands.\n\nHe is conducting penetration tests over internet, internal networks, web-based applications and Operational Technology infrastructures such as smart meters, RTUs, data concentrators, telecontrol gateways, electric vehicle charging points and various ICS/SCADA systems and components, conducting robustness tests for OT devices and working on physical and wireless security assessments of IT/OT devices.\nAt the same time, he is also contributing as an instructor to \"Red Team – Blue Team Training for Industrial Control Systems and Smart Grid Cyber Security\" training of ENCS.\n",
      "twitter": "@0x43414e",
      "conference": "DC26",
      "title": "",
      "name": "M.Can KURNAZ",
      "id": 26318,
      "updated_at": "2018-07-03T17:46+0000"
    },
    {
      "link": "",
      "description": "Chris is an Android dev from Canada, where he has worked for various tech start-ups. In his spare time, Chris has developed a few Android apps that have a total combined download count of over 1.5 million with an average rating of 4.6. \r\n\r\nHe first attended DEF CON at DEF CON 24, where he was introduced to Whitney Champion, the creator of the Hacker Tracker app. He then decided to join the Hacker Tracker team, and took over the Android version. He has since rebuilt the app from the ground up to be the best schedule app possible, from the database to the UI/UX, he's done everything.\r\n\r\nCurrently, he is in charge of the Android version of the Hacker Tracker app.",
      "twitter": "@_advice_dog",
      "conference": "DC26",
      "title": "Senior Android Developer",
      "name": "Chris Porter",
      "id": 26320,
      "updated_at": "2018-07-30T00:30+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Uncle G.",
      "id": 26325,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "MasterChen",
      "id": 26327,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Soldier of FORTRAN",
      "id": 26328,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Magg",
      "id": 26329,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "William Knowles",
      "id": 26330,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "James Coote",
      "id": 26331,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "RenderMan",
      "id": 26332,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Ethan Gregory Dodge",
      "id": 26333,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": " Laura H",
      "id": 26334,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "\"Brittany 'Straithe' Postnikoff\"",
      "id": 26335,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Sara-Jayne Terp",
      "id": 26336,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Daniel Williams (fbus)",
      "id": 26337,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "wornbt@gmail.com",
      "id": 26338,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Dimitri",
      "id": 26339,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "security panda",
      "id": 26340,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "3ncr1pt3d",
      "id": 26341,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Sidragon",
      "id": 26342,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Xavier Ashe",
      "id": 26343,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Mike Raggo",
      "id": 26344,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Chet Hosmer",
      "id": 26345,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Marcelle",
      "id": 26346,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Kelley",
      "id": 26347,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Amit Elazari",
      "id": 26348,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Keren Elazari",
      "id": 26349,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Shawn Merdinger",
      "id": 26350,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "j3lena",
      "id": 26351,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Philippe Delteil",
      "id": 26352,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "BACE16",
      "id": 26353,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Stumbles The Drunk",
      "id": 26354,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Maggie Mayhem",
      "id": 26355,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "brain",
      "id": 26356,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "9bplus",
      "id": 26357,
      "updated_at": "2018-07-31T21:41+0000"
    },
    {
      "link": "",
      "description": "",
      "twitter": "",
      "conference": "DC26",
      "title": "",
      "name": "Nick Cano",
      "id": 26358,
      "updated_at": "2018-07-31T21:41+0000"
    }
  ]
}