{
  "updated_at": "2018-08-03T00:03+0000",
  "vendors": [
    {
      "id": 1,
      "partner": false,
      "description": "",
      "name": "Attify",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:37+0000"
    },
    {
      "id": 2,
      "partner": false,
      "description": "Stop by and browse the wide selection of security-related books on display this weekend. The latest and greatest books available in the industry also include books authored by Def Con presenters. Check out the wide selection of games available -strategy, card, dice, and deck-building. Buy a game and start playing today.",
      "name": "Breakpoint Books",
      "link": "http://breakpointbooks.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:39+0000"
    },
    {
      "id": 3,
      "partner": false,
      "description": "Capitol Technology University, located in Laurel Maryland, offers degrees in engineering, computer science, cybersecurity, and business. Offering online certificates, bachelor's and master's degrees, which includes a master's in astronautical engineering. As well as doctoral programs in cybersecurity and management and decision sciences. Capitol is regionally accredited by Middle States Association of Colleges.",
      "name": "Capitol Technology University",
      "link": "https://www.captechu.edu/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:39+0000"
    },
    {
      "id": 4,
      "partner": false,
      "description": "",
      "name": "Cloudflare",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:39+0000"
    },
    {
      "id": 5,
      "partner": false,
      "description": "",
      "name": "DarkNet LLC",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:40+0000"
    },
    {
      "id": 6,
      "partner": false,
      "description": "The Electronic Frontier Foundation (EFF) is the leading organization defending civil liberties in the digital world. We defend free speech on the Internet, fight illegal surveillance, support freedom-enhancing technologies, promote the rights of digital innovators, and work to ensure that the rights and freedoms we enjoy are enhanced, rather than eroded, as our use of technology grows. Stop by our table to find out more, pick up some gear, or even support EFF as an official member.",
      "name": "EFF",
      "link": "https://www.eff.org/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:40+0000"
    },
    {
      "id": 7,
      "partner": false,
      "description": "",
      "name": "Freenode",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:40+0000"
    },
    {
      "id": 8,
      "partner": false,
      "description": "Well we're back at it again, and have been working hard all year to bring you the freshest awesome that we can. If you have been to DEF CON, layerone, toorcon, phreaknic, or other conferences we have been at, you definitely know what so of shenanigans we are up to. If you have never seen us, feel free to come by and take a look at what we have to offer.\r\n\r\nAlways fun, always contemporary, GhettoGeeks has some for the tech enthusiast (or if you prefer, hacker)",
      "name": "Ghetto Geeks",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:41+0000"
    },
    {
      "id": 9,
      "partner": false,
      "description": "GUNNAR Optiks is the only patented computer eyewear recommended by doctors to protect and enhance your vision. Our premium computer eyewear defends eyes from the effects of digital eye strain which can include; dry eyes, headaches, blurry vision, eye fatigue, altered Circadian Rhythms, and insomnia. End the pain of DIGITAL EYE STRAIN.",
      "name": "GUNNAR",
      "link": "https://gunnar.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:41+0000"
    },
    {
      "id": 10,
      "partner": false,
      "description": "HackerBoxes is the subscription box service for DIY electronics and hardware hacking. Each monthly HackerBox includes a carefully curated collection of projects, components, modules, tools, supplies, and exclusive items. HackerBox Hackers are electronics hobbyists, makers, hardware hackers, and computer enthusiasts. Many connect through social media channels to create a community of experience, support, and ideas. Let's see what you make with your HackerBoxes.",
      "name": "Hackerboxes",
      "link": "www.hackerboxes.com",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:41+0000"
    },
    {
      "id": 11,
      "partner": false,
      "description": "",
      "name": "Hacker Stickers",
      "link": "https://www.hackerstickers.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:41+0000"
    },
    {
      "id": 12,
      "partner": false,
      "description": "HACKER WAREHOUSE is your one stop shop for hacking equipment. We understand the importance of tools and gear which is why we carry only the highest quality gear from the best brands in the industry. From WiFi Hacking to Hardware Hacking to Lock Picks, we carry equipment that all hackers need. Check us out at HackerWarehouse.com.",
      "name": "HACKER WAREHOUSE",
      "link": "http://hackerwarehouse.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:42+0000"
    },
    {
      "id": 13,
      "partner": false,
      "description": "Hackers for Charity is a non-profit organization that leverages the skills of technologists. We solve technology challenges for various non-profits and provide equipment, job training and computer education to the world's poorest citizens.",
      "name": "Hackers for Charity",
      "link": "http://www.hackersforcharity.org/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:42+0000"
    },
    {
      "id": 14,
      "partner": false,
      "description": "Discover the devices that have found their way into the hearts and tool-kits of the modern hacker. Notable for ease of use. Celebrated by geek culture. From comprehensive WiFi audits to covert network implants and physical access mayhem - Hak5 Gear gets the job done.",
      "name": "Hak5",
      "link": "https://www.hak5.org/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:42+0000"
    },
    {
      "id": 15,
      "partner": false,
      "description": "Did someone say badges? Check out our unique blinky badges and add-ons before they're all gone!",
      "name": "Hardware Zoo",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:42+0000"
    },
    {
      "id": 16,
      "partner": false,
      "description": "Healthy Mentals offers nootropics and other supplements.",
      "name": "Healthy Mentals",
      "link": "https://healthymentals.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:43+0000"
    },
    {
      "id": 17,
      "partner": false,
      "description": "Human Rights Foundation (HRF) is a nonpartisan nonprofit organization that promotes and protects human rights globally, with a focus on closed societies. HRF unites people in the common cause of defending human rights and promoting liberal democracy. Its mission is to ensure that freedom is both preserved and promoted around the world.",
      "name": "Human Rights Foundation",
      "link": "https://www.hrf.org/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:43+0000"
    },
    {
      "id": 18,
      "partner": false,
      "description": "Keyport® combines keys, pocket tools, & smart tech into one everyday multi-tool. This year we are bringing our brand new modular product line including the Keyport Slide 3.0 & Keyport Pivot (holds your existing keys), along with our new tech & tool modules which includes a Pocketknife, Bluetooth Locator, and Mini-Flashlight. Sign up for our new Maker Program and design/hack/build you're own compatible Keyport modules. Don't forget to bring your keys to the vendor area!",
      "name": "Keyport®",
      "link": "https://www.mykeyport.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:43+0000"
    },
    {
      "id": 19,
      "partner": false,
      "description": "",
      "name": "Kinkayo",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:44+0000"
    },
    {
      "id": 20,
      "partner": false,
      "description": "",
      "name": "Malicious Life Podcast",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:44+0000"
    },
    {
      "id": 21,
      "partner": false,
      "description": "Thanks to you, we've been publishing books for hackers since 1994. Our titles have personality, our authors are passionate, and our books tackle topics that people care about. We read and edit everything we publish%u2014titles like Gray Hat C#, Hacking: The Art of Exploitation, Automate the Boring Stuff with Python, Python Crash Course, The Hardware Hacker, and more. This year we're excited to release the PoC||GTFO bible; complete with a leatherette cover, ribbon bookmark, and gilded pages. It's packed with missives from your favorite hackers. Everything in our booth is at least 30% off and all print purchases include DRM-free ebooks. We've got new swag and early access print editions of forthcoming titles like Serious Cryptography, Attacking Network Protocols, and Rootkits and Bootkits.",
      "name": "No Starch Press",
      "link": "https://www.nostarch.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:44+0000"
    },
    {
      "id": 22,
      "partner": false,
      "description": "OWASP is the thriving global community that drives visibility and evolution in the safety and security of the world's software. We are run by rough consensus & running code. Our community supports hackers, developers, and defenders in the security industry.",
      "name": "OWASP",
      "link": "https://www.owasp.org/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:44+0000"
    },
    {
      "id": 23,
      "partner": false,
      "description": "Nuand develops Software Defined Radio (SDR) platforms for students, hobbyists, and professionals. Their main offering, the bladeRF, is a versatile USB 3.0 device that provides a 300 MHz to 3.8 GHz tuning range, full duplex operation, 12-bit samples at up to 40 MSPS, and an instantaneous bandwidth up to 28 MHz. This device has found a home in application domains including GSM and LTE base stations, digital television, GPS simulation, medical imaging research, and wireless security. Check out their booth to see demos and learn more!",
      "name": "Nuand",
      "link": "https://www.nuand.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:44+0000"
    },
    {
      "id": 24,
      "partner": false,
      "description": "Rapid7 cybersecurity analytics software and services reduce threat exposure and detect compromise for 4,150 organizations, including 34% of the Fortune 1000. From the endpoint to cloud, we provide comprehensive real-time data collection, advanced correlation, and unique insight into attacker techniques to fix critical vulnerabilities, stop attacks, and advance security programs.",
      "name": "Rapid7",
      "link": "https://www.rapid7.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:44+0000"
    },
    {
      "id": 25,
      "partner": false,
      "description": "Scam Stuff is gear for the modern rogue: magic tricks, lockpicking, puzzle boxes, clever novelty items, spy gear, and more! if it's designed to get you ahead, you'll find it here.",
      "name": "Scam Stuff",
      "link": "http://scamstuff.com",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:45+0000"
    },
    {
      "id": 26,
      "partner": false,
      "description": "Security Snobs offers High Security Mechanical Locks and Physical Security Products including door locks, padlocks, cutaways, security devices, and more. We feature the latest in security items including top brands like Abloy, BiLock, EVVA, KeyPort, Mobeye, Anchor Las, and Sargent and Greenleaf. Visit https://SecuritySnobs.com for our complete range of products. Stop by to see the new and coming soon products in high security and con specials!",
      "name": "Security Snobs",
      "link": "https://securitysnobs.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:45+0000"
    },
    {
      "id": 27,
      "partner": false,
      "description": "",
      "name": "Security Weekly",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:45+0000"
    },
    {
      "id": 28,
      "partner": false,
      "description": "With the largest selection of lock picks, covert entry and SERE tools available at DEF CON it¹s guaranteed we will have gear you have not seen before. New tools and classics will be on display and available for sale in a hands on environment. Our Product range covers Custom Titanium toolsets, Entry Tools, Practice locks, Bypass tools, Urban Escape & Evasion hardware and items that until recently were sales restricted. SPARROWS LOCK PICKS and TOOLS will be displaying a full range of gear including their newly released Core Shims., Sandman and Lock Outs. The WOLF will also be available to the public for the first time in limited quantities. All products will be demonstrated at various times and can be personally tested for use and efficacy.",
      "name": "SerePick",
      "link": "http://www.serepick.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:45+0000"
    },
    {
      "id": 29,
      "partner": false,
      "description": "",
      "name": "Sewashree",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:45+0000"
    },
    {
      "id": 30,
      "partner": false,
      "description": "Shadowvex Industries (SVX) - more than 20 years of pouring blood, sweat & gears into hacker-relevant, limited edition clothing, DJ mixes, stickers, buttons, art prints and more. Miss DJ Jackalope, aka DEFCON's resident DJ mixtress, has been teaming up with us for more than a decade with her own DJ mixes and awesome swag. Follow the music in the vending area to find our booth! If you want to bring home your piece of DEFCON history, you need to get here early - our year-specific designs are only available @DEFCON and only while supplies last!",
      "name": "Shadowvex Industries",
      "link": "https://shadowvexindustries.com/",
      "conference": "DC26",
      "updated_at": "2018-08-03T00:03+0000"
    },
    {
      "id": 31,
      "partner": false,
      "description": "For PenTesting and unwired Internet Security Specialists: Wireless, WiFi antennas, cables, connectors, USB and Ethernet wireless high power cards and devices, other interesting goodies to be seen only at the table! And new design T-shirts.",
      "name": "Simple Wifi",
      "link": "https://www.simplewifi.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:46+0000"
    },
    {
      "id": 32,
      "partner": false,
      "description": "",
      "name": "TENCENT",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:46+0000"
    },
    {
      "id": 33,
      "partner": false,
      "description": "",
      "name": "The Calyx Institute",
      "link": "",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:46+0000"
    },
    {
      "id": 34,
      "partner": false,
      "description": "The Open Organisation Of Lockpickers is back as always, offering a wide selection of tasty lock goodies for both the novice and master lockpicker! A variety of commercial picks, handmade picks, custom designs, practice locks, handcuffs, cutaways, and other neat tools will be available for your perusing and enjoyment! Stop by our table for interactive demos of this fine lockpicking gear or just to pick up a T-shirt and show your support for locksport.\r\n\r\nAll sales exclusively benefit TOOOL, a 501(c)3 non-profit organization. You can purchase picks from many fine vendors, but ours is the only table where you know that 100% of your money goes directly back to the hacker community.",
      "name": "TOOOL",
      "link": "http://toool.us/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:46+0000"
    },
    {
      "id": 35,
      "partner": false,
      "description": "The University of Advancing Technology (UAT) is a private university located in Tempe, Arizona, offering academic degrees focused on new and emerging technology disciplines. UAT offers a robust suite of regionally accredited graduate and undergraduate courses ranging from Computer Science and Information Security to Gaming and New Media. UAT has been designated as a Center for Academic Excellence in Information Systems Security Education by the US National Security Agency. Programs are available online and on-campus.",
      "name": "UAT",
      "link": "http://www.uat.edu/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:46+0000"
    },
    {
      "id": 36,
      "partner": false,
      "description": "360 Security Research Innovation Alliance consists of many teams, UnicornTeam, RocTeam and PegasusTeam are among them, each team boosts many brilliant researchers in their corresponding field of focus.\r\n\r\nUnicornTeam is focusing on wireless security they assess the security of anything that uses radio technologies, from small things like RFID, NFC and WSN to big things like GPS, UAV, Smart Cars, Telecom and SATCOM. They have presented their researches at premier security conferences like Blackhat, DEFCON, HITB, CanSecWest, RuxCon, POC, SyScan360 etc.\r\n\r\nRocTeam is focusing on hardware security research and the R&D of hardwares that can be used for defensive and offensive purposes, they built many hardware security gadgets.\r\n\r\nPegasusTeam is focusing on wireless intrusion prevention, wireless threat sensing and wireless penetration test. They have designed and built 'MianYangQiang' to demonstrate the threats of public WIFI, wireless honeypot, wireless intrusion prevention system '360TianXun' which have been widely deployed city wide and in enterprises.",
      "name": "360 Unicorn Team",
      "link": "http://unicorn.360.cn/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:47+0000"
    },
    {
      "id": 37,
      "partner": false,
      "description": "Women in Security and Privacy (WISP) is a fiscally sponsored non-profit project of Community Initiatives (501(c)(3)). WISP advances women to lead the future of security and privacy. We believe that empowerment requires the inclusion of all women, with expertise in both security and privacy. Our work includes education, mentoring & networking, career advancement, leadership, and research. To learn more, visit us at https://www.wisporg.com.",
      "name": "WISP",
      "link": "https://www.wisporg.com/",
      "conference": "DC26",
      "updated_at": "2018-07-25T20:47+0000"
    }
  ]
}