{
  "updated_at": "2018-08-31T18:18+0000",
  "schedule": [
    {
      "includes": "",
      "speakers": [
        28050
      ],
      "start_date": "2018-09-16T19:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28034,
      "location": 28001,
      "title": "Finding secrets in source code with TruffleHog",
      "end_date": "2018-09-16T19:50+0000",
      "event_type": 28002,
      "description": "Developers frequently commit secrets to source code, and sometimes push secrets to package managers. These secrets often leak out into the public either through accidental source code disclosure, or intentional source code disclosure. TruffleHog is a tool I wrote to help identify if any secrets live in source code, or package managers. It goes through old history to find secrets that may have been buried.\r\n\r\nI also recently released a new tool called SantaHog, that goes through packages in package managers and does the same.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28079
      ],
      "start_date": "2018-09-16T23:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28091,
      "location": 28001,
      "title": "An Inconvenient Truth",
      "end_date": "2018-09-16T23:20+0000",
      "event_type": 28002,
      "description": "The ransomware protection in Windows 10 is useless",
      "link": "https://www.slideshare.net/secret/fMYeKxw5M4BL5M",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28075
      ],
      "start_date": "2018-09-15T21:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28092,
      "location": 28001,
      "title": "Dissection of WebAssembly module",
      "end_date": "2018-09-15T21:50+0000",
      "event_type": 28002,
      "description": "WebAssembly (WASM) is a new binary format currently developed by all major browsers including Firefox, Chrome, WebKit /Safari and Microsoft Edge. In this talk, I will introduce WebAssembly concepts, detailed security measures implemented into WebAssembly VM and explain how to do static analysis (Reversing, Control flow and Calls flow analysis, …) on real life WASM modules.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28082
      ],
      "start_date": "2018-09-16T00:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28093,
      "location": 28001,
      "title": "Integrated security testing",
      "end_date": "2018-09-16T00:50+0000",
      "event_type": 28002,
      "description": "Having a scalable suite of continuously run security tests seems out of reach for all but the most mature security programs. Yet, many companies already have integration tests that snake their way deeply into their web application, covering nearly every workflow. In this talk, we will use a minimal amount of work to transform these integration tests into a suite of security tests to find subtle security bugs in authorization and business logic along side the standard web application bugs like XSS and SQLi.",
      "link": "https://github.com/distrustCaution/integrated-security-example",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28077
      ],
      "start_date": "2018-09-15T22:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28094,
      "location": 28002,
      "title": "Ransomware versus Cryptojacking: Latest Trends in Modern Malware",
      "end_date": "2018-09-15T22:50+0000",
      "event_type": 28002,
      "description": "Ransomware and cryptojacking have been recognized as the top malware threats in 2018. Financially motivated cybercriminals are attracted to both since both remain viable means of generating illicit income. In this talk, we delve deep into the latest characteristics observed in ransomware and cryptojacking attacks. Modern ransomware go beyond mere data encryption and come bundled with other threats, while cryptojacking attacks exploit unsuspecting web users by deploying embedded JavaScript miners concealed in websites. We discuss the intricate characteristics of sophisticated modern ransomware variants, cryptojacking attacks, and the results of our web crawl identifying websites involved in cryptojacking. Finally, we compare ransomware and cryptojacking in terms of their potential to generate illicit income for cybercriminals versus the levels of sophistication required to implement their respective campaigns.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28083
      ],
      "start_date": "2018-09-16T00:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28095,
      "location": 28002,
      "title": "Following a Trail of Confusion",
      "end_date": "2018-09-16T00:50+0000",
      "event_type": 28002,
      "description": "Modern malware uses a wide variety of code obfuscation techniques to hide it’s true intentions and to avoid detection. In this talk, we’ll explore the latest in native code obfuscation techniques as well as a few techniques commonly used with interpreted languages. We will spend time discussing such methods as dynamically constructing import tables, hiding and using shellcode, packing, string obfuscation, use of virtual machines and other anti-analysis techniques. We’ll dig deep into the techniques by examining a wide variety of malware, including those used by nation-states. By the end of this talk you’ll have a technical understanding of how they work and how to defeat them!",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28084,
        28086
      ],
      "start_date": "2018-09-15T22:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28096,
      "location": 28001,
      "title": "Infecting the Embedded Supply Chain",
      "end_date": "2018-09-15T22:50+0000",
      "event_type": 28002,
      "description": "With a surge in the production of internet of things (IoT) devices, embedded development tools are becoming commonplace and the software they run on is often trusted to run in escalated modes. However, some of the embedded development tools on the market contain serious vulnerabilities that put users at risk. In this talk we discuss the various attack vectors that these embedded development tools expose users to, and why users should not blindly trust their tools. This talk will detail a variety reverse engineering, fuzzing, exploit development and protocol analysis techniques that we used to analyze and exploit the security of a common embedded debugger.  ",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28075
      ],
      "start_date": "2018-09-15T22:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28097,
      "location": 28004,
      "title": "Reversing Ethereum Smart Contracts",
      "end_date": "2018-09-15T23:00+0000",
      "event_type": 28002,
      "description": "Ethereum is currently the reference of smart contract platform due to the possibility to create decentralized applications (Dapps) using smart contracts. When you create a smart contract on the blockchain, it's not mandatory to provide the Solidity source code and that's why be able to reverse and analyze Ethereum smart contract (only with the EVM bytecode) make even more sense.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28087
      ],
      "start_date": "2018-09-15T23:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28098,
      "location": 28002,
      "title": "Anatomy of ICS Disruptive Attacks",
      "end_date": "2018-09-15T23:50+0000",
      "event_type": 28002,
      "description": "ICS attacks are increasingly in the spotlight, yet significant misconceptions exist as to how these attacks are executed. Most research, presentations, and news items focus on the final element of what are prolonged, multi-step attacks: the final disruptive ICS malware. A better, more complete understanding of such attacks embraces the entire attack sequence – from initial intrusion through ICS compromise to final attack delivery – to identify multiple methods for gaining access to critical network resources, and multiple places to stop such attacks in their tracks. This discussion will take the two most-recent, high-profile ICS disruptive events – CRASHOVERRIDE and TRISIS – and examine how these represent the culmination of adversary actions, with multiple potential points for detection and mitigation, rather than a sudden “bolt from the blue” against which defenders have no recourse. In making this presentation, attendees will emerge with a better understanding of what is required to execute an ICS attack, from start to finish, as well as a greater appreciation for what defenders can do to halt such efforts.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28080
      ],
      "start_date": "2018-09-17T01:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28099,
      "location": 28001,
      "title": "Introducing InfoconDB.org - IMDB For Hacker Cons",
      "end_date": "2018-09-17T01:20+0000",
      "event_type": 28002,
      "description": "This talk will introduce https://InfoconDB.org - a site that aims to catalog and cross-reference all hacker conferences, similar to what IMDB does for TV/movies. We'll look at what the site catalogs and expose some interesting discoveries. For instance, there are some extremely prolific presenters that aren't the characters you'd expect and a handful of presenters who've been at it for more than 20 years! We'll talk about what goes into trying to digitize and normalize data from over 30 years of cons, and how both bitrot and hackers don't always make that job easy. Finally, the audience can help with suggestions to make the site a great resource for all hacker conference fans, attendees, speakers, and organizers.",
      "link": "https://InfoconDB.org",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28089
      ],
      "start_date": "2018-09-14T21:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28101,
      "location": 28003,
      "title": "Digital Forensics is not just for incident response anymore",
      "end_date": "2018-09-14T22:45+0000",
      "event_type": 28002,
      "description": "Experienced InfoSec professionals are familiar with leveraging digital forensics in their incident response efforts. There are other opportunities to let the data tell the story, provide insight on risks your organization face, with how to mitigate those risks. What are these opportunities, how can you leverage forensics for these opportunities, & how do you acquire such capabilities?\r\n",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28090
      ],
      "start_date": "2018-09-15T19:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28102,
      "location": 28002,
      "title": "IoT Botnets : The Crux of \"Internet of Things\" Chaos !",
      "end_date": "2018-09-15T19:50+0000",
      "event_type": 28002,
      "description": "IoT botnets are deployed heavily to perform nefarious activities by circumventing the integrity of the IoT device to launch sophisticated targeted or broad-based attacks. IoT botnets have enhanced the cybercrime operations to a great extent, thereby making it easier for the attackers to carry out unauthorized activities on the Internet. In this talk, Aditya will perform an empirical analysis to conduct a characteristic study of IoT botnets to understand the inherent design, architecture, and associated operations. Code samples will be dissected to highlight the inherent nefarious operations performed by the IoT bots. The study covers analysis of multiple IoT botnet families.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28091
      ],
      "start_date": "2018-09-15T21:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28103,
      "location": 28002,
      "title": "Yet Another IoT Hack",
      "end_date": "2018-09-15T21:50+0000",
      "event_type": 28002,
      "description": "Security and the Internet of Things (IoT) are commonly discussed, though rarely in a positive light. In 2018, the state of security in embedded devices appears to be a continuation of this trend, according to research performed by Independent Security Evaluators (ISE). As part of our research, we have looked at a variety of devices aimed at the professional consumer and small business market including the TerraMaster F2-420 Network Attached Storage (NAS). In the F2-420, we found several glaring vulnerabilities, including some that allow remote attackers to gain root access without any authentication. In the course of a few days, ISE obtained 24 CVEs for vulnerabilities we discovered in the TerraMaster F2-420. This presentation will cover some of the issues affecting the NAS, and provide sample attack workflows for compromising a network-accessible F2-420. More importantly, it will describe a methodology for finding vulnerabilities in embedded devices by examining all available attack surfaces.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28088
      ],
      "start_date": "2018-09-16T22:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28104,
      "location": 28002,
      "title": "Shining a light on a black box: Reverse engineering proprietary protocols in Embedded devices",
      "end_date": "2018-09-16T22:50+0000",
      "event_type": 28002,
      "description": "IoT devices often present unique and unexpected challenges for hackers to overcome. \r\nIn this talk, we provide an in-depth walk-through of how we broke custom solutions and built exploits to remotely control the targeted device as a root user. The challenge involves reverse engineering a proprietary protocol used to issue commands and receive data to and from the targeted Network Attached Storage NAS device. ",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28093
      ],
      "start_date": "2018-09-16T18:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28105,
      "location": 28002,
      "title": "From FAR and NEAR:  Exploiting Overflows on Windows 3.x",
      "end_date": "2018-09-16T18:50+0000",
      "event_type": 28002,
      "description": "This talk covers finding a buffer overflow vulnerability in some old Windows 3.x-based Internet software and constructing a payload to exploit it. The segmented memory model of 16-bit x86 code complicates exploitation and provides accidental defenses similar to ASLR and DEP. I walk through finding the exploit, developing a ROP chain and shellcode, culminating in the calculator.",
      "link": "https://www.securityevaluators.com/wp-content/uploads/2017/07/16buffer.pdf",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-17T01:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28107,
      "location": 28002,
      "title": "It will kill or harm you and it's in you or your home",
      "end_date": "2018-09-17T01:35+0000",
      "event_type": 28002,
      "description": "Exploding light bulbs? Yup. How safe is IOT? Can your speakers make you go blind temporarily and vomit? Yup. This talk focuses only on things that can harm or kill you. ",
      "link": "criticalcon.com",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28099
      ],
      "start_date": "2018-09-16T23:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28108,
      "location": 28002,
      "title": "Bug Bounty Hunting on Steroids",
      "end_date": "2018-09-16T23:50+0000",
      "event_type": 28002,
      "description": "Bug bounty programs are a hot topic these days. More and more companies are realizing the benefits of running a program, and researchers are jumping at the opportunity to grab some swag and make some extra cash from the bugs they find. Reporting security issues has never been as easy, open, and risk-free as it is right now. Everybody wins!\r\n\r\nThough that doesn’t mean we should stop there. As researchers, we spend a lot of time doing the same menial tasks for each program: monitoring for new targets, checking for common issues, remembering just which flags you needed to pass to that tool (or even which tool is best for that job). We build new tools, hack together shell scripts, and generally make small incremental changes to our process. But surely there’s a better approach?\r\n\r\nAre you sick of repeating the same tedious tasks over and over? Wouldn’t it be nice to have your own bug hunting machine? One that -\r\n* Is always watching\r\n* Reacts as soon as a new target becomes available\r\n* Takes care of those tedious repetitive steps for you\r\n* Makes life easy when you want to integrate a new tool/workflow\r\n* Doesn’t cost the world to run, and trivially scales\r\n* Leverages lessons and technologies battle tested in the dev world to improve your offensive capacity, capability and productivity\r\n* Monitors your own infrastructure and reacts before hackers can (while saving you the cost of those Bug Bounty payouts in the meantime)\r\n \r\nWe call this approach Bug Bounty Hunting on Steroids. We will discuss our research and approach to building such a machine, sharing some of the lessons we learned along the way.\r\n",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28100
      ],
      "start_date": "2018-09-14T16:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28109,
      "location": 28003,
      "title": "Threat Hunting with Network Forensics",
      "end_date": "2018-09-14T17:15+0000",
      "event_type": 28002,
      "description": "This presentation looks at TCP/UDP network traffic and protocols to identify what information can be of great value when either detecting a threat or responding to an alert.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28085
      ],
      "start_date": "2018-09-17T00:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28110,
      "location": 28001,
      "title": "Electron Harmony",
      "end_date": "2018-09-17T00:20+0000",
      "event_type": 28002,
      "description": "A good schematic should flow like a well written manuscript or a piece of music. Learn how to orchestrate your ideas onto the page like an electrical composer. Be careful with this knowledge, as you will begin to see poorly drawn schematics everywhere. EVERYWHERE! This talk covers information flow, standard drawing convention and the finer points of communicating your electrical idea. ",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28094
      ],
      "start_date": "2018-09-17T00:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28111,
      "location": 28002,
      "title": "Hiring Security",
      "end_date": "2018-09-17T00:20+0000",
      "event_type": 28002,
      "description": "Nothing impacts your security program as much as who you hire into it. Using Coinbase as an example, we'll talk through how we enabled a massive push to the left with our security hiring.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28102
      ],
      "start_date": "2018-09-15T19:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28112,
      "location": 28001,
      "title": "Symbolic Computing, Moving On Up.",
      "end_date": "2018-09-15T19:50+0000",
      "event_type": 28002,
      "description": "This talk presents real world application of solvers for checking code, as well as some discussion about tools that can be used and the history of symbolic execution.\r\n\r\n",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28104,
        28105
      ],
      "start_date": "2018-09-16T20:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28113,
      "location": 28002,
      "title": "If You Give a Container a Capability: A Tale of Container Exploitation",
      "end_date": "2018-09-16T20:50+0000",
      "event_type": 28002,
      "description": "This talk walks through mechanisms used by container solutions to create an \"isolated\" computation environment and the weaknesses of each mechanism. It also covers a basic testing methodology that can be used when assessing a new container environment and the release of a new tool to assist in such an assessment.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28004
      ],
      "start_date": "2018-09-15T23:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28114,
      "location": 28001,
      "title": "Goldilocks and the three ATM attacks",
      "end_date": "2018-09-15T23:50+0000",
      "event_type": 28002,
      "description": "Automated Teller Machines (ATM) attacks are more sophisticated than ever before.  Criminals have upped their game, compromising and manipulating ATM networks, software and other connected infrastructure. Between having a third-party manage these machines, and ATMs deployed on low-bandwidth links, it’s an inevitable wild-west environment. In this talk I will review three case studies of ATM attacks, showing how they have become more dangerous than ever before.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28111,
        28117
      ],
      "start_date": "2018-09-16T20:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28115,
      "location": 28001,
      "title": "Unikernel Apocalypse",
      "end_date": "2018-09-16T20:50+0000",
      "event_type": 28002,
      "description": "\"Unikernels\" are specialized, single-address-space machine images that run entirely in ring 0 as a guest VM atop a hypervisor. They typically bundle application code and a framework platform on top of a thin hypercall-based IO/IPC layer used to perform IO. Typically famous for double (and sometimes single) digit millisecond boot times, Unikernels are a product of security nihilism taken to its logical extreme. Unikernel developers consider most extant software stacks insecure and have taken it upon themselves to throw everything away and reinvent the _entire_ programming and system stack anew. During this talk, we will present our research on unikernel security standings, including our methodology for assessing their implementations of memory hardening techniques. We will also present several attacks against unikernels, with live demonstrations, and suggest mitigation strategies for the weaknesses discovered.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28113
      ],
      "start_date": "2018-09-16T22:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28116,
      "location": 28001,
      "title": "You’re Not Alone in Your Hotel Room",
      "end_date": "2018-09-16T22:20+0000",
      "event_type": 28002,
      "description": "Staying in a hotel can bring numerous privacy concerns. Shared WiFI, housekeeping with access to your room, weak physical security, and now security checks if you opt-out of maid service. Ever come back to your room and get the feeling your stuff has been moved?  Was it housekeeping or someone spying on you? This talk will discuss privacy concerns along with ways to maintain confidentiality while staying in a hotel or AirBNB. Without bringing a bug-out bag or spending loads of money on spy equipment, learn how to use inexpensive and free tools found around you to detect and prevent breaches of your privacy while staying away from home. If you’ve ever stayed at a hotel this talk is for you. Maintain privacy the next time you travel.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28113
      ],
      "start_date": "2018-09-16T22:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28117,
      "location": 28001,
      "title": "My Little AWS IR Sandbox",
      "end_date": "2018-09-16T22:50+0000",
      "event_type": 28002,
      "description": "A well-tuned security awareness program will fill up your team’s inbox with malware, phishing, and incident reports needing your immediate attention. With additional security tasks and multiple hats, you need to quickly analyze the malicious content delivered to the user’s inbox to triage the threat. Handling live malware is fun, but it’s also like handling a loaded bazooka. One misstep could get you fired (pun intended). This talk will discuss considerations, safety, tips, and steps to build your own Incident Response (IR) AWS sandbox used to quickly analyze malicious content without sacrificing production systems and networks.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28113
      ],
      "start_date": "2018-09-14T17:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28118,
      "location": 28003,
      "title": "Shooting Puny Phish in a Barrel",
      "end_date": "2018-09-14T18:45+0000",
      "event_type": 28002,
      "description": "With millions of phishing Emails caught be spam filters and users properly trained by well-defined cybersecurity programs, it’s getting harder and harder to properly phish users. Spear phishers must come up with new and improved methods for increasing success. Typosquatting, doppelganger domains, and IDN homograph attacks will be explored and demonstrated during this presentation. Most fully patched modern browsers and Email systems are susceptible to these attacks. This talk will discuss the problem and how to avoid falling victim to some of the best recently discovered domain named based attacks designed to inject malware and steal your passwords.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28112
      ],
      "start_date": "2018-09-14T23:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28120,
      "location": 28003,
      "title": "Hacking and Hardening Kubernetes",
      "end_date": "2018-09-15T00:15+0000",
      "event_type": 28002,
      "description": "The number of companies moving to a microservices model appears to be increasing at an exponential rate, causing a similarly accelerating rate of adoption for Kubernetes.  Machine learning work has contributed to this as well.  It is time for the information security specialists to learn how to attack Kubernetes clusters, as well as defend them.  In this talk, we will demonstrate attacks on Kubernetes clusters, discuss defenses, then demonstrate how those defenses break the attacks. Come begin your training in Kubernetes attack and defense!",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28114
      ],
      "start_date": "2018-09-16T18:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28121,
      "location": 28001,
      "title": "From Chaos to Bliss: How We Solved Security in Just 20 Years",
      "end_date": "2018-09-16T18:50+0000",
      "event_type": 28002,
      "description": "20 years ago Win95 was dominant, security meant AV and firewalls, cDc released BO2k, the Melissa virus was kind of a big deal, The Matrix was in theaters, Mitnick went to prison, and we feared Y2K. Today Android is #1, AI and ML are solving all our problems, new tools are rampant, cryptojacking is king, we binge watch Netflix, Marcus Hutchins awaits prosecution, and election hacking is a hot topic. Take a trip back in time to reminisce about the good, the bad, and the ugly, learn some things you didn't know, and get my take on it all.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28101
      ],
      "start_date": "2018-09-16T19:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28122,
      "location": 28002,
      "title": "Avoiding default passwords and secrets breaches using open source",
      "end_date": "2018-09-16T19:50+0000",
      "event_type": 28002,
      "description": "This talk covers the fundamental problem of handling secrets (e.g., passwords, API tokens, private keys) in open source code repositories and shared access to distributed systems.  If adopted, these techniques can not only help minimize the “default password” problem and make it easier to handle “break glass” emergencies when secrets leak, but can even contribute to a low-cost technical solution to some of the social engineering (phishing) attacks on campaigns witnessed in the 2016 (and still occurring in the 2018) election cycle.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28106
      ],
      "start_date": "2018-09-14T20:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28123,
      "location": 28003,
      "title": "Cheating at AppSec",
      "end_date": "2018-09-14T21:15+0000",
      "event_type": 28002,
      "description": "DevSecOps is becoming the rule not the exception.  Right?  Applying the \"rule\" backwards can prove this wrong.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28106
      ],
      "start_date": "2018-09-16T23:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28126,
      "location": 28002,
      "title": "Ridiculous Router",
      "end_date": "2018-09-16T23:20+0000",
      "event_type": 28002,
      "description": "OpenWRT is stable on many cheap platforms.  It does so many things.  The power provided by modern embedded device can sometimes give commercial hardware a run for its money, especially in the SoHo environment.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28106
      ],
      "start_date": "2018-09-17T00:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28127,
      "location": 28001,
      "title": "UEFI is Scary",
      "end_date": "2018-09-17T00:50+0000",
      "event_type": 28002,
      "description": "UEFI is borked.  This is nothing new.  But the tools are making it easier to mess with.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28115
      ],
      "start_date": "2018-09-16T23:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28128,
      "location": 28001,
      "title": "Smart Contract Honeypots for Profit (and probably Fun)",
      "end_date": "2018-09-16T23:50+0000",
      "event_type": 28002,
      "description": "Ethereum smart contracts have bugs: a lot of them. So many, in fact, that attackers have flocked to exploit them, but occasionally they lose money themselves. Malicious contracts that look vulnerable but are exploitative are a rising trend, and this talk will discuss how they work and what they do.",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-15T18:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28129,
      "location": 28001,
      "title": "KEYNOTE: The Enemy Within",
      "end_date": "2018-09-15T18:50+0000",
      "event_type": 28002,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-15T16:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28130,
      "location": 28004,
      "title": "Registration",
      "end_date": "2018-09-15T17:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-15T17:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28131,
      "location": 28001,
      "title": "Opening Remarks",
      "end_date": "2018-09-15T17:50+0000",
      "event_type": 28002,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-15T20:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28132,
      "location": 28004,
      "title": "Lunch Break",
      "end_date": "2018-09-15T21:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-16T04:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28133,
      "location": 28004,
      "title": "Dinner Break",
      "end_date": "2018-09-16T05:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-16T05:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28134,
      "location": 28004,
      "title": "Saturday Night Party",
      "end_date": "2018-09-16T09:00+0000",
      "event_type": 28003,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-16T21:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28135,
      "location": 28004,
      "title": "Lunch Break",
      "end_date": "2018-09-16T22:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-17T02:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28136,
      "location": 28004,
      "title": "Dinner Break",
      "end_date": "2018-09-17T04:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-17T04:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28137,
      "location": 28004,
      "title": "ToorCon After Party",
      "end_date": "2018-09-17T05:00+0000",
      "event_type": 28003,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-17T01:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28138,
      "location": 28001,
      "title": "Closing Remarks",
      "end_date": "2018-09-17T01:50+0000",
      "event_type": 28002,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28001,
        28050
      ],
      "start_date": "2018-09-16T22:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28139,
      "location": 28002,
      "title": "Lost and Found Certificates: dealing with residual certificates for pre-owned domains",
      "end_date": "2018-09-16T22:20+0000",
      "event_type": 28002,
      "description": "When purchasing a new domain name you would expect that you are the only one who can obtain a valid SSL certificate for it, however that is not always the case. When the domain had a prior owner(s), even several years prior, they may still possess a valid SSL certificate for it and there is very little you can do about it.\r\n\r\nUsing Certificate Transparency, we examined millions of domains and certificates and found thousands of examples where the previous owner for a domain still possessed a valid SSL certificate for the domain long after it changed ownership. We will review the results from our ongoing large scale quantitative analysis over past and current domains and certificates. We’ll explore the massive scale of the problem, what we can do about it, how you can protect yourself, and a proposed process change to make this less of a problem going forwards.\r\n\r\nWe end by introducing BygoneSSL, a new class of vulnerability where prior domain owners may be able to perform a SSL Man in the Middle, and might even be able to revoke your shared certificates potentially causing Denial of Service. We will demonstrate how widespread the issue is, show domain owners how they can determine if they are affected, and how to protect themselves.\r\n",
      "link": "https://insecure.design/",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-16T02:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28140,
      "location": 28001,
      "title": "Hacker Jeopardy",
      "end_date": "2018-09-16T04:00+0000",
      "event_type": 28002,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-14T15:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28141,
      "location": 28003,
      "title": "Registration & Breakfast",
      "end_date": "2018-09-14T16:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-14T19:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28142,
      "location": 28003,
      "title": "Lunch Break",
      "end_date": "2018-09-14T20:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-15T00:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28143,
      "location": 28003,
      "title": "Dinner Break",
      "end_date": "2018-09-15T02:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-15T02:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28144,
      "location": 28004,
      "title": "Registration & Reception",
      "end_date": "2018-09-15T04:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [],
      "start_date": "2018-09-16T01:00+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28145,
      "location": 28004,
      "title": "Dinner Break",
      "end_date": "2018-09-16T02:00+0000",
      "event_type": 28001,
      "description": "",
      "link": "",
      "conference": "TC20"
    },
    {
      "includes": "",
      "speakers": [
        28116
      ],
      "start_date": "2018-09-17T00:30+0000",
      "updated_at": "2018-08-31T18:18+0000",
      "id": 28146,
      "location": 28002,
      "title": "Defeating ML",
      "end_date": "2018-09-17T00:50+0000",
      "event_type": 28002,
      "description": "",
      "link": "",
      "conference": "TC20"
    }
  ]
}