{
  "updated_at": "2018-09-29T01:18+0000",
  "schedule": [
    {
      "title": "Registration",
      "end_date": "2018-09-29T16:00+0000",
      "id": 30201,
      "location": null,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T15:00+0000",
      "event_type": 30203,
      "updated_at": "2018-09-26T01:18+0000"
    },
    {
      "title": "Registration",
      "end_date": "2018-09-29T16:00+0000",
      "id": 30202,
      "location": null,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T15:00+0000",
      "event_type": 30203,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Opening Remarks",
      "end_date": "2018-09-28T16:30+0000",
      "id": 30203,
      "location": 30201,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T16:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Augmenting Penetration Testing with Lightweight Static Analysis",
      "end_date": "2018-09-28T23:50+0000",
      "id": 30204,
      "location": 30202,
      "description": "Prerequisites:- Laptop with VirtualBox or VMware capable of running a Linux VM, 16GB hard drive space\r\n- Basic understanding of Linux command line\r\n- Basic Programming skills in 1 language\r\n- InfoSec vocabulary (OWASP Top 10)\r\n\r\nSummary\r\n\r\nAt a high level, this workshop will be an overview of best practices in performing a security assessment of a new code base (threat modeling and testing methodologies), an intro to static and dynamic analysis, and then a CTF-style series of hands-on exercises where attendees will be exploring many code bases and writing custom lightweight static analysis tools.\r\n\r\nTopics include:\r\n- Quick intro to threat modeling - when given a new application, where should you focus your time?\r\n- Outside in vs inside out testing - tips on what's useful to test dynamically and confirm via source review vs locating an issue through source review and PoC-ing via dynamic testing\r\n- Overview of static and dynamic analysis - strengths and limitations\r\n- Static analysis - the big picture, taint analysis-type problems: sources, sinks, and transfer and cleanse functions\r\n- Static analysis fundamentals - lexing, parsing, building Abstract Syntax Trees (ASTs), ...\r\n- Challenges when performing static analysis - supporting many languages, dynamic typing, eval/reflection constructs, container types, precision vs. memory and speed trade-offs\r\n- A brief tour of other types of program analysis - fuzzing, symbolic execution, etc. - basically, what are all the ways you can build tools to find bugs?\r\n- Hands-on exercises of doing some lightweight static analysis: extracting all string literals or method definitions from a program, automatically finding all routes in a web app, and finding potential command injection.",
      "speakers": [
        30205,
        30212
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T20:00+0000",
      "event_type": 30202,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Crypto Hero",
      "end_date": "2018-09-28T23:50+0000",
      "id": 30205,
      "location": 30203,
      "description": "Protect data with strong cryptography (AES, RSA, SHA) and attack these systems (Existential Forgery, Padding Oracle, and more).  Make Ethereum smart contracts in Solidity and hack them, and configure private Multichain blockchains.\r\n\r\nThis is a hands-on workshop with a series of CTF-style challenges, beginning with simple data conversions and extending to advanced methods appropriate for experts.  We will briefly explain and demonstrate the techniques, and will help participants individually with the challenges.\r\n\r\nMost challenges require nothing more than a computer with the Chrome web browser.  No prior programming or cryptography experience is necessary.",
      "speakers": [
        30201,
        30202
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T20:00+0000",
      "event_type": 30202,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Enterprise Active Directory Attack Playbook for Red and Blue Teams",
      "end_date": "2018-09-29T23:00+0000",
      "id": 30206,
      "location": 30204,
      "description": "This training takes place inside a dedicated network, simulating a production environment with a complete Windows/Active Directory deployment.  Students will assume the roles of both an adversary and the defender, starting as a regular desktop user and gradually escalating privileges and moving laterally across the enterprise.  We'll review reconnaissance techniques, discover blind spots, pivot and eventually compromise otherwise-segregated servers.\r\n\r\nStudents will gain invaluable insights into Active Directory attack, understanding the artifacts that they leave behind and practical preventative and monitoring controls.  To reduce attack footprint and simulate a real adversary, the playbook is exclusively built on Windows scripts and tools.  We will not use Metasploit, Cobalt Strike, etc.\r\n\r\nPrerequisites: As an introductory class, no previous red or blue-team experience is required.  However, students are expected to be familiar with basic Windows and network infrastructure.  Basic Powershell and command-line experience is recommended.\r\n\r\nEquipment: Please bring a laptop computer capable of running at least two Windows 10 VMs (VM image will be distributed prior to class). Your laptop must have at least 8GB of RAM and run a 64-bit OS.",
      "speakers": [
        30227
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T16:00+0000",
      "event_type": 30202,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Finding and Decoding Malicious PowerShell Scripts",
      "end_date": "2018-09-29T23:00+0000",
      "id": 30207,
      "location": 30203,
      "description": "Malicious PowerShell scripts are becoming the tool of choice for attackers. Although sometimes referred to as “fileless malware”, they can leave behind forensic artifacts for examiners to find. Learn how to locate and identify activity of these malicious PowerShell scripts. Once located, these PowerShell scripts may contains several layers of obfuscation that need to be decoded. Learn how to manually decode them, as well as some light malware analysis on any embedded shellcode through a series of hands on labs. I will also demonstrate how to use an open source python script to automate some of the process once you have discovered the MO of the attacker in your case.\r\n\r\nRequirements: Attendees should have a Windows system or Windows VM. The user must be able to turn off their AV. It would also be helpful if Python 2.7 is installed and added to the Path environment variable.",
      "speakers": [
        30206,
        30223
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T21:00+0000",
      "event_type": 30202,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Hands-On Web Hacking",
      "end_date": "2018-09-28T19:00+0000",
      "id": 30208,
      "location": 30203,
      "description": "Format: 30-minute modules focused on familiarizing attendees with web vulnerabilities and how to use common tools to exploit them. We will rotate through 7-8 different vulnerabilities and exercises over the course of the training. Students are free to come and go for the tools and vulnerabilities they are interested in.\r\n\r\nVulnerabilities: Broken Access Control, User Enumeration, Insecure Direct Object Reference, SQL Injection, Cross-Site Scripting, Security Misconfigurations\r\n\r\nTools: Burp Suite Professional, SQLMap, Browser Exploitation Framework (BeEF), SVN Digger, Git Digger, GraphQL, Postman",
      "speakers": [
        30219,
        30220
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T16:00+0000",
      "event_type": 30202,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "RED VS. BLUE",
      "end_date": "2018-09-29T19:30+0000",
      "id": 30209,
      "location": 30203,
      "description": "Have you ever detected an attack while it was happening?\r\n\r\nHave you ever been the attacker?\r\n\r\nJoin us for our security competition Red vs Blue. This workshop allows participants to experience security attacks from the perspective of an attacker and a defender.\r\n\r\nAs a Blue Team participant, you'll be monitoring a live environment looking for anomalous behaviors.  It will be your job to identify the breach and make recommendations for remediation.  Blue team players will get hands-on experience using tools for attack detection.\r\n\r\nRed Team participants will receive a playbook with step-by-step instructions for a series of attacks against the Blue Team.  All Red Team tools are included with Kali Linux.\r\n\r\nThis event is designed for players of all abilities. \r\n\r\nWhat to bring:  A laptop capable of running an SSH client\r\n\r\nRvB has 16 slots with two teams of 8.  Please indicate if you'd like to be Red or Blue team and if you'd like to be paired with a particular teammate; we'll do our best to accommodate.",
      "speakers": [
        30218,
        30225
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T16:00+0000",
      "event_type": 30202,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Keynote: Building a Better Hacker Future",
      "end_date": "2018-09-29T20:50+0000",
      "id": 30210,
      "location": 30201,
      "description": "",
      "speakers": [
        30236
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T20:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Anatomy of an AppSec Program; OR How to Stop Deploying Shoddy Code to Production Systems",
      "end_date": "2018-09-29T18:50+0000",
      "id": 30211,
      "location": 30202,
      "description": "Organizations of all sizes still struggle with very common vulnerabilities like command injection, XSS, and insecure direct object reference … despite an abundance of code scanners on the market. The OWASP Top 10 is quickly becoming irrelevant because it has barely changed in the last several years.\r\n\r\nThis is one of the most pressing issues for CISOs and there is no definitive solution. AppSec isn’t a product you can buy, it isn’t even a state that you can achieve. There is no how-to guide for application security.\r\n\r\nBut there are some qualities shared by successful AppSec programs. This talk will provide security managers and directors who struggle with application security a better understanding of those common elements and answer some questions, such as:\r\n\r\nWhat are some of the critical functions of an AppSec program?\r\n\r\nWill that work in my <insert buzzword SDLC here> environment?\r\n\r\nOkay, so where do I start?",
      "speakers": [
        30238
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T18:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "ARMaHYDAN - Misadventures of ARM instruction encodings",
      "end_date": "2018-09-29T18:50+0000",
      "id": 30212,
      "location": 30201,
      "description": "Because some instruction bit fields in the ARM manual were unexplained and assembly language is too high-level, this talk explores the implications of shoving the wrong bits into the right instructions. The results of this experiment lead to things like having about 25% of the instructions in an ARM ELF binary looking undefined (but work as defined) to most disassembly engines (even worse in IDA). Or creating an army of executables that operate identically, have the exact same instructions and file sizes, but all with different hashes. Or how about another way to reduce some NULLs from particular instructions. And finally, have HYDAN-like steganography abilities. And yes I started the last sentences with Because, Or, and And. This talk is not just theoretical or academic, there is a PoC tool to go along with all of the above and it will be demonstrated.",
      "speakers": [
        30237
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T18:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Automation and Open Source: Turning the Tide on Attackers",
      "end_date": "2018-09-29T17:50+0000",
      "id": 30213,
      "location": 30202,
      "description": "The security world is still trying figure out how to deal with the overwhelming number of security alerts and data deluge most SOCs are faced with and then turn them into intelligence that is useful and actionable. Throwing more people and tech at the problem has proven to be ineffective and costly. In this talk I walk through methods and tools (that you can actually employ) to turn the tide in your favor and create a security team that proactively deals with threats.",
      "speakers": [
        30214
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T17:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Bug Bounty: Under the Hood",
      "end_date": "2018-09-29T16:30+0000",
      "id": 30214,
      "location": 30202,
      "description": "We've all heard about Bug Bounty programs, and they are becoming far more accepted and a standard industry tool. But what happens when a bug is submitted? Get an insider's perspective from PayPal's Bug Bounty program, including triage and risk decisions, the internal process and debates, and the challenges of communication. We also discuss the ethical considerations of running a program, the future of Bug Bounties, and, of course, our favorite war stories.",
      "speakers": [
        30207,
        30226,
        30235
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T16:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "DarkMention: Next-Generation Attack Prediction",
      "end_date": "2018-09-28T20:50+0000",
      "id": 30215,
      "location": 30201,
      "description": "The direct and indirect costs of cyber attacks continue to mount while the volume of attacks is increasing. Recent attacks against crypto-currency exchanges illustrate the drastic second and third order effects of such attacks.  Hence, such incidents are best avoided.  Meanwhile, advances in artificial intelligence and threat intelligence hold promise for prediction of specific attacks weeks before occurring.  In this talk, we provide an overview of a new technology called DarkMention that leverages these new predictive techniques. This platform, developed under funding by the U.S. intelligence community has been shown to predict specific attacks against an organization with single-digit false positives in blind tests on real-world attack data.  This talk reviews the technology, describes various case studies, and discusses how it is being integrated into real-world enterprise environments.",
      "speakers": [
        30231
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T20:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Detecting Dedicated Infrastructure",
      "end_date": "2018-09-28T23:50+0000",
      "id": 30216,
      "location": 30201,
      "description": "Detecting the bulletproof hostings that make up the dedicated infrastructure used by Phishing and Malware actors involves a variety of creative techniques. A lot of things have changed since the time of RBN (Russian business network): abused and compromised hosters, their services and DDoS protection help bad guys just as well as cybercrime fighters making exposure and indictment a hard job. In this session, we will detail our approach to uncovering such systems at scale based off global DNS data while explaining the underlying architecture of phishing campaigns which already made more than $50 million. We will show what it takes to go from detection of the phishing domain to cooperation with Law Enforcement and taking down infrastructure and actors behind cybercrime campaigns.",
      "speakers": [
        30216,
        30222
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T23:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Detecting WMI Exploitation",
      "end_date": "2018-09-28T18:50+0000",
      "id": 30217,
      "location": 30201,
      "description": "Windows Management Instrumentation (WMI) is loved by the Red Team, Pentesters, and the criminals.  There are a few exploitation tools available such as WMImplant, WMILM, and Metasploit.  Utilizing WMI in attacks is popular since it does not log much, is very good for remote attacks, and includes a database to hide persistence and payloads.  The use of WMI has also been used in what is referred to as fileless malware, and can even include PowerShell.\r\n\r\nWMI attacks CAN be detected, and everyone should understand how to search for, detect, and all the Fu that goes along with WMI attacks.  The reason? By default, Windows does log much to detect WMI exploitation, so there is some work to do you need to know about.\r\n\r\nThis talk will show a few examples of WMI exploitation, what and why it can be detected, what you need to configure to catch attacks, what additional things you will need to hunt for WMI pwnage across your environment.  Also discussed will be some examples of log management queries, tools you might use to capture malicious WMI activity.",
      "speakers": [
        30213
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T18:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-27T03:32+0000"
    },
    {
      "title": "Grandma Got Run Over by an Email – Senior Citizens and Computer Security",
      "end_date": "2018-09-29T21:50+0000",
      "id": 30218,
      "location": 30202,
      "description": "It may be hard to believe, but people born at the start of the Baby Boomer generation are in their 70’s now, and many have spent much of their adult life in the pre-computer age.  Even if some of these seniors are comfortable using a home computer, basic security principles such as updating their stuff and password protecting their computer are things they just don’t do.  To make matters worse, I bet that most of us know someone, or have someone in our family, that has fallen victim to an online scam of some type or has gotten their computer thoroughly infected with malware.\r\n\r\nSo, what can we as hackers do to help this generation be more computer-savvy, more secure, and less likely to be taken advantage of?  It turns out that educating seniors in this area can be a challenge, and to do it effectively means learning a different set of presentation techniques.\r\n\r\nIn this talk I will discuss some of the work I have done in this area, including how I approached conducting a series of educational talks for a group of senior citizens.  I will describe some of the unique challenges that working with this demographic poses, and share examples of how I structured, delivered, and followed up on the material.  I will also discuss some of the pitfalls and lessons learned I  experienced in doing this work.  This has been a fun and rewarding way to give back to the community, and I will share a few of the joys and benefits I have experienced doing this.  My goal in giving this talk is to generate some interest in this topic within the hacker community, stimulate some beneficial discussion, and help to equip and motivate others to reach out to the seniors in their area.",
      "speakers": [
        30215
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T21:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "How Can I Find Thee? Let Me Count the Ways - Automated Bug Finding in Practice",
      "end_date": "2018-09-28T18:50+0000",
      "id": 30219,
      "location": 30202,
      "description": "Over the past decade, there have been a number of automatic and semi-automatic approaches used to help security professionals find bugs, including dataflow analysis, blackbox web application scanning, fuzzing, and more. Despite the fact that a number of these techniques are now widely used, there tends to be a lack of discussion and clarity around the fundamental underpinnings of the approaches and their inherent tradeoffs.\r\n\r\nIn this talk, we’ll provide an overview of a number of automated bug finding techniques, ranging from the well known, such as fuzzing, dataflow analysis, and blackbox scanning, to less common techniques that are gaining traction, such as symbolic execution, model checking, and abstract interpretation.\r\n\r\nFor each technique, we’ll give a high level introduction that provides you with an intuition for how and why the technique works. Then, we’ll discuss the strengths and weaknesses of the technique, including the types of bugs and classes of problems it’s effective at finding, and those it’s not. We’ll also describe inherent implementation tradeoffs any creator of such a tool needs to make, and link to open source tools you can play with as well as conference talks and academic papers you can review to learn more.\r\n\r\nYou’ll leave this talk with an understanding of the wide variety of automated bug finding approaches out there. You’ll know which techniques might be applicable in your own work, and you’ll have the background knowledge necessary to make more informed decisions when assessing potential open source or commercial tools.",
      "speakers": [
        30205,
        30212
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T18:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Implementing a Kick-Butt Training Program: BLUE TEAM GO!",
      "end_date": "2018-09-28T21:50+0000",
      "id": 30220,
      "location": 30201,
      "description": "Hands-on incident response roles such as those found within a SOC or CIRT are difficult to staff.  The skill sets required for these roles are vast.  Even when these roles are filled, analysts often find themselves faced with tasks with which they are not familiar.  Certification and higher education programs provide a decent foundation, but they do not produce strong responders.  Even for those environments full of strong responders, analyst skills are often weakened by the onslaught of repetitive tasks, such as fielding phishing ticket, after phishing ticket, after phishing ticket... you get the point.\r\n\r\nAsk yourself: Do all analysts on your team have a firm understanding of your company, the SIEM, advanced networking concepts, network forensics, host-based forensics, malware analysis, threat hunting, and working with intel?  Most likely not.  In this talk, I’ll provide a framework for an on-boarding/baseline training program.  The framework is flexible, allowing for multi-phase deployments or an all-at-once bootcamp style training depending on your needs.\r\n\r\nThe program utilizes experiential training in an effort to teach your analysts the HOWs and WHYs behind their processes and tools.  We don’t need analysts who can push a button to get a banana -- We needs analysts who truly understand the inner-workings of their tools.  For example, what’s the difference between pslist and psscan in volatility?  Which one relies upon pool tags?  What is a pool tag and why do they matter?  Adversaries and red teams rely on weaponization… why not weaponize your blue team with the tools they need too?",
      "speakers": [
        30204
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T21:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Lessons Learned: Emerging Adversary Playbooks",
      "end_date": "2018-09-29T22:50+0000",
      "id": 30221,
      "location": 30202,
      "description": "Based on observed activities across thousands of enterprises worldwide we will look at how techniques and tactics of adversary groups have evolved over the past year. We will examine the rise of cryptocurrency mining for profit as well as the practice of “living off the land” in the later attack phases. Additionally, we will examine the impact that IaaS and PaaS services have had on the resurgence of server focused attacks. All data comes from actual samples detected in the wild.",
      "speakers": [
        30224
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T22:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "On the Nose: Bypassing Huawei's Fingerprint Authentication by Exploiting the TrustZone",
      "end_date": "2018-09-28T22:50+0000",
      "id": 30222,
      "location": 30201,
      "description": "After hundreds of vulnerabilities disclosed and countless roots of smartphones the landscape of privilege separation is changing on your mobile device. No longer is kernel compromise the end of the road for attackers attempting to find all the dark secrets stored on your smartphone. Now we have TrustZone, a technology introduced by ARM which provides the “Secure World”. This “Secure World” is separated from the Android kernel which exists in the “Normal World”. Many of the most sensitive operations on your phone are now managed by the TrustZone. These include DRM, fingerprint authentication, and secure file storage, leaving a malicious kernel unable to meddle with them.\r\n\r\nThis talk will demonstrate that despite the enhanced security architecture, a persistent attacker can still prevail. By chaining a number of memory corruption vulnerabilities the author will show how a lowly untrusted app on a Huawei device can compromise the kernel, followed by a trusted app, and eventually the TrustZone kernel itself. Using this access the author will show how the fingerprint trusted module can be patched to accept any fingerprint or even any nose. A demo with nose unlocking will be included.",
      "speakers": [
        30233
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T22:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Pathways Into Darkness: Hunting for Adversary Behaviors Atop the Pyramid Of Pain",
      "end_date": "2018-09-28T17:50+0000",
      "id": 30223,
      "location": 30201,
      "description": "Analysts are becoming swamped with the work of processing and searching for atomic indicators from intelligence reporting. Simultaneously, analysts are being asked to hunt but may not know where to start. This talk will explore the benefits of and strategies for reading subscription and OSINT reports rather than just programmatically scraping IOCs. The aim is for attendees of any background to walk away with the desire and capability to generate actionable ideas for seeking out badness in their environment.",
      "speakers": [
        30211
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T17:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Quest Accepted: Gamifying Security Awareness Training",
      "end_date": "2018-09-29T23:30+0000",
      "id": 30224,
      "location": 30202,
      "description": "Security awareness training is BORING, users click through as fast as they can and guess at the questions. Then they forget everything that was just presented to them. This talk will discuss some simple strategies to gamify your security awareness program and help users care. We will discuss a simple approach that will allow you to focus on one security awareness topic at a time. Eventually you will have a full blown game and users who actually practice and have a strong security posture. We will also discuss how to make this fit any budget and how you can get creative with it.",
      "speakers": [
        30229
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T23:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Red Team Tactics for Cracking the GSuite Perimeter",
      "end_date": "2018-09-29T17:50+0000",
      "id": 30225,
      "location": 30201,
      "description": "As more corporations adopt Google for providing cloud services they are also inheriting the security risks associated with centralized computing, email and data storage outside the perimeter. In order for pentesters and red teamers to remain effective in analyzing security risks, they must adapt techniques in a way that brings value to the customer.\r\n\r\nIn this presentation we will begin by demonstrating adaptive techniques to crack the perimeter of Google Suite customers. Next, we will show how evasion can be accomplished by hiding in plain-sight due to failures in incident response plans. Finally, we will also show how a simple compromise could mean collateral damage for customers who are not carefully monitoring these cloud environments.",
      "speakers": [
        30208
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T17:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Running Laps Around Microsoft's LAPS",
      "end_date": "2018-09-29T16:55+0000",
      "id": 30226,
      "location": 30202,
      "description": "Microsoft's Local Administrator Password Solution (LAPS) is a great product for large monolithic organizations that have complete control over their domain joined Windows clients... but what about those of us that have more “liberal” users and expectations (technical debt)?  We have come up with a solution that allows our domain joined clients to still be protected, without angering the previously delegated administrators (and in most cases, they don't even know it is happening, yet it is hidden in plain sight).",
      "speakers": [
        30228,
        30230
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T16:30+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Searching the Void - IPv6 Network Reconnaissance",
      "end_date": "2018-09-29T22:50+0000",
      "id": 30227,
      "location": 30201,
      "description": "The entire IPv4 Internet can be scanned in under 10 minutes. To scan the entire IPv6 internet, it would take longer than livable lifetime of Earth. Security professionals and organizations are going to have to learn to handle networks of unimaginable scale. Fortunately, there are some tricks and best practices that infosec pros can use to overcome the sheer volume of possible IPv6 addresses. This talk will cover methods to substantially shrink the number of IPv6 addresses one needs to scan and blue team-inspired techniques to find potential entry points on an IPv6 network.",
      "speakers": [
        30235
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T22:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "So you want to be a mentor: taking someone from noob to knowledgeable",
      "end_date": "2018-09-28T16:55+0000",
      "id": 30228,
      "location": 30202,
      "description": "This paper comes out of dozens of conversations I’ve had with people wanting to get into infosec as a career. The problem is that universities, SANS, various other organizations and online courses  are expensive. Most of these individuals are looking to get into better paying jobs, thus they don’t have the up-front cash to go those routes. Also, infosec is a difficult field in that the body of required knowledge is vast covers topics including security philosophy, endpoint operating systems, applications, networking, cloud, scripting, compliance/regulation/audit...\r\n\r\nThis paper is not meant to teach individuals this body of knowledge, but is intended to be a roadmap for an experienced professional to help a willing and motivated person to get on a path to becoming a knowledgeable practitioner. It contains almost no original content, but lots of reference links and a framework of learning that will cover most of the basics, as well as suggesting topics to continue learning.",
      "speakers": [
        30221
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T16:30+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Stealing Cycles, Mining Coin: An introduction to Malicious Cryptomining",
      "end_date": "2018-09-28T17:50+0000",
      "id": 30229,
      "location": 30202,
      "description": "In today's world crimeware is a multi-billion dollar industry that's currently being primarily run through extortion in the electronic age, ransomware. However, times are changing and the business models are changing along with it. The rise of ransomware has paralleled a rise in the value of cryptocurrencies, the two are not necessarily connected, but the impact has been.\r\n\r\nFrom an adversary's perspective there are two primary ways of getting these currencies: ransom payouts or mining. Crypto-mining has been around as long as cryptocurrency and it's always been a trade off. Can you earn enough currency to offset the electricity and hardware costs?  Well imagine if you didn't have to worry about either of them.\r\n\r\nThis talk will provide a deep dive into pool mining, and how it is being leveraged by attackers. We will also outline the ways that we've seen adversaries deliver crypto mining programs to end users, the amount of mining capabilities they possess, and some of the financial impacts of their activities. Specific examples of miner distribution campaigns will be provided to give real-world scenarios where attackers are amassing computing resources.",
      "speakers": [
        30203
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T17:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Weaponizing Your Pi",
      "end_date": "2018-09-29T16:50+0000",
      "id": 30230,
      "location": 30201,
      "description": "Pentesting requires you to think outside the box and come up with new and inventive ways to crack the perimeter.  With computers becoming constantly smaller, faster, and cheaper, “Weaponizing Your Pi” focuses on using these micro systems to gain a foot hold while staying undetected. We will take a Raspberry Pi III and configure for three different scenarios: A low profile, portable, autonomous, wireless, custom credential stealing tool. A Kali dropbox that is accessible through cell communications. Finally a low profile VOIP network attack tool with a quick tutorial on how to bypass a Cisco lock box to set up the attack.  A link to the resources used to create the device configurations will be provided at the end.",
      "speakers": [
        30209
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T16:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Wireless Monitoring with the #WiFiCactus",
      "end_date": "2018-09-29T23:30+0000",
      "id": 30231,
      "location": 30201,
      "description": "The #WiFiCactus is a wireless monitoring tool that is capable of listening to 50+ channels of WiFi at the same time. This talk will discuss the events and data from the last year traveling with the #WiFiCactus including warwalking at DEF CON and DEF CON China. This talk will discuss why wireless monitoring is important to the security of your network and the interesting things you can find when you have 100+ antennas strapped to your back while traveling the world. This talk will breakdown upgrades and optimizations that have been added in order to make it more effective and discuss the results of those upgrades. This talk will also discuss wireless tools like Kismet and how to get the most out of them.",
      "speakers": [
        30232
      ],
      "conference": "CACTUSCON2018",
      "link": "https://twitter.com/hashtag/wificactus",
      "includes": "",
      "start_date": "2018-09-29T23:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Working with WeirdAAL (AWS Attack Library)",
      "end_date": "2018-09-28T21:50+0000",
      "id": 30232,
      "location": 30201,
      "description": "Contrary to most presentations and blog posts there is more to AWS than S3. In a quest to create more re-usable code we have created WeirdAAL (AWS Attack Library).  Offensively, WeirdAAL helps you answer the “what can I do with this AWS key”? We aim to answer that question, in a blackbox way, via recon modules and modules specifically dedicated to attack each of the interesting AWS service offerings while avoiding detection. It also provides multiple functions sorted by AWS service that you can use for both offensive and defensive checks.",
      "speakers": [
        30210,
        30217
      ],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T21:00+0000",
      "event_type": 30201,
      "updated_at": "2018-09-29T01:18+0000"
    },
    {
      "title": "Closing Ceremony",
      "end_date": "2018-09-30T01:00+0000",
      "id": 30233,
      "location": null,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-30T00:15+0000",
      "event_type": 30201,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Lunch Break",
      "end_date": "2018-09-28T20:00+0000",
      "id": 30234,
      "location": null,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T19:00+0000",
      "event_type": 30203,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Lunch Break",
      "end_date": "2018-09-29T20:00+0000",
      "id": 30235,
      "location": null,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-29T19:00+0000",
      "event_type": 30203,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "OpSec Workshop",
      "end_date": "2018-09-28T19:00+0000",
      "id": 30236,
      "location": 30204,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T17:00+0000",
      "event_type": 30206,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Return of Return of the Dork",
      "end_date": "2018-09-28T20:50+0000",
      "id": 30237,
      "location": 30204,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T20:00+0000",
      "event_type": 30206,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Physical Security Stuff!",
      "end_date": "2018-09-28T21:50+0000",
      "id": 30238,
      "location": 30204,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T21:00+0000",
      "event_type": 30206,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Failures of Mobile Blacklists",
      "end_date": "2018-09-28T22:50+0000",
      "id": 30239,
      "location": 30204,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T22:00+0000",
      "event_type": 30206,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Real Talk on Comms",
      "end_date": "2018-09-28T23:50+0000",
      "id": 30240,
      "location": 30204,
      "description": "",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T23:00+0000",
      "event_type": 30206,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "CactusCon CTF",
      "end_date": "2018-09-29T01:00+0000",
      "id": 30241,
      "location": 30207,
      "description": "Your goal: compromise a fictitious company by stealing user passwords and exploiting vulnerabilities in the deployed services. This year’s CTF competition focuses on a combination of web, mobile, reverse, forensic, and steganographic exploits.\r\n\r\nChallengers assemble teams of up to five people and compete in order to win as many points as possible. The winning team will be the one to score the most points at the end of the allotted time.",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T16:00+0000",
      "event_type": 30204,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "CactusCon Kids",
      "end_date": "2018-09-30T01:00+0000",
      "id": 30242,
      "location": 30207,
      "description": "CactusCon Kids is a workshop within the main CactusCon conference targeted at ages 8 and up.\r\n\r\nRegistration is separate from the main conference, so get your tickets from Eventbrite if you want to participate.",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "https://www.cactusconkids.com/",
      "includes": "",
      "start_date": "2018-09-29T16:00+0000",
      "event_type": 30203,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Lockpick Village",
      "end_date": "2018-09-30T01:00+0000",
      "id": 30243,
      "location": 30206,
      "description": "Lockpick Village",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T16:00+0000",
      "event_type": 30205,
      "updated_at": "2018-09-01T01:18+0000"
    },
    {
      "title": "Hardware Hacking",
      "end_date": "2018-09-30T01:00+0000",
      "id": 30244,
      "location": 30205,
      "description": "Hardware hacking by HeatSync Labs. Hack your badge here.",
      "speakers": [],
      "conference": "CACTUSCON2018",
      "link": "",
      "includes": "",
      "start_date": "2018-09-28T16:00+0000",
      "event_type": 30205,
      "updated_at": "2018-09-01T01:18+0000"
    }
  ]
}