{
  "speakers": [
    {
      "link": "",
      "twitter": "",
      "description": "Elizabeth Biddlecome is a consultant and instructor, delivering technical training and mentorship to students and professionals. She leverages her enthusiasm for architecture, security, and code to design and implement comprehensive information security solutions for business needs. Elizabeth enjoys wielding everything from soldering irons to scripting languages in cybersecurity competitions, hackathons, and CTFs.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Elizabeth Biddlecome",
      "conference": "CACTUSCON2018",
      "id": 30201
    },
    {
      "link": "",
      "twitter": "",
      "description": "Sam Bowne is an instructor at City College San Francisco, and has been teaching hacking and security classes for ten years.  He has presented talks and workshops at Defcon, HOPE, RSA, BSidesLV, BSidesSF, and many other conferences.  He has a CISSP and a PhD and is like, really smart.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Sam Bowne",
      "conference": "CACTUSCON2018",
      "id": 30202
    },
    {
      "link": "",
      "twitter": "",
      "description": "Edmund Brumaghin is a threat researcher with Cisco Talos. He has spent the past several years protecting environments across a number of different industries including nuclear energy, financial services, etc. He currently spends his days hunting malware and analyzing various threats as they emerge and continue to evolve. In his time with Talos he has researched ransomware, banking trojans and other threats being distributed using various attack vectors. He has also worked to expose large scale malware campaigns and raise awareness of security threats observed across the threat landscape.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Edmund Brumaghin",
      "conference": "CACTUSCON2018",
      "id": 30203
    },
    {
      "link": "",
      "twitter": "",
      "description": "Ryan Chapman works on the Bechtel CIRT, currently holding the role of CIRT/SOC Liaison, a form of technical lead for the SOC.  Prior to Bechtel, Ryan worked as a technical trainer.  Ryan enjoys malware analysis, network forensics, and… just about everything else that has to do with security.  Outside of work, Ryan spends time with his family, dabbles in stand-up comedy, gets tapped on the jiu jitsu mats, and plays plenty of Street Fighter.  Hadouken!",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Ryan Chapman",
      "conference": "CACTUSCON2018",
      "id": 30204
    },
    {
      "link": "",
      "twitter": "",
      "description": "Daniel DeFreez is a co-founder of Practical Program Analysis LLC, a boutique security firm specializing in building security tools that make pen testers and security engineers more efficient. Daniel is also currently a PhD student at the University of California, Davis, where his research focuses in developing program analysis techniques to find bugs in the Linux kernel.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Daniel DeFreez",
      "conference": "CACTUSCON2018",
      "id": 30205
    },
    {
      "link": "",
      "twitter": "",
      "description": "Mari DeGrazia is a Director at Kroll Cyber Security, which provides cyber security services on a global scale. Throughout her career, Mari has investigated high-profile breach cases, worked civil and criminal cases and provided testimony as an expert witness. She has written and released numerous programs/scripts to the forensics community; presented on her research at several industry conferences; and is a published author in several magazines. She holds several certifications in addition to earning a B.S. in Computer Science from Hawaii Pacific University.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Mari DeGrazia",
      "conference": "CACTUSCON2018",
      "id": 30206
    },
    {
      "link": "",
      "twitter": "",
      "description": "Ray Duran manages PayPal's Bug Bounty program. He has over five years security experience, working in PKI, malware analysis, digital crimes, bug bounty, penetration testing, and root cause analysis.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Ray Duran",
      "conference": "CACTUSCON2018",
      "id": 30207
    },
    {
      "link": "",
      "twitter": "@ustayready",
      "description": "Mike is currently a red teamer / pentester for Black Hills Information Security. He began his career in 1997 as a Linux Administrator which eventually led to numerous offensive security roles, software development and hardware/software security research. Mike is also a lead forensics instructor for TeelTech, an Officer for OWASP Orlando (Chief Breaker) and an organizer for BSides Orlando.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Mike Felch",
      "conference": "CACTUSCON2018",
      "id": 30208
    },
    {
      "link": "",
      "twitter": "",
      "description": "John Freimuth - In Security since 2010, but professionally since 2012. Currently pentesting with a health company in the valley. You might remember me from such talks as “Return of the Dork” or “Wrangling Malware for Fun and Pentesting.”",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "John Freimuth",
      "conference": "CACTUSCON2018",
      "id": 30209
    },
    {
      "link": "",
      "twitter": "",
      "description": "Chris Gates has been breaking things professionally for over a decade via Network & Web Application Penetration Testing, Red Teaming & Adversarial Simulation.  These days Chris splits his time being both a breaker and fixer. Chris is the author of Metta, a tool for adversarial simulation and contributes to other open source projects.\r\nIn the past he has spoken at the United States Military Academy, BlackHat, DefCon, Wild West Hacking Fest, Toorcon, Brucon, Troopers, SOURCE Boston, Derbycon, LasCon, HashDays, HackCon, Bsides ATL, IT Defense, OWASP AppSec DC, and Devops Days. Chris is also cofounder of NoVAHackers.\r\nBlog: carnal0wnage.attackresearch.com\r\nTwitter: @carnal0wnage\r\nTalks: https://www.slideshare.net/chrisgates/",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Chris Gates",
      "conference": "CACTUSCON2018",
      "id": 30210
    },
    {
      "link": "",
      "twitter": "",
      "description": "Kyle Gervais is a Threat Intelligence Analyst at a Fortune 500. He has experience with incident response as a multi-tier SOC analyst, and has a background in computer science problems involving Too Much Data. Kyle takes his name from the father of John Connor (no that is not a joke), firmly believes that CTF-Face is the best FPS map ever created, and enjoys most things DFIR/CTI. On a typical day he can be found ranting to his cat about the fourth amendment while reading .bash_history to remember what he broke.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Kyle Gervais",
      "conference": "CACTUSCON2018",
      "id": 30211
    },
    {
      "link": "",
      "twitter": "",
      "description": "Dr. Clint Gibler is a senior security consultant and research director at NCC Group, a global information assurance specialist providing organizations with security consulting services. By day, he performs penetration tests of web applications, mobile apps, and networks for companies ranging from large enterprises to new startups. Clint is also a co-founder of Practical Program Analysis LLC.\r\nClint has spoken at a number of conferences, including BlackHat USA, AppSec EU, AppSec Cali, Virus Bulletin, and others. Clint holds a Ph.D. in Computer Science from the University of California, Davis, where his research focused on mobile security.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Clint Gibler",
      "conference": "CACTUSCON2018",
      "id": 30212
    },
    {
      "link": "",
      "twitter": "",
      "description": "Michael is a Malware Archaeologist, Blue Team defender, Incident Responder and logoholic. Michael developed several Windows logging cheat sheets to help the security industry understand Windows logging, where to start and what to look for. Michael is co-developer of LOG-MD, a free tool that audits the settings, harvests and reports on malicious Windows log data and malicious system artifacts. Michael also blogs on HackerHurricane.com on various InfoSec topics. Michael also is co-host of the “Brakeing Down Incident Response” BDIR Podcast to education on Incident Response daily tasks. Michael also ran BSides Texas for five years for the Austin, San Antonio, Dallas and Houston cons.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Michael Gough",
      "conference": "CACTUSCON2018",
      "id": 30213
    },
    {
      "link": "",
      "twitter": "",
      "description": "John has 12 years of diverse experience within the Navy, the Intelligence Community, and in the corporate cyber security world with focuses on building and maturing SOCs, SIEM/IDS/IPS engineering, malware analysis, and cyber operations.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "John Grigg",
      "conference": "CACTUSCON2018",
      "id": 30214
    },
    {
      "link": "",
      "twitter": "",
      "description": "Russ assembled his first computer on his Mom’s kitchen table in the mid 1970’s.  He still has that computer, along with a few that are actually useful.  As a product of the atomic age, Russ spent several decades doing Gamma Ray Spectrometry before moving into computer security.  Currently, Russ is a full time penetration tester supporting a department of the US Government.  When he is not peering at a computer screen he can often be found peering out the front window of a vintage airplane.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Russ Gritzo",
      "conference": "CACTUSCON2018",
      "id": 30215
    },
    {
      "link": "",
      "twitter": "",
      "description": "Artsiom Holub is a Senior Security Analyst on the Cisco Umbrella Research team. Throughout the course of the day, he works on Security Threat Reports for existing and potential clients, works closely with the Customer Support Team, finds new threats and attacks by analyzing global DNS data coming from Cisco Umbrella resolvers, and designs tactics to track down and identify malicious actors and domains. Having undergraduate studies from National Technical University of Belarus, and currently earning an Associate in Science degree from City College of San Francisco in Computer Networking and Information Security with completed Security certificates along the way. Currently focused on tracking phishing, ransomware campaigns and other cybercrime related to cryptocurrency ecosystem.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Artsiom Holub",
      "conference": "CACTUSCON2018",
      "id": 30216
    },
    {
      "link": "",
      "twitter": "@cktricky",
      "description": "Ken Johnson has been hacking web applications professionally for 9 years. Ken is both a breaker and builder and currently works on the GitHub application security team. Previously, Ken has spoken at RSA, Insomnihack, DerbyCon, AppSec USA, AppSec DC, AppSec California, DevOpsDays DC, LASCON, RubyNation, and numerous Ruby, OWASP, and AWS events. Ken’s current projects are WeirdAAL, OWASP Railsgoat, and the AbsoluteAppsec Podcast.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Ken Johnson",
      "conference": "CACTUSCON2018",
      "id": 30217
    },
    {
      "link": "",
      "twitter": "",
      "description": "Bob has been in IT since 1996 and started as a Network Engineer at T-Mobile (then VoiceStream) in 1999 while obtaining his CCNA in 2000 and maintaining an active CCNP R&S since 2003. He has worked as a Network/Security Engineer for large enterprise and commercial customers like US Airways, Shutterfly, and PF Chang's, then moving into the reseller space, over the last 12 years while focusing more on Network and Information Security for the last 5 years. On the network security front, Bob cut his teeth on the Cisco ASA platform and more recently received his Palo Alto ACE certification and is currently working toward his PCNSE. When not working on his home lab, Bob is likely demonstrating why some of our aging generation, like himself, may not be skilled enough to play FPS video games, like Overwatch and FortNite.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Bob Kern",
      "conference": "CACTUSCON2018",
      "id": 30218
    },
    {
      "link": "",
      "twitter": "",
      "description": "Justin Larson has several years of experience testing applications for security vulnerabilities. He has done is time of testing Java thick client apps from last century to hacking on the new hotness of SPAs. Justin is currently an Application Security engineer at Jane.com where he has been getting fully involved into the SDLC.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Justin Larson",
      "conference": "CACTUSCON2018",
      "id": 30219
    },
    {
      "link": "",
      "twitter": "@sethlaw",
      "description": "Seth Law is an experienced Application Security Professional with over 15 years of experience in the computer security industry. During this time, Seth has worked within multiple disciplines in the security field, from software development to network protection, both as a manager and individual contributor. Seth has honed his application security skills using offensive and defensive techniques, including tool development. Seth currently hosts the Absolute AppSec podcast with Ken Johnson and is a regular speaker at developer meetups and security events, including Blackhat, Defcon, CactusCon, and other regional conferences.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Seth Law",
      "conference": "CACTUSCON2018",
      "id": 30220
    },
    {
      "link": "",
      "twitter": "",
      "description": "Nick has been in Infosec for 20 years and IT for even longer. He has worked for a number of different companies including Deloitte Consulting, Nokia, McAfee, Cisco, Sourcefire and Palo Alto Networks. He has been fortunate enough to have benefited from many mentors and would like to give back to the community at large. He lives in Phoenix with his wife and three noisy dogs, enjoys gourmet cooking and bicycling, but not enough of the latter to keep the former in check.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Nick Moore",
      "conference": "CACTUSCON2018",
      "id": 30221
    },
    {
      "link": "",
      "twitter": "",
      "description": "Jeremiah O'Connor is a Senior Research Engineer on the Cisco Cloud Security team. Computer scientist interested in distributed systems, natural language processing, built information retrieval system which is able to analyze 120 billion DNS requests a day, and able to detect fraud and phishing attacks at scale. Current interests lie in Bitcoin security, blockchain technology and applied machine learning.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Jeremiah O'Connor",
      "conference": "CACTUSCON2018",
      "id": 30222
    },
    {
      "link": "",
      "twitter": "",
      "description": "Marc Padilla is a Senior Managing Consultant at Kroll Cyber Security and performs digital forensics and incident response for data breach investigations and cyber security engagements. He is enthusiastic about research and performs analysis for statistical observations of large data sets. As a motivated communicator who shares ideas and knowledge with others, he has presented to the Arizona Public Defenders Association and University of Arizona on the topic of digital forensics, network analysis, and security. Marc holds information security certifications, a B.S. in Information Science and Technology, and is currently pursuing a M.S. in Cybersecurity.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Marc Padilla",
      "conference": "CACTUSCON2018",
      "id": 30223
    },
    {
      "link": "",
      "twitter": "",
      "description": "Nicholai Piagentini has been working in cybersecurity for 20 years. After providing advanced training in Microsoft, Novell and Cisco networking, Nicholai became a member of the education staff at Netscreen Technologies. He continued working at Juniper networks after their acquisition of Netscreen in the competitive intelligence group. Nicholai left Juniper to start the education department at Palo Alto Networks almost 10 years ago. He also became the first consulting engineer for them and specialized in user aware next generation firewall architecture. Currently Nicholai works with Palo Alto Networks specializing in their threat prevention and security operations portfolio.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Nicholai Piagentini",
      "conference": "CACTUSCON2018",
      "id": 30224
    },
    {
      "link": "",
      "twitter": "",
      "description": "Jeremy has worked in Information Technology since 1994 with an emphasis on Information Security since 2007. He has supported security communities through DC801, 801Labs, Black Hat, Saintcon and B-Sides as well as mentoring courses for the SANS Institute. He holds a Master's Degree from the Minnesota School of Business and can be probably be found snowboarding if he isn't answering his phone.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Jeremy Pierson",
      "conference": "CACTUSCON2018",
      "id": 30225
    },
    {
      "link": "",
      "twitter": "",
      "description": "Mitchell Poortinga manages the Penetration Testing team at PayPal. He previously worked as a penetration tester and consultant for Fortune 500 companies and SMBs, with 10+ years of experience.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Mitchell Poortinga",
      "conference": "CACTUSCON2018",
      "id": 30226
    },
    {
      "link": "",
      "twitter": "",
      "description": "Aelon Porat is an information security manager at Cision. He has extensive experience attacking and defending corporate environments. Aelon likes to jump inside networks and out of planes, and in his spare time, he enjoys demoing, speaking, and providing training at different events and conferences. Follow him @whereIsBiggles.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Aelon Porat",
      "conference": "CACTUSCON2018",
      "id": 30227
    },
    {
      "link": "",
      "twitter": "",
      "description": "CatatonicPrime loves his wife, his whiskey, and breaking things.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "CatatonicPrime",
      "conference": "CACTUSCON2018",
      "id": 30228
    },
    {
      "link": "",
      "twitter": "",
      "description": "After graduating from ASU with a BS in Computer Science with concentration in Information Assurance Jeremy has gone on to become the Security Operations Manager at Axon.  He has continued his professional education by attending various SANS courses, trainings at BlackHat and attending conferences. Jeremy is a co-organizer of his local active hacker group DC480.io.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Jeremy Ralston",
      "conference": "CACTUSCON2018",
      "id": 30229
    },
    {
      "link": "",
      "twitter": "",
      "description": "ActualReverend hasn't had a job in the real world for over 15 years. Every day he gets up and is responsible for architecting infrastructure for hundreds of servers, thousands of endpoints, and tens of thousands of users all over this country and a few others. (Hundreds of thousands of users in some cases.) Away from work he enjoys living off the grid with his reluctant family and still gets excited whenever anyone from Microsoft tweets to him. (And yes, he does perform marriages.)",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "ActualReverend",
      "conference": "CACTUSCON2018",
      "id": 30230
    },
    {
      "link": "",
      "twitter": "",
      "description": "Paulo Shakarian, Ph.D. is the CEO of CYR3CON, which creates software that uses machine learning to find actionable intelligence for cyber-security.  Paulo is also a  Fulton Entrepreneurial Professor (tenure-track) at Arizona State University. He has written numerous articles in scientific journals and has authored several books, including Elsevier’s Introduction to Cyber-Warfare and Cambridge’s Darkweb Cyber Threat Intelligence Mining.  Recently, his work was featured in major news media including CNN, The Economist, and Business Insider.  He was named a “KDD Rising Star” by Microsoft Research Asia, was recipient of the Air Force Young Investigator award, FOSINT-SI Best Paper, and MIT Tech. Review “Best of 2013”. He also held fellowships with both DARPA and New America.  CYR3CON, the company Paulo co-founded, was named won a Defense Innovation Technology Challenge award (2017), named a Finalist in PwC’s most promising company award, won a National Science Foundation Innovation Corps award (2017), and was a semi-finalist in the Cisco Innovation Grand Challenge (2016).  Previously, Paulo was an officer in the U.S. Army where he served two combat tours in Iraq, earning a Bronze Star and the Army Commendation Medal for Valor.  He also previously worked as an Assistant Professor at West Point.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Paulo Shakarian, Ph.D.",
      "conference": "CACTUSCON2018",
      "id": 30231
    },
    {
      "link": "",
      "twitter": "",
      "description": "Mike Spicer (d4rkm4tter) is a mad scientist hacker who likes to meddle with hardware and software. He is particularly obsessed with wireless. He has a degree in computer science which he has put to use building and breaking a wide array of systems. These include web application pentesting, wireless system monitoring and tracking as well as good old fashioned reverse engineering. In his spare time he loves mountain biking, running, long walks at sunset and food.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Mike Spicer (d4rkm4tter)",
      "conference": "CACTUSCON2018",
      "id": 30232
    },
    {
      "link": "",
      "twitter": "",
      "description": "Nick is a member of the Shellphish CTF team and employed by Raytheon CSI as a vulnerability researcher. Nick has published papers on automated bug finding and exploitation as well Android security, and competed in the DARPA Cyber Grand Challenge with team Shellphish.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Nick Stephens",
      "conference": "CACTUSCON2018",
      "id": 30233
    },
    {
      "link": "",
      "twitter": "",
      "description": "Kevin Tyers is a long term infosec professional who as worked in a variety of industries. His two main passions are network security and programming. His experience working for a large ISP informed his practices around internet scale profiling and research. He has presented at CactusCon, BsidesLV, SANS Hackfest, and many other conferences.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Kevin Tyers",
      "conference": "CACTUSCON2018",
      "id": 30234
    },
    {
      "link": "",
      "twitter": "",
      "description": "Pax Whitmore is the lead engineer for PayPal's Bug Bounty program, focusing on mobile and web applications. In his career as a security analyst and penetration tester, Pax has worked for major corporations and government agencies, performing malware analysis, security auditing, and blackbox testing.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Pax Whitmore",
      "conference": "CACTUSCON2018",
      "id": 30235
    },
    {
      "link": "",
      "twitter": "",
      "description": "Jamie Winterton is the Director of Strategy for Arizona State University’s Global Security Initiative. She steers the university’s cybersecurity research strategy and drives partnerships with government and industry. Jamie has provided expert testimony to the U.S. Senate on the impact of large data breaches. She chairs the university's DARPA Working Group, and is currently a member of the Washington Post’s “The Network” with regular contributions to The Cybersecurity 202. Jamie has appeared in USA Today, the Christian Science Monitor, Slate, NPR, and others, providing insights into cybersecurity issues.\r\n\r\nBefore joining ASU, Jamie was a scientist at Lockheed Martin’s Advanced Technology Center, where she developed and directed projects in electro-optical and radar processing/analysis for multiple military and government organizations. Her work in optical characterization of materials, high-fidelity physics-based 3D modeling and simulation, and exploitation of synthetic aperture radar (SAR) data has been recognized for both innovation and mission utility. Jamie received her Bachelor’s degree in Physics from Arizona State University and her Master’s degree in Physics from the University of Massachusetts, Amherst. She is currently pursuing a PhD in Human and Social Dimensions of Science and Technology at ASU’s School for the Future of Innovation in Society.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Jamie Winterton",
      "conference": "CACTUSCON2018",
      "id": 30236
    },
    {
      "link": "",
      "twitter": "",
      "description": "@XlogicX hacks at anything low level. He's unmasked sanitized IP addresses in packets (because checksums) and crafts his own pcaps with just xxd. He feeds complete garbage to forensic tools, AV products, decompression software, and intrusion detection systems. He made evil strings more evil (with automation) to exploit high consumption regular expressions. Lately he has been declaring war on assembly language (calling it too high-level) and doing all kinds of ignorant things with machine code. More information can be found on xlogicx.net.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "XlogicX",
      "conference": "CACTUSCON2018",
      "id": 30237
    },
    {
      "link": "",
      "twitter": "",
      "description": "Joe Ward is a Senior Security Analyst at Bishop Fox, a security consulting firm providing services to the Fortune 500, global financial institutions, and high-tech startups. In this role, he focuses on network penetration testing, security architecture, and vulnerability management. He is also an expert in Active Directory.\r\n\r\nAt Bishop Fox, Joe led the team that created the application security program for a Fortune 100 global organization. He has authored a blog post on threat modeling for Bishop Fox as well as conducted internal trainings on the subject. Several military departments have enlisted Joe’s guidance in red team and blue team training. Joe is an active member of Arizona Infragard, a government alliance that is dedicated to mitigating physical and cyber threats via information sharing.\r\n\r\nPrior to joining Bishop Fox, Joe spent 20 years in IT as a network and security engineer. Joe built datacenter implementations around the world in his past career. He has worked for various prominent enterprises such as the largest state agency in Arizona.",
      "title": "",
      "updated_at": "2018-09-26T01:18+0000",
      "name": "Joe Ward",
      "conference": "CACTUSCON2018",
      "id": 30238
    }
  ],
  "updated_at": "2018-09-26T01:18+0000"
}